{
	"foods": [
		{
			"name": "Heavenly White Cake",
			"reviews": "714",
			"directions": "Measure sifted cake flour, baking powder, and salt; sift together three times. In a mixing bowl, beat egg whites until foamy. Add 1/2 cup sugar gradually, and continue beating only until meringue will hold up in soft peaks. Beat butter until smooth. Gradually add remaining 1 cup sugar, and cream together until light and fluffy. Add sifted ingredients alternately with milk a small amount at a time, beating after each addition until smooth. Mix in flavorings. Add meringue, and mix thoroughly into batter. Spread batter in a 15 x 10 x 1 inch pan which has been lined on the bottom with parchment paper. Bake at 350 degrees F (175 degrees C) for 30 to 35 minutes. Cool cake in pan 10 minutes, then remove from pan and transfer to a wire rack to finish cooling. This cake may also be baked in two 9 inch round pans for 30 to 35 minutes, or in three 8 inch round pans for 25 to 30 minutes.",
			"rating": "4.19030714035034",
			"cook_time": 30,
			"ready_in_time": 120,
			"id": 152301,
			"prep_time": 30,
			"nutrition": [
				"Calories: 336 kcal 17 %",
				"Fat: 12.2 g 19 %",
				"Carbs: 52.1g 17 %",
				"Protein: 4.7 g 9 %",
				"Cholesterol: 32 mg 11 %",
				"Sodium: 417 mg 17 %"
			],
			"comment": "This is an old recipe I have for a white cake, and it tastes very good.",
			"cal": 336,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/778759.jpg",
			"ingredients": [
				"2 3/4 cups sifted cake flour ",
				" 4 teaspoons baking powder ",
				" 3/4 teaspoon salt ",
				" 4 egg whites ",
				" 1 1/2 cups white sugar ",
				" 3/4 cup butter ",
				" 1 cup milk ",
				" 1 teaspoon vanilla extract ",
				" 1 teaspoon almond extract "
			]
		},
		{
			"name": "Garbanzo Bean Chocolate Cake (Gluten Free!)",
			"reviews": "699",
			"directions": "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch round cake pan. Place the chocolate chips into a microwave-safe bowl. Cook in the microwave for about 2 minutes, stirring every 20 seconds after the first minute, until chocolate is melted and smooth. If you have a powerful microwave, reduce the power to 50 percent. Combine the beans and eggs in the bowl of a food processor. Process until smooth. Add the sugar and the baking powder, and pulse to blend. Pour in the melted chocolate and blend until smooth, scraping down the corners to make sure chocolate is completely mixed. Transfer the batter to the prepared cake pan. Bake for 40 minutes in the preheated oven, or until a knife inserted into the center of the cake comes out clean. Cool in the pan on a wire rack for 10 to 15 minutes before inverting onto a serving plate. Dust with confectioners' sugar just before serving.",
			"rating": "4.60744285583496",
			"cook_time": 40,
			"ready_in_time": 70,
			"id": 152302,
			"prep_time": 15,
			"nutrition": [
				"Calories: 229 kcal 11 %",
				"Fat: 8.5 g 13 %",
				"Carbs: 36.8g 12 %",
				"Protein: 5.2 g 10 %",
				"Cholesterol: 62 mg 21 %",
				"Sodium: 180 mg 7 %"
			],
			"comment": "A very good high-protein alternative to flourless chocolate cake. Give it a try!",
			"cal": 229,
			"total_time": 125,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/129267.jpg",
			"ingredients": [
				"1 1/2 cups semisweet chocolate chips ",
				" 1 (19 ounce) can garbanzo beans, rinsed and drained ",
				" 4 eggs ",
				" 3/4 cup white sugar ",
				" 1/2 teaspoon baking powder ",
				" 1 tablespoon confectioners' sugar for dusting "
			]
		},
		{
			"name": "Strawberry Cake from Scratch",
			"reviews": "864",
			"directions": "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch round cake pans. In a large bowl, cream together the butter, sugar and dry strawberry gelatin until light and fluffy. Beat in eggs one at a time, mixing well after each. Combine the flour and baking powder; stir into the batter alternately with the milk. Blend in vanilla and strawberry puree. Divide the batter evenly between the prepared pans. Bake for 25 to 30 minutes in the preheated oven, or until a small knife inserted into the center of the cake comes out clean. Allow cakes to cool in their pans over a wire rack for at least 10 minutes, before tapping out to cool completely.",
			"rating": "4.1990385055542",
			"cook_time": 30,
			"ready_in_time": 40,
			"id": 152304,
			"prep_time": 10,
			"nutrition": [
				"Calories: 393 kcal 20 %",
				"Fat: 15.4 g 24 %",
				"Carbs: 59.3g 19 %",
				"Protein: 5.4 g 11 %",
				"Cholesterol: 90 mg 30 %",
				"Sodium: 233 mg 9 %"
			],
			"comment": "It is hard to find scratch strawberry cakes, so this one is worth it weight in gold to me as a caterer. I made this cake for a child's birthday party. It was a major hit! Frost with cream cheese or vanilla frosting - or for a treat, use a chocolate glaze!",
			"cal": 393,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/962955.jpg",
			"ingredients": [
				"2 cups white sugar ",
				" 1 (3 ounce) package strawberry flavored Jell-O® ",
				" 1 cup butter, softened ",
				" 4 eggs (room temperature) ",
				" 2 3/4 cups sifted cake flour ",
				" 2 1/2 teaspoons baking powder ",
				" 1 cup whole milk, room temperature ",
				" 1 tablespoon vanilla extract ",
				" 1/2 cup strawberry puree made from frozen sweetened strawberries "
			]
		},
		{
			"name": "Extreme Chocolate Cake",
			"reviews": "1712",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 inch cake pans. Use the first set of ingredients to make the cake. In a medium bowl, stir together the sugar, flour, cocoa, baking soda, baking powder and salt. Add the eggs, milk, oil and vanilla, mix for 3 minutes with an electric mixer. Stir in the boiling water by hand. Pour evenly into the two prepared pans. Bake for 30 to 35 minutes in the preheated oven, until a toothpick inserted comes out clean. Cool for 10 minutes before removing from pans to cool completely. To make the frosting, use the second set of ingredients. Cream butter until light and fluffy. Stir in the cocoa and confectioners' sugar alternately with the milk and vanilla. Beat to a spreading consistency. Split the layers of cooled cake horizontally, cover the top of each layer with frosting, then stack them onto a serving plate. Frost the outside of the cake.",
			"rating": "4.6806206703186",
			"cook_time": 35,
			"ready_in_time": 65,
			"id": 152305,
			"prep_time": 30,
			"nutrition": [
				"Calories: 655 kcal 33 %",
				"Fat: 24.6 g 38 %",
				"Carbs: 111.1g 36 %",
				"Protein: 7.3 g 15 %",
				"Cholesterol: 64 mg 21 %",
				"Sodium: 524 mg 21 %"
			],
			"comment": "A rich moist chocolate cake with a chocolate buttercream icing. This is the best cake in the world!",
			"cal": 655,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/693494.jpg",
			"ingredients": [
				"2 cups white sugar ",
				" 1 3/4 cups all-purpose flour ",
				" 3/4 cup unsweetened cocoa powder ",
				" 1 1/2 teaspoons baking soda ",
				" 1 1/2 teaspoons baking powder ",
				" 1 teaspoon salt ",
				" 2 eggs ",
				" 1 cup milk ",
				" 1/2 cup vegetable oil ",
				" 2 teaspoons vanilla extract ",
				" 1 cup boiling water ",
				" 3/4 cup butter ",
				" 1 1/2 cups unsweetened cocoa powder ",
				" 5 1/3 cups confectioners' sugar ",
				" 2/3 cup milk ",
				" 1 teaspoon vanilla extract "
			]
		},
		{
			"name": "Baked Kale Chips",
			"reviews": "1716",
			"directions": "Preheat an oven to 350 degrees F (175 degrees C). Line a non insulated cookie sheet with parchment paper. With a knife or kitchen shears carefully remove the leaves from the thick stems and tear into bite size pieces. Wash and thoroughly dry kale with a salad spinner. Drizzle kale with olive oil and sprinkle with seasoning salt. Bake until the edges brown but are not burnt, 10 to 15 minutes.",
			"rating": "4.45976495742798",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 152308,
			"prep_time": 10,
			"nutrition": [
				"Calories: 58 kcal 3 %",
				"Fat: 2.8 g 4 %",
				"Carbs: 7.6g 2 %",
				"Protein: 2.5 g 5 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 185 mg 7 %"
			],
			"comment": "These are a low calorie nutritious snack. Like potato chips, you cannot stop at just eating one. They are great for parties and a good conversation topic.",
			"cal": 58,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/490832.jpg",
			"ingredients": [
				"1 bunch kale ",
				" 1 tablespoon olive oil ",
				" 1 teaspoon seasoned salt "
			]
		},
		{
			"name": "Annie's Fruit Salsa and Cinnamon Chips",
			"reviews": "3218",
			"directions": "In a large bowl, thoroughly mix kiwis, Golden Delicious apples, raspberries, strawberries, white sugar, brown sugar and fruit preserves. Cover and chill in the refrigerator at least 15 minutes. Preheat oven to 350 degrees F (175 degrees C). Coat one side of each flour tortilla with butter flavored cooking spray. Cut into wedges and arrange in a single layer on a large baking sheet. Sprinkle wedges with desired amount of cinnamon sugar. Spray again with cooking spray. Bake in the preheated oven 8 to 10 minutes. Repeat with any remaining tortilla wedges. Allow to cool approximately 15 minutes. Serve with chilled fruit mixture.",
			"rating": "4.77724361419678",
			"cook_time": 10,
			"ready_in_time": 45,
			"id": 152309,
			"prep_time": 15,
			"nutrition": [
				"Calories: 312 kcal 16 %",
				"Fat: 5.9 g 9 %",
				"Carbs: 59g 19 %",
				"Protein: 6.8 g 14 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 462 mg 18 %"
			],
			"comment": "Easy to make, tasty fruit salsa and cinnamon tortilla chips. Great as an appetizer or a snack. Great for anytime!",
			"cal": 312,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/829527.jpg",
			"ingredients": [
				"2 kiwis, peeled and diced ",
				" 2 Golden Delicious apples - peeled, cored and diced ",
				" 8 ounces raspberries ",
				" 1 pound strawberries ",
				" 2 tablespoons white sugar ",
				" 1 tablespoon brown sugar ",
				" 3 tablespoons fruit preserves, any flavor ",
				" 10 (10 inch) flour tortillas ",
				" butter flavored cooking spray ",
				" 2 tablespoons cinnamon sugar "
			]
		},
		{
			"name": "Kettle Corn",
			"reviews": "1094",
			"directions": "Heat the vegetable oil in a large pot over medium heat. Once hot, stir in the sugar and popcorn. Cover, and shake the pot constantly to keep the sugar from burning. Once the popping has slowed to once every 2 to 3 seconds, remove the pot from the heat and continue to shake for a few minutes until the popping has stopped. Pour into a large bowl, and allow to cool, stirring occasionally to break up large clumps.",
			"rating": "4.61837196350098",
			"cook_time": 15,
			"ready_in_time": 20,
			"id": 152310,
			"prep_time": 5,
			"nutrition": [
				"Calories: 209 kcal 10 %",
				"Fat: 11.9 g 18 %",
				"Carbs: 24.8g 8 %",
				"Protein: 2.4 g 5 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: < 1 mg < 1 %"
			],
			"comment": "Take a trip to the county fair with a bowl of old-fashioned Kettle Corn. Your family will never want plain popcorn again! If you use white sugar, it will taste like popcorn balls and if you use brown sugar, it will taste like caramel corn.",
			"cal": 209,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/699723.jpg",
			"ingredients": [
				"1/4 cup vegetable oil ",
				" 1/4 cup white sugar ",
				" 1/2 cup unpopped popcorn kernels "
			]
		},
		{
			"name": "Party Pinwheels",
			"reviews": "710",
			"directions": "In a medium-size mixing bowl, combine cream cheese, ranch dressing mix, and green onions. Spread this mixture on each tortilla. Sprinkle red pepper, celery, black olives, and cheese (if you'd like) over the cream cheese mixture. Roll up the tortillas, then wrap them tightly in aluminum foil. Chill 2 hours or overnight. Cut off ends of the rolls, and slice the chilled rolls into 1 inch slices.",
			"rating": "4.49684858322144",
			"cook_time": 5,
			"ready_in_time": 140,
			"id": 152311,
			"prep_time": 10,
			"nutrition": [
				"Calories: 229 kcal 11 %",
				"Fat: 14.5 g 22 %",
				"Carbs: 18.6g 6 %",
				"Protein: 5.9 g 12 %",
				"Cholesterol: 37 mg 12 %",
				"Sodium: 477 mg 19 %"
			],
			"comment": "A must have at holiday parties. Easily prepared and delicious!",
			"cal": 229,
			"total_time": 155,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/19872.jpg",
			"ingredients": [
				"2 (8 ounce) packages cream cheese, softened ",
				" 1 (1 ounce) package ranch dressing mix ",
				" 2 green onions, minced ",
				" 4 (12 inch) flour tortillas ",
				" 1/2 cup red bell pepper, diced ",
				" 1/2 cup diced celery ",
				" 1 (2 ounce) can sliced black olives ",
				" 1/2 cup shredded Cheddar cheese "
			]
		},
		{
			"name": "Frog Cupcakes",
			"reviews": "132",
			"directions": "Bake cupcakes according to the directions on the package. Allow them to cool completely. Scoop 2/3 of the frosting into a small bowl and mix with green food coloring. Frost the cupcakes. Sprinkle some of the green sugar over the tops. Cut the marshmallows in half to make two circles. Dip half of each marshmallow piece into water and dip into the green sugar to make the eyelids. The remaining white will be the eyes. Place on the cupcakes. Use a little bit of white icing to glue a chocolate chip into the center of each eye for the pupil. Mix the remaining frosting with red food coloring to make pink. Use the pink icing to draw smiling mouths and nostrils or even tongues on the frogs.",
			"rating": "4.82317066192627",
			"cook_time": 20,
			"ready_in_time": 45,
			"id": 152312,
			"prep_time": 25,
			"nutrition": [
				"Calories: 342 kcal 17 %",
				"Fat: 15 g 23 %",
				"Carbs: 54.5g 18 %",
				"Protein: 2.4 g 5 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 182 mg 7 %"
			],
			"comment": "These frog-faced cupcakes are fun and easy to make for a child's birthday.",
			"cal": 342,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/690412.jpg",
			"ingredients": [
				"1 (18.25 ounce) package white cake mix ",
				" 1 (16 ounce) can prepared vanilla frosting ",
				" 6 drops green food coloring, or as needed ",
				" 1/4 cup green decorator sugar ",
				" 12 large marshmallows ",
				" 48 semisweet chocolate chips ",
				" 1 drop red food coloring "
			]
		},
		{
			"name": "White Almond Wedding Cake",
			"reviews": "580",
			"directions": "Preheat oven to 325 degrees F (165 degrees C). Grease and flour an 11x13 inch cake pan. Stir together the white cake mix, flour, sugar, and salt in a large bowl until well mixed. Pour in the water, sour cream, vegetable oil, almond and vanilla extracts, and egg whites, and beat with an electric mix on low until all the ingredients are mixed and moistened but some lumps still remain, 4 minutes. Pour the batter into the prepared cake pan, and bake in the preheated oven until the top is a light golden brown and a toothpick inserted into the center of the cake comes out clean, about 25 minutes. Allow to cool before frosting.",
			"rating": "4.70752096176147",
			"cook_time": 25,
			"ready_in_time": 65,
			"id": 152313,
			"prep_time": 10,
			"nutrition": [
				"Calories: 211 kcal 11 %",
				"Fat: 6.6 g 10 %",
				"Carbs: 35.3g 11 %",
				"Protein: 2.9 g 6 %",
				"Cholesterol: 5 mg 2 %",
				"Sodium: 275 mg 11 %"
			],
			"comment": "A secret ingredient of sour cream makes this cake so moist, dense, and delicious! I use this recipe for my kids' birthdays, but it's a favorite for wedding cakes, too! This recipe can easily be doubled.",
			"cal": 211,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1044588.jpg",
			"ingredients": [
				"1 (18.25 ounce) package white cake mix ",
				" 1 cup all-purpose flour ",
				" 1 cup white sugar ",
				" 3/4 teaspoon salt ",
				" 1 1/3 cups water ",
				" 1 cup sour cream ",
				" 2 tablespoons vegetable oil ",
				" 1 teaspoon almond extract ",
				" 1 teaspoon vanilla extract ",
				" 4 egg whites "
			]
		},
		{
			"name": "Rainbow Clown Cake",
			"reviews": "225",
			"directions": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour two 8-inch round cake pans. Beat the egg whites with an electric mixer until frothy, about 1 minute. Add the cake mix, water, and canola oil; continue beating for 2 minutes on medium speed. Divide the cake batter into six separate bowls. Use a toothpick to scoop a dab of food coloring into one bowl of batter and stir; add more food coloring, if necessary, to reach the desired shade. Repeat with the remaining colors and bowls of batter. Scoop spoonfuls of batter into the prepared pans, alternating the colors. Use a toothpick to gently swirl the colors for a marbled effect. Bake in the preheated oven until a toothpick inserted into the cake comes clean, about 30-35 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
			"rating": "4.83972120285034",
			"cook_time": 30,
			"ready_in_time": 60,
			"id": 152314,
			"prep_time": 30,
			"nutrition": [
				"Calories: 309 kcal 15 %",
				"Fat: 10.5 g 16 %",
				"Carbs: 49.9g 16 %",
				"Protein: 4.2 g 8 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 446 mg 18 %"
			],
			"comment": "I went a little overboard creating a fun confetti-ish cake for a student teacher and deemed the result 'Clown Vomit Cake.' Despite its nickname, it's a popular request now with my colleagues! Frost with your favorite frosting and top with colored sugar.",
			"cal": 309,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/753334.jpg",
			"ingredients": [
				"3 egg whites ",
				" 1 (18.25 ounce) package white cake mix ",
				" 1 1/3 cups water ",
				" 2 tablespoons canola oil ",
				" red paste food coloring ",
				" orange paste food coloring ",
				" yellow paste food coloring ",
				" green paste food coloring ",
				" blue paste food coloring ",
				" purple paste food coloring "
			]
		},
		{
			"name": "Playgroup Granola Bars",
			"reviews": "1346",
			"directions": "Preheat the oven to 350 degrees F (175 degrees C). Generously grease a 9x13 inch baking pan. In a large bowl, mix together the oats, brown sugar, wheat germ, cinnamon, flour, raisins and salt. Make a well in the center, and pour in the honey, egg, oil and vanilla. Mix well using your hands. Pat the mixture evenly into the prepared pan. Bake for 30 to 35 minutes in the preheated oven, until the bars begin to turn golden at the edges. Cool for 5 minutes, then cut into bars while still warm. Do not allow the bars to cool completely before cutting, or they will be too hard to cut.",
			"rating": "4.52963972091675",
			"cook_time": 35,
			"ready_in_time": 50,
			"id": 152318,
			"prep_time": 15,
			"nutrition": [
				"Calories: 161 kcal 8 %",
				"Fat: 5.5 g 8 %",
				"Carbs: 26.6g 9 %",
				"Protein: 2.4 g 5 %",
				"Cholesterol: 8 mg 3 %",
				"Sodium: 79 mg 3 %"
			],
			"comment": "My girlfriend brought these granola bars over for a playgroup one morning and ever since they've been a staple! My son requests them almost daily so I usually triple the recipe and make 2 trays so we have plenty on hand.",
			"cal": 161,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/125805.jpg",
			"ingredients": [
				"2 cups rolled oats ",
				" 3/4 cup packed brown sugar ",
				" 1/2 cup wheat germ ",
				" 3/4 teaspoon ground cinnamon ",
				" 1 cup all-purpose flour ",
				" 3/4 cup raisins (optional) ",
				" 3/4 teaspoon salt ",
				" 1/2 cup honey ",
				" 1 egg, beaten ",
				" 1/2 cup vegetable oil ",
				" 2 teaspoons vanilla extract "
			]
		},
		{
			"name": "One Bowl Chocolate Cake III",
			"reviews": "2188",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two nine inch round pans. In a large bowl, stir together the sugar, flour, cocoa, baking powder, baking soda and salt. Add the eggs, milk, oil and vanilla, mix for 2 minutes on medium speed of mixer. Stir in the boiling water last. Batter will be thin. Pour evenly into the prepared pans. Bake 30 to 35 minutes in the preheated oven, until the cake tests done with a toothpick. Cool in the pans for 10 minutes, then remove to a wire rack to cool completely.",
			"rating": "4.70662117004395",
			"cook_time": 30,
			"ready_in_time": 60,
			"id": 152319,
			"prep_time": 20,
			"nutrition": [
				"Calories: 157 kcal 8 %",
				"Fat: 5.7 g 9 %",
				"Carbs: 25.7g 8 %",
				"Protein: 2.3 g 5 %",
				"Cholesterol: 16 mg 5 %",
				"Sodium: 217 mg 9 %"
			],
			"comment": "This is a rich and moist chocolate cake. It only takes a few minutes to prepare the batter. Frost with your favorite chocolate frosting.",
			"cal": 157,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/708879.jpg",
			"ingredients": [
				"2 cups white sugar ",
				" 1 3/4 cups all-purpose flour ",
				" 3/4 cup unsweetened cocoa powder ",
				" 1 1/2 teaspoons baking powder ",
				" 1 1/2 teaspoons baking soda ",
				" 1 teaspoon salt ",
				" 2 eggs ",
				" 1 cup milk ",
				" 1/2 cup vegetable oil ",
				" 2 teaspoons vanilla extract ",
				" 1 cup boiling water "
			]
		},
		{
			"name": "Marshmallow Fondant",
			"reviews": "979",
			"directions": "Place the butter in a shallow bowl, and set aside. Place the marshmallows in a large microwave-safe bowl, and microwave on High for 30 seconds to 1 minute to start melting the marshmallows. Carefully stir the water and vanilla extract into the hot marshmallows, and stir until the mixture is smooth. Slowly beat in the confectioners' sugar, a cup at a time, until you have a sticky dough. Reserve 1 cup of powdered sugar for kneading. The dough will be very stiff. Rub your hands thoroughly with butter, and begin kneading the sticky dough. As you knead, the dough will become workable and pliable. Turn the dough out onto a working surface dusted with confectioners' sugar and continue kneading until the fondant is smooth and no longer sticky to the touch, 5 to 10 minutes. Form the fondant into a ball, wrap it tightly in plastic wrap, and refrigerate overnight. To use, allow the fondant to come to room temperature, and roll it out onto a flat surface dusted with confectioners' sugar.",
			"rating": "4.60185194015503",
			"cook_time": 1,
			"ready_in_time": 510,
			"id": 152322,
			"prep_time": 29,
			"nutrition": [
				"Calories: 555 kcal 28 %",
				"Fat: 4.7 g 7 %",
				"Carbs: 127.3g 41 %",
				"Protein: 0 g < 1 %",
				"Cholesterol: 12 mg 4 %",
				"Sodium: 90 mg 4 %"
			],
			"comment": "This is a very easy (and a little sticky at times) way to make a delicious fondant. It's great on cakes, cookies, or just for your little ones to play with! Leftovers will save in a tightly sealed container for a few weeks.",
			"cal": 555,
			"total_time": 540,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3213022.jpg",
			"ingredients": [
				"1/4 cup butter ",
				" 1 (16 ounce) package miniature marshmallows ",
				" 1/4 cup water ",
				" 1 teaspoon vanilla extract ",
				" 2 pounds confectioners' sugar, divided "
			]
		},
		{
			"name": "Fruit Pizza I",
			"reviews": "534",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). In a large bowl, cream together the butter and 3/4 cup sugar until smooth. Mix in egg. combine the flour, cream of tartar, baking soda and salt; stir into the creamed mixture until just blended. Press dough into an ungreased pizza pan. Bake in preheated oven for 8 to 10 minutes, or until lightly browned. Cool. In a large bowl, beat cream cheese with 1/2 cup sugar and vanilla until light. Spread on cooled crust. Arrange desired fruit on top of filling, and chill.",
			"rating": "4.71292495727539",
			"cook_time": 10,
			"ready_in_time": 95,
			"id": 152323,
			"prep_time": 25,
			"nutrition": [
				"Calories: 324 kcal 16 %",
				"Fat: 17.7 g 27 %",
				"Carbs: 37.9g 12 %",
				"Protein: 4 g 8 %",
				"Cholesterol: 68 mg 23 %",
				"Sodium: 260 mg 10 %"
			],
			"comment": "A cookie dough crust, cream cheese filling, and fruit topping. Tip: For a quick crust, use one package of ready made sugar cookie dough rolled out to fit a pizza pan. Use an assortment of fresh fruit such as bananas, peaches, blueberries, kiwi, pineapple, and strawberries.",
			"cal": 324,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/251099.jpg",
			"ingredients": [
				"1/2 cup butter, softened ",
				" 3/4 cup white sugar ",
				" 1 egg ",
				" 1 1/4 cups all-purpose flour ",
				" 1 teaspoon cream of tartar ",
				" 1/2 teaspoon baking soda ",
				" 1/4 teaspoon salt ",
				" 1 (8 ounce) package cream cheese ",
				" 1/2 cup white sugar ",
				" 2 teaspoons vanilla extract "
			]
		},
		{
			"name": "Texas Sheet Cake V",
			"reviews": "464",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10x15 inch pan. Combine the flour, sugar, baking soda and salt. Beat in the sour cream and eggs. Set aside. Melt the butter on low in a saucepan, add the water and 5 tablespoons cocoa. Bring mixture to a boil then remove from heat. Allow to cool slightly, then stir cocoa mixture into the egg mixture, mixing until blended. Pour batter into prepared pan. Bake in the preheated oven for 20 minutes, or until a toothpick inserted into the center comes out clean. For the icing: In a large saucepan, combine the milk, 5 tablespoons cocoa and 1/2 cup butter. Bring to a boil, then remove from heat. Stir in the confectioners' sugar and vanilla, then fold in the nuts, mixing until blended. Spread frosting over warm cake.",
			"rating": "4.74093246459961",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 152324,
			"prep_time": 10,
			"nutrition": [
				"Calories: 256 kcal 13 %",
				"Fat: 12.5 g 19 %",
				"Carbs: 35.8g 12 %",
				"Protein: 2.4 g 5 %",
				"Cholesterol: 36 mg 12 %",
				"Sodium: 145 mg 6 %"
			],
			"comment": "I have made this recipe for years. My children always chose it for their birthday cake over any other, and it makes enough for a crowd. Moist and delicious. Very easy to make. Enjoy!",
			"cal": 256,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/36602.jpg",
			"ingredients": [
				"2 cups all-purpose flour ",
				" 2 cups white sugar ",
				" 1 teaspoon baking soda ",
				" 1/2 teaspoon salt ",
				" 1/2 cup sour cream ",
				" 2 eggs ",
				" 1 cup butter ",
				" 1 cup water ",
				" 5 tablespoons unsweetened cocoa powder ",
				" 6 tablespoons milk ",
				" 5 tablespoons unsweetened cocoa powder ",
				" 1/2 cup butter ",
				" 4 cups confectioners' sugar ",
				" 1 teaspoon vanilla extract ",
				" 1 cup chopped walnuts (optional) "
			]
		},
		{
			"name": "Red Velvet Cake",
			"reviews": "424",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9-inch round pans. Beat shortening and 1 1/2 cups sugar until very light and fluffy. Add eggs and beat well. Make a paste of cocoa and red food coloring; add to creamed mixture. Mix salt, 1 teaspoon vanilla, and buttermilk together. Add the flour to the batter, alternating with the buttermilk mixture, mixing just until incorporated. Mix soda and vinegar and gently fold into cake batter. Don't beat or stir the batter after this point. Pour batter into prepared pans. Bake in preheated oven until a tester inserted into the cake comes out clean, about 30 minutes. Cool cakes completely on wire rack. To Make Icing: Cook 5 tablespoons flour and milk over low heat till thick, stirring constantly. Let cool completely! While mixture is cooling, beat 1 cup sugar, butter, and 1 teaspoon vanilla until light and fluffy. Add cooled flour mixture and beat until frosting is a good spreading consistency. Frost cake layers when completely cool.",
			"rating": "3.95418334007263",
			"cook_time": 30,
			"ready_in_time": 145,
			"id": 152326,
			"prep_time": 25,
			"nutrition": [
				"Calories: 513 kcal 26 %",
				"Fat: 25.7 g 40 %",
				"Carbs: 66.6g 21 %",
				"Protein: 5.8 g 12 %",
				"Cholesterol: 74 mg 25 %",
				"Sodium: 502 mg 20 %"
			],
			"comment": "A family favorite--great for the Christmas holiday.",
			"cal": 513,
			"total_time": 200,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/9198.jpg",
			"ingredients": [
				"Cake: ",
				" 1/2 cup shortening ",
				" 1 1/2 cups white sugar ",
				" 2 eggs ",
				" 2 tablespoons cocoa ",
				" 4 tablespoons red food coloring ",
				" 1 teaspoon salt ",
				" 1 teaspoon vanilla extract ",
				" 1 cup buttermilk ",
				" 2 1/2 cups sifted all-purpose flour ",
				" 1 1/2 teaspoons baking soda ",
				" 1 tablespoon distilled white vinegar ",
				" Icing: ",
				" 5 tablespoons all-purpose flour ",
				" 1 cup milk ",
				" 1 cup white sugar ",
				" 1 cup butter, room temperature ",
				" 1 teaspoon vanilla extract "
			]
		},
		{
			"name": "Funfetti® Birthday Cookies",
			"reviews": "12",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Mix cake mix, eggs, and vegetable oil together in a large bowl to form a dough. Combine confectioners' sugar and sprinkles together in a small bowl. Shape dough into 1-inch balls and roll each in the confectioners' sugar mixture. Arrange cookie balls on baking sheets. Bake in the preheated oven until tops are golden, about 6 minutes. Cool on the baking sheets, about 5 minutes, before transferring to a wire rack to cool completely.",
			"rating": "4.66666650772095",
			"cook_time": 6,
			"ready_in_time": 21,
			"id": 152327,
			"prep_time": 10,
			"nutrition": [
				"Calories: 124 kcal 6 %",
				"Fat: 5.5 g 8 %",
				"Carbs: 17.7g 6 %",
				"Protein: 1.3 g 3 %",
				"Cholesterol: 16 mg 5 %",
				"Sodium: 116 mg 5 %"
			],
			"comment": "These are the best birthday cookies out there. They look, taste, and feel like a cookie. These are perfect for kids and adults alike! Delicious!",
			"cal": 124,
			"total_time": 37,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3377667.jpg",
			"ingredients": [
				"1 (15.25 ounce) package cake mix with candy bits (such as Pillsbury® Funfetti®), or more to taste ",
				" 2 eggs ",
				" 1/3 cup vegetable oil ",
				" 1/3 cup confectioners' sugar ",
				" 5 tablespoons multicolored candy sprinkles "
			]
		},
		{
			"name": "Jet Swirl Pizza Appetizers",
			"reviews": "191",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large baking sheet. Roll pizza crust dough into an approximately 10x14 inch rectangle on the baking sheet. Layer with Genoa salami, pepperoni and provolone cheese. Sprinkle with mozzarella cheese to within 1/2 inch from edges of the dough. Roll jelly roll style. Seal the edge with a fork. Bake in the preheated oven 25 minutes, or until golden brown. Slice into 1 inch pieces to serve.",
			"rating": "4.69512176513672",
			"cook_time": 25,
			"ready_in_time": 35,
			"id": 152329,
			"prep_time": 10,
			"nutrition": [
				"Calories: 456 kcal 23 %",
				"Fat: 27.3 g 42 %",
				"Carbs: 27.6g 9 %",
				"Protein: 23.3 g 47 %",
				"Cholesterol: 70 mg 23 %",
				"Sodium: 1432 mg 57 %"
			],
			"comment": "Similar to meat-filled calzones, these cheesy little swirls were invented during football season. The name was inspired by our favorite team.",
			"cal": 456,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/179267.jpg",
			"ingredients": [
				"1 (10 ounce) can refrigerated pizza crust dough ",
				" 1/4 pound Genoa salami, thinly sliced ",
				" 1/4 pound pepperoni sausage, sliced ",
				" 1/4 pound provolone cheese, sliced ",
				" 1/2 cup shredded mozzarella cheese "
			]
		},
		{
			"name": "Kale Chips",
			"reviews": "199",
			"directions": "Preheat an oven to 300 degrees F (150 degrees C). Cut away inner ribs from each kale leaf and discard; tear the leaves into pieces of uniform size. (I made my pieces about the size of a small potato chip.) Wash torn kale pieces and spin dry in a salad spinner or dry with paper towels until they're very dry. Put the kale pieces into a large resealable bag (or use a bowl if you don't mind getting your hands oily). Add about half the olive oil; seal and squeeze the bag so the oil gets distributed evenly on the kale pieces. Add the remaining oil and squeeze the bag more, until all kale pieces are evenly coated with oil and slightly 'massaged.' Sprinkle the vinegar over the kale leaves, reseal the bag, and shake to spread the vinegar evenly over the leaves. Spread the leaves evenly onto a baking sheet. Roast in the preheated oven until mostly crisp, about 35 minutes. Season with salt and serve immediately.",
			"rating": "4.26277351379395",
			"cook_time": 35,
			"ready_in_time": 50,
			"id": 152330,
			"prep_time": 15,
			"nutrition": [
				"Calories: 174 kcal 9 %",
				"Fat: 8.3 g 13 %",
				"Carbs: 22.5g 7 %",
				"Protein: 7.4 g 15 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 257 mg 10 %"
			],
			"comment": "Crispy, crunchy, and nutritious! I used Spanish sherry vinegar, but any vinegar you like the flavor of will work. I checked every 10 minutes or so and turned some pieces over. I also found I didn't mind if there were a few softer parts on some of the kale leaves, I liked the combination of crisp and softer parts.",
			"cal": 174,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/873437.jpg",
			"ingredients": [
				"1 bunch kale ",
				" 1 tablespoon extra-virgin olive oil, divided ",
				" 1 tablespoon sherry vinegar ",
				" 1 pinch sea salt, to taste "
			]
		},
		{
			"name": "Pecan Snack",
			"reviews": "177",
			"directions": "Preheat oven to 250 degrees F (120 degrees C). In a large bowl, beat egg white with water until frothy. Stir in pecans and mix to coat. Combine sugar, cinnamon and salt and stir into pecan mixture. Spread on a baking sheet. Bake in preheated oven 1 hour, stirring every 15 minutes. Store in an airtight container.",
			"rating": "4.88034200668335",
			"cook_time": 60,
			"ready_in_time": 70,
			"id": 152332,
			"prep_time": 10,
			"nutrition": [
				"Calories: 117 kcal 6 %",
				"Fat: 10.2 g 16 %",
				"Carbs: 6.7g 2 %",
				"Protein: 1.4 g 3 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 74 mg 3 %"
			],
			"comment": "These smell like a walk through a county fair, and they taste heavenly!",
			"cal": 117,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/25757.jpg",
			"ingredients": [
				"1 egg white ",
				" 1 tablespoon water ",
				" 1 pound pecans ",
				" 3/4 cup white sugar ",
				" 1 teaspoon ground cinnamon ",
				" 1 teaspoon salt "
			]
		},
		{
			"name": "Rainbow Clown Cake",
			"reviews": "225",
			"directions": "Preheat an oven to 350 degrees F (175 degrees C). Grease and flour two 8-inch round cake pans. Beat the egg whites with an electric mixer until frothy, about 1 minute. Add the cake mix, water, and canola oil; continue beating for 2 minutes on medium speed. Divide the cake batter into six separate bowls. Use a toothpick to scoop a dab of food coloring into one bowl of batter and stir; add more food coloring, if necessary, to reach the desired shade. Repeat with the remaining colors and bowls of batter. Scoop spoonfuls of batter into the prepared pans, alternating the colors. Use a toothpick to gently swirl the colors for a marbled effect. Bake in the preheated oven until a toothpick inserted into the cake comes clean, about 30-35 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack.",
			"rating": "4.83972120285034",
			"cook_time": 30,
			"ready_in_time": 60,
			"id": 152334,
			"prep_time": 30,
			"nutrition": [
				"Calories: 309 kcal 15 %",
				"Fat: 10.5 g 16 %",
				"Carbs: 49.9g 16 %",
				"Protein: 4.2 g 8 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 446 mg 18 %"
			],
			"comment": "I went a little overboard creating a fun confetti-ish cake for a student teacher and deemed the result 'Clown Vomit Cake.' Despite its nickname, it's a popular request now with my colleagues! Frost with your favorite frosting and top with colored sugar.",
			"cal": 309,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/753334.jpg",
			"ingredients": [
				"3 egg whites ",
				" 1 (18.25 ounce) package white cake mix ",
				" 1 1/3 cups water ",
				" 2 tablespoons canola oil ",
				" red paste food coloring ",
				" orange paste food coloring ",
				" yellow paste food coloring ",
				" green paste food coloring ",
				" blue paste food coloring ",
				" purple paste food coloring "
			]
		},
		{
			"name": "Granola Bars III",
			"reviews": "269",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Line a 9x13 inch baking pan with aluminum foil or parchment paper, and spray with vegetable oil spray. In a large bowl, stir together oats, flour, brown sugar, raisins, wheat germ, salt, cinnamon, and walnuts. In a smaller bowl, thoroughly blend oil, honey, egg, and vanilla; pour into the flour mixture, and mix by hand until the liquid is evenly distributed. Press evenly into the prepared baking pan. Bake 25 to 30 minutes in the preheated oven, or until the edges are golden. Cool completely in pan before turning out onto a cutting board and cutting into bars.",
			"rating": "4.54166650772095",
			"cook_time": 25,
			"ready_in_time": 40,
			"id": 152335,
			"prep_time": 15,
			"nutrition": [
				"Calories: 212 kcal 11 %",
				"Fat: 8.6 g 13 %",
				"Carbs: 32.2g 10 %",
				"Protein: 3.4 g 7 %",
				"Cholesterol: 9 mg 3 %",
				"Sodium: 66 mg 3 %"
			],
			"comment": "Absolutely delicious! Granola bars with honey, nuts and raisins. These make a great snack!",
			"cal": 212,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/336086.jpg",
			"ingredients": [
				"2 cups quick cooking oats ",
				" 1 cup all-purpose flour ",
				" 3/4 cup packed brown sugar ",
				" 3/4 cup raisins ",
				" 1/2 cup wheat germ ",
				" 1/2 teaspoon salt ",
				" 1/2 teaspoon ground cinnamon ",
				" 1/2 cup chopped English walnuts ",
				" 1/2 cup vegetable oil ",
				" 1/2 cup honey ",
				" 1 egg ",
				" 2 teaspoons vanilla extract "
			]
		},
		{
			"name": "Original Nestle® Toll House Chocolate Chip Cookies",
			"reviews": "157",
			"directions": "Preheat oven to 375 degrees F. Combine flour, baking soda and salt in small bowl. Beat butter, granulated sugar, brown sugar and vanilla extract in large mixer bowl until creamy. Add eggs, one at a time, beating well after each addition. Gradually beat in flour mixture. Stir in morsels and nuts. Drop by rounded tablespoon onto ungreased baking sheets. Bake for 9 to 11 minutes or until golden brown. Cool on baking sheets for 2 minutes; remove to wire racks to cool completely.",
			"rating": "4.5969386100769",
			"cook_time": 9,
			"ready_in_time": 39,
			"id": 152337,
			"prep_time": 15,
			"nutrition": [
				"Calories: 108 kcal 5 %",
				"Fat: 6.2 g 10 %",
				"Carbs: 12.7g 4 %",
				"Protein: 1.4 g 3 %",
				"Cholesterol: 14 mg 5 %",
				"Sodium: 85 mg 3 %"
			],
			"comment": "This famous classic American cookie is a treat no matter what the age or occasion. Enjoy it with a glass of cold milk.",
			"cal": 108,
			"total_time": 63,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/1477826.jpg",
			"ingredients": [
				"2 1/4 cups all-purpose flour ",
				" 1 teaspoon baking soda ",
				" 1 teaspoon salt ",
				" 1 cup butter, softened ",
				" 3/4 cup granulated sugar ",
				" 3/4 cup packed brown sugar ",
				" 1 teaspoon vanilla extract ",
				" 2 large eggs ",
				" 2 cups NESTLE® TOLL HOUSE® Semi-Sweet Chocolate Morsels ",
				" 1 cup chopped nuts "
			]
		},
		{
			"name": "Stephen's Chocolate Chip Cookies",
			"reviews": "263",
			"directions": "Preheat the oven to 350 degrees F (175 degrees C). In a medium bowl, cream together the butter, brown sugar, and white sugar. Mix in the eggs and vanilla. Combine the flour, baking soda, baking powder, and salt; add to butter mixture, and stir until just blended. With a large wooden spoon, stir in the white, milk, and semi-sweet chocolate chips. Stir in the walnuts, pecans, and almonds. Drop dough by heaping spoonfuls onto ungreased cookie sheets. Bake for 10 to 12 minutes in the preheated oven. Allow cookies to cool on the baking sheet before transferring to wire racks to cool completely.",
			"rating": "4.62738847732544",
			"cook_time": 12,
			"ready_in_time": 50,
			"id": 152338,
			"prep_time": 15,
			"nutrition": [
				"Calories: 146 kcal 7 %",
				"Fat: 7.8 g 12 %",
				"Carbs: 18.4g 6 %",
				"Protein: 1.8 g 4 %",
				"Cholesterol: 19 mg 6 %",
				"Sodium: 95 mg 4 %"
			],
			"comment": "I created this recipe for my father on his birthday. It contains lots of different chocolates and nuts. Thanks Dad for sending me to cookie baking school at the San Francisco Culinary Academy! This one is just for you!",
			"cal": 146,
			"total_time": 77,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/771891.jpg",
			"ingredients": [
				"1 cup butter ",
				" 1 cup brown sugar ",
				" 1 cup white sugar ",
				" 2 eggs ",
				" 1 teaspoon vanilla extract ",
				" 2 1/2 cups all-purpose flour ",
				" 1 teaspoon baking soda ",
				" 1 teaspoon baking powder ",
				" 1/2 teaspoon salt ",
				" 2/3 cup white chocolate chips ",
				" 2/3 cup milk chocolate chips ",
				" 2/3 cup semisweet chocolate chips ",
				" 1/3 cup chopped walnuts ",
				" 1/3 cup chopped pecans ",
				" 1/3 cup chopped almonds "
			]
		},
		{
			"name": "Daddy's Popcorn",
			"reviews": "169",
			"directions": "Start by cutting a paper grocery sack in half. This will serve as a makeshift serving bowl and it will absorb excess oil. In a 2 quart pot, combine the oil, margarine and popcorn. Set over high heat, and constantly shake the pan back and forth. After the first kernel of corn pops, place the lid on the pot, and continue shaking. When the popcorn starts to lift the lid up off the pan, remove it from the heat, and hold it over the paper bag until it stops popping. Pour into the paper sack and season with half of the seasoned salt. Shake the paper sack to distribute the salt. Taste before adding more so you don't make it too salty. You can always add more salt.",
			"rating": "4.77251195907593",
			"cook_time": 5,
			"ready_in_time": 7,
			"id": 152339,
			"prep_time": 2,
			"nutrition": [
				"Calories: 285 kcal 14 %",
				"Fat: 22.8 g 35 %",
				"Carbs: 18.7g 6 %",
				"Protein: 3.2 g 6 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 209 mg 8 %"
			],
			"comment": "You will never go back microwave popcorn after trying this range-top recipe. It is made with oil, margarine, and seasoned salt.",
			"cal": 285,
			"total_time": 14,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/911939.jpg",
			"ingredients": [
				"1/4 cup vegetable oil ",
				" 3 tablespoons margarine ",
				" 1/2 cup unpopped popcorn ",
				" 1/2 teaspoon seasoned salt, or to taste "
			]
		},
		{
			"name": "Baked Tortilla Chips",
			"reviews": "316",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Cut each tortilla into 8 chip sized wedges and arrange the wedges in a single layer on a cookie sheet. In a mister, combine the oil and lime juice. Mix well and spray each tortilla wedge until slightly moist. Combine the cumin, chili powder and salt in a small bowl and sprinkle on the chips. Bake for about 7 minutes. Rotate the pan and bake for another 8 minutes or until the chips are crisp, but not too brown. Serve with salsas, garnishes or guacamole.",
			"rating": "4.32142877578735",
			"cook_time": 15,
			"ready_in_time": 25,
			"id": 152341,
			"prep_time": 10,
			"nutrition": [
				"Calories: 147 kcal 7 %",
				"Fat: 4.1 g 6 %",
				"Carbs: 26g 8 %",
				"Protein: 3.3 g 7 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 418 mg 17 %"
			],
			"comment": "Tasty baked tortilla chips you make at home that are much better than store bought chips. Serve with your choice of salsas and garnishes.",
			"cal": 147,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/176568.jpg",
			"ingredients": [
				"1 (12 ounce) package corn tortillas ",
				" 1 tablespoon vegetable oil ",
				" 3 tablespoons lime juice ",
				" 1 teaspoon ground cumin ",
				" 1 teaspoon chili powder ",
				" 1 teaspoon salt "
			]
		},
		{
			"name": "Antojitos Minis",
			"reviews": "192",
			"directions": "Preheat oven to 425 degrees F (220 degrees C). Lightly grease two 12 cup muffin pans. Cut each tortilla into 6 smaller round pieces. Insert the pieces into the muffin tin cups. Arrange the white Cheddar cheese, Monterey Jack cheese, Cheddar cheese, tomato, red bell pepper, green onions, black beans, hot salsa and chili powder in the cups as desired. Bake in the preheated oven 5 minutes, or until the cheeses are lightly browned and bubbly.",
			"rating": "4.6307053565979",
			"cook_time": 5,
			"ready_in_time": 25,
			"id": 152342,
			"prep_time": 20,
			"nutrition": [
				"Calories: 109 kcal 5 %",
				"Fat: 5 g 8 %",
				"Carbs: 11.4g 4 %",
				"Protein: 4.6 g 9 %",
				"Cholesterol: 11 mg 4 %",
				"Sodium: 209 mg 8 %"
			],
			"comment": "These little Mexican inspired appetizers are easy to prepare and the many ingredients may be varied according to taste. Try layering the cheeses and vegetables in different variations for a colorful and exciting platter.",
			"cal": 109,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2435727.jpg",
			"ingredients": [
				"4 (12 inch) flour tortillas ",
				" 3 ounces shredded white Cheddar cheese ",
				" 3 ounces shredded Monterey Jack cheese ",
				" 3 ounces shredded Cheddar cheese ",
				" 1 tomato, diced ",
				" 1 cup chopped red bell pepper ",
				" 1/8 cup chopped green onions ",
				" 1/3 cup black beans, drained ",
				" 2 tablespoons hot salsa ",
				" 1/8 teaspoon chili powder "
			]
		},
		{
			"name": "Spinach Balls",
			"reviews": "178",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). In a large bowl combine spinach, stuffing mix, Parmesan cheese, garlic powder, black pepper, Italian seasoning, melted butter and eggs. Shape into walnut-sized balls and place on a baking sheet. Bake in preheated oven for 20 minutes, or until heated through and browned.",
			"rating": "4.37610626220703",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 152344,
			"prep_time": 10,
			"nutrition": [
				"Calories: 259 kcal 13 %",
				"Fat: 12.2 g 19 %",
				"Carbs: 29.6g 10 %",
				"Protein: 8.2 g 16 %",
				"Cholesterol: 76 mg 25 %",
				"Sodium: 732 mg 29 %"
			],
			"comment": "Yum Yum.",
			"cal": 259,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/175607.jpg",
			"ingredients": [
				"1 (10 ounce) package frozen chopped spinach, thawed and drained ",
				" 2 cups finely crushed herb-seasoned dry bread stuffing mix ",
				" 1/2 cup grated Parmesan cheese ",
				" 2 teaspoons garlic powder ",
				" 1/2 teaspoon ground black pepper ",
				" 1 teaspoon Italian seasoning ",
				" 1/2 cup melted butter ",
				" 3 eggs, beaten "
			]
		},
		{
			"name": "Candied Almonds",
			"reviews": "261",
			"directions": "Combine the water, sugar, and cinnamon in a saucepan over medium heat; bring to a boil; add the almonds. Cook and stir the mixture until the liquid evaporates and leaves a syrup-like coating on the almonds. Pour the almonds onto a baking sheet lined with waxed paper. Separate almonds using forks. Allow to cool about 15 minutes.",
			"rating": "4.55228757858276",
			"cook_time": 15,
			"ready_in_time": 35,
			"id": 152345,
			"prep_time": 5,
			"nutrition": [
				"Calories: 304 kcal 15 %",
				"Fat: 18 g 28 %",
				"Carbs: 32.7g 11 %",
				"Protein: 7.6 g 15 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: < 1 mg < 1 %"
			],
			"comment": "This is a favorite with my father. They taste so good warm! Substitute any type of nuts you prefer.",
			"cal": 304,
			"total_time": 55,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/844886.jpg",
			"ingredients": [
				"1/2 cup water ",
				" 1 cup white sugar ",
				" 1 tablespoon ground cinnamon ",
				" 2 cups whole almonds "
			]
		},
		{
			"name": "Mexican Pizza I",
			"reviews": "129",
			"directions": "Heat the refried beans. In a large skillet, brown the ground beef. Stir in the seasoning packet. Preheat oven to 350 degrees F (175 degrees C). Place a small amount of vegetable oil in a large skillet. Let the oil heat, then place one corn tortilla in the skillet. After 15 seconds, flip the tortilla over and let it fry another 15 seconds. Repeat this process with the remaining tortillas, letting them drain on paper towels once they have been heated. When the tortillas have drained, arrange them on a cookie sheet. Spread a thin layer of beans on the tortillas, followed by a layer of beef, and cheese. Bake the tortillas in the preheated oven for 20 to 30 minutes. Slice the tortillas into wedges and arrange them on plates or a serving platter and garnish them with the sour cream, tomatoes, green onions, chiles, avocado, and olives.",
			"rating": "4.46153831481934",
			"cook_time": 30,
			"ready_in_time": 50,
			"id": 152347,
			"prep_time": 17,
			"nutrition": [
				"Calories: 770 kcal 39 %",
				"Fat: 48.1 g 74 %",
				"Carbs: 42.3g 14 %",
				"Protein: 42.1 g 84 %",
				"Cholesterol: 150 mg 50 %",
				"Sodium: 1542 mg 62 %"
			],
			"comment": "Mexican Pizzas are delicious corn tortillas topped with beans, beef and all the delicious taco toppings you can imagine! They can be cut into wedges and served as an appetizer or left whole and served as a main dish.",
			"cal": 770,
			"total_time": 97,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/377465.jpg",
			"ingredients": [
				"1 (16 ounce) can refried beans ",
				" 1 pound ground beef ",
				" 1 (1.25 ounce) package taco seasoning mix ",
				" 1 tablespoon vegetable oil ",
				" 4 (6 inch) corn tortillas ",
				" 8 ounces shredded Cheddar cheese ",
				" 8 tablespoons sour cream ",
				" 2 roma (plum) tomatoes, chopped ",
				" 2 green onion, chopped ",
				" 1 (4 ounce) can diced green chiles, drained ",
				" 1/2 avocado, diced ",
				" 1 tablespoon black olives, sliced "
			]
		},
		{
			"name": "Sticky Monkey Brains",
			"reviews": "193",
			"directions": "Preheat the oven to 350 degrees F (175 degrees C). Grease 6 miniature Bundt pans. In a small bowl, stir together the white sugar and cinnamon. Set aside. Use scissors or a knife to cut each of the biscuits into various sizes. Each one can be cut into anywhere from 2 to 5 pieces. Sprinkle about half of the pecans amongst the 6 prepared pans. Roll pieces of biscuit in the cinnamon-sugar, and place them into the pans, distributing evenly. Sprinkle any remaining cinnamon-sugar over the dough balls. Mix together the brown sugar and melted butter. Stir in the remaining pecans. Distribute evenly over the pans of dough balls. For ease of getting in and out of the oven, place all of the pans on a cookie sheet. Bake for 20 minutes in the preheated oven, or until the biscuits are toasted and cooked through. Remove from the oven, and invert individual pans onto serving plates while still hot.",
			"rating": "4.71146249771118",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 152348,
			"prep_time": 10,
			"nutrition": [
				"Calories: 632 kcal 32 %",
				"Fat: 36.3 g 56 %",
				"Carbs: 70.9g 23 %",
				"Protein: 8.1 g 16 %",
				"Cholesterol: 42 mg 14 %",
				"Sodium: 1176 mg 47 %"
			],
			"comment": "This gooey cinnamon pull apart recipe will impress everyone in your family! It is an easy (and I mean EASY), fast, and tasty modification of my boyfriend's grandmother's monkey brain recipe. I use 6 small Bundt pans instead of one big one so the cinnamon balls are more gooey :)Fun to make and even more fun to eat!",
			"cal": 632,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/68596.jpg",
			"ingredients": [
				"3 (7.5 ounce) packages refrigerated biscuit dough ",
				" 1/3 cup white sugar ",
				" 2 teaspoons ground cinnamon ",
				" 1/2 cup chopped pecans ",
				" 1/2 cup butter, melted ",
				" 1/2 cup brown sugar "
			]
		},
		{
			"name": "Frog Cupcakes",
			"reviews": "132",
			"directions": "Bake cupcakes according to the directions on the package. Allow them to cool completely. Scoop 2/3 of the frosting into a small bowl and mix with green food coloring. Frost the cupcakes. Sprinkle some of the green sugar over the tops. Cut the marshmallows in half to make two circles. Dip half of each marshmallow piece into water and dip into the green sugar to make the eyelids. The remaining white will be the eyes. Place on the cupcakes. Use a little bit of white icing to glue a chocolate chip into the center of each eye for the pupil. Mix the remaining frosting with red food coloring to make pink. Use the pink icing to draw smiling mouths and nostrils or even tongues on the frogs.",
			"rating": "4.82317066192627",
			"cook_time": 20,
			"ready_in_time": 45,
			"id": 152349,
			"prep_time": 25,
			"nutrition": [
				"Calories: 342 kcal 17 %",
				"Fat: 15 g 23 %",
				"Carbs: 54.5g 18 %",
				"Protein: 2.4 g 5 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 182 mg 7 %"
			],
			"comment": "These frog-faced cupcakes are fun and easy to make for a child's birthday.",
			"cal": 342,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/690412.jpg",
			"ingredients": [
				"1 (18.25 ounce) package white cake mix ",
				" 1 (16 ounce) can prepared vanilla frosting ",
				" 6 drops green food coloring, or as needed ",
				" 1/4 cup green decorator sugar ",
				" 12 large marshmallows ",
				" 48 semisweet chocolate chips ",
				" 1 drop red food coloring "
			]
		},
		{
			"name": "Deep Chocolate Raspberry Cake",
			"reviews": "117",
			"directions": "Preheat oven to 300 degrees F (150 degrees C). Line bottoms of two 9-inch cake pans with parchment or waxed paper. To Make Cake: Melt 6 ounces of semisweet chocolate and 6 ounces of unsweetened chocolate in the top of a double boiler, or in a microwave. Cool, and beat in egg yolks. In a large bowl, beat butter, 1 1/2 cups sugar, and vanilla until light and fluffy. Add chocolate mixture, and continue beating until smooth. Stir in flour until just combined. In another bowl, beat egg whites until foamy. Gradually beat in 1/2 cup sugar, and continue beating until the whites hold soft peaks. Fold whites into chocolate batter, in three additions. Pour batter into prepared pans, and smooth tops. Bake in preheated oven until a toothpick stuck into the centers of the cakes comes out with moist crumbs, about 45 minutes. Cool in pans. To Make Frosting: In a saucepan, bring cream just to a boil. Chop 6 ounces semisweet chocolate, and stir into the cream. Remove saucepan from heat, and continue stirring until smooth. Pour frosting into bowl, and press sheet of plastic wrap directly against surface of chocolate to prevent a skin from forming. Refrigerate until thick enough to spread. To Make Filling: Drain the thawed raspberries, if necessary, and combine with the jam. Sandwich the cake layers with raspberry filling. Spread top and sides with chocolate frosting.",
			"rating": "4.19424438476563",
			"cook_time": 45,
			"ready_in_time": 145,
			"id": 152353,
			"prep_time": 40,
			"nutrition": [
				"Calories: 629 kcal 31 %",
				"Fat: 40.2 g 62 %",
				"Carbs: 67.9g 22 %",
				"Protein: 9.1 g 18 %",
				"Cholesterol: 170 mg 57 %",
				"Sodium: 159 mg 6 %"
			],
			"comment": "Rich chocolate paired with raspberries--this cake is moist and fudgy. For a special treat, garnish it with fresh raspberries!",
			"cal": 629,
			"total_time": 230,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/96095.jpg",
			"ingredients": [
				"6 (1 ounce) squares semi-sweet chocolate ",
				" 6 (1 ounce) squares unsweetened chocolate ",
				" 7 eggs, separated ",
				" 1 cup all-purpose flour ",
				" 1 cup butter, room temperature ",
				" 2 cups white sugar ",
				" 1 1/2 teaspoons vanilla extract ",
				" 6 (1 ounce) squares semisweet chocolate ",
				" 3/4 cup heavy whipping cream ",
				" 1 (4 ounce) package frozen raspberries, thawed ",
				" 3 tablespoons seedless raspberry preserves "
			]
		},
		{
			"name": "Bacon Cheese Puffs",
			"reviews": "116",
			"directions": "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble and set aside. Preheat oven to broil. In a medium bowl combine the bacon, cheese, mustard and mayonnaise. Stir well. Arrange party bread on a cookie sheet. Spoon mixture onto each slice of bread. Broil for 5 minutes, or until bubbly.",
			"rating": "4.42361116409302",
			"cook_time": 5,
			"ready_in_time": 30,
			"id": 152354,
			"prep_time": 25,
			"nutrition": [
				"Calories: 302 kcal 15 %",
				"Fat: 24.4 g 38 %",
				"Carbs: 12.1g 4 %",
				"Protein: 8.7 g 17 %",
				"Cholesterol: 34 mg 11 %",
				"Sodium: 494 mg 20 %"
			],
			"comment": "A family favorite, especially on New Year's Eve, this pumpernickel party appetizer with bacon and cheese topping is perfect for holiday parties, ball games or a quick snack.",
			"cal": 302,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1097241.jpg",
			"ingredients": [
				"1 pound sliced bacon ",
				" 2 1/2 cups shredded Cheddar cheese ",
				" 2 tablespoons prepared mustard ",
				" 1 cup mayonnaise ",
				" 1 pound sliced pumpernickel party bread "
			]
		},
		{
			"name": "Guinness® and Chocolate Cheesecake",
			"reviews": "130",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Prepare a 9 inch springform pan with butter. Combine the crushed cookies, butter, 2 tablespoons sugar, and cocoa in a small bowl; mix; press into the bottom of the prepared springform pan. Place the cream cheese in a large bowl and beat with an electric mixer set to low speed until smooth. While beating, slowly add 1 cup sugar and then the eggs, one at a time. Continue beating until smooth. Combine the chocolate chips and heavy cream in a microwave-safe bowl. Heat in the microwave until the chocolate is completely melted, stirring every 30 seconds. Beat the chocolate into the cream cheese mixture. Add the sour cream, salt, beer, and vanilla; blend until smooth. Pour the mixture over the crust. Place the pan into a large, deep baking dish. Fill the dish with water to cover the bottom half of the springform pan. Bake the cheesecake in the water bath in the preheated oven for 45 minutes; turn oven off; leave the cheesecake in the oven with oven door slightly ajar another 45 minutes; remove from oven. Run a knife along the edge of the cheesecake to loosen from pan. Chill in refrigerator at least 4 hours. Melt the semisweet chocolate in a small bowl using the microwave. Make chocolate clovers by dropping 3 small drops of melted chocolate close to one another on waxed paper. Drag a toothpick from between two dots outward to make the stem; chill until hardened. Arrange the chocolate clovers on top of the chilled cheesecake for decoration.",
			"rating": "4.30821895599365",
			"cook_time": 45,
			"ready_in_time": 80,
			"id": 152356,
			"prep_time": 35,
			"nutrition": [
				"Calories: 521 kcal 26 %",
				"Fat: 37.3 g 57 %",
				"Carbs: 41.9g 14 %",
				"Protein: 8.2 g 16 %",
				"Cholesterol: 130 mg 43 %",
				"Sodium: 278 mg 11 %"
			],
			"comment": "A close friend is a cheesecake and Guinness fanatic. He requested a Guinness cheesecake for his 25th birthday; this is the result. It is quite smooth and very rich.",
			"cal": 521,
			"total_time": 160,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2187266.jpg",
			"ingredients": [
				"1 cup crushed chocolate cookies ",
				" 1/4 cup butter, softened ",
				" 2 tablespoons white sugar ",
				" 1/4 teaspoon unsweetened cocoa powder ",
				" 3 (8 ounce) packages cream cheese, softened ",
				" 1 cup white sugar ",
				" 3 eggs ",
				" 1/2 pound semisweet chocolate chips ",
				" 2 tablespoons heavy cream ",
				" 1 cup sour cream ",
				" 1 pinch salt ",
				" 3/4 cup Irish stout beer (e.g. Guinness®) ",
				" 2 teaspoons vanilla extract ",
				" 1 (1 ounce) square semisweet chocolate "
			]
		},
		{
			"name": "Cranberry Nut Granola Bars",
			"reviews": "117",
			"directions": "Preheat an oven to 350 degrees F (175 degrees C). Line a 13x9-inch pan with lightly-greased parchment paper; an inch or so of parchment paper should stick up on 2 sides to form lifting handles. Mix the quick-cooking oats, old-fashioned oats, pumpkin seeds, almonds, mixed nuts, cranberries, and sweetened condensed milk together in a bowl; spread into the prepared pan, evenly pressing into the corners and out to the sides. Bake in the preheated oven until the edges are golden brown, 20-25 minutes, using slightly less time for chewier bars and slightly more time for crunchier bars. Allow the the bars cool for 5 minutes in the pan before using the parchment paper to lift them from the pan. Use a sharp knife to cut into bars. Let the bars cool completely and store in an airtight container.",
			"rating": "4.78417253494263",
			"cook_time": 20,
			"ready_in_time": 75,
			"id": 152360,
			"prep_time": 10,
			"nutrition": [
				"Calories: 169 kcal 8 %",
				"Fat: 7.5 g 12 %",
				"Carbs: 22.3g 7 %",
				"Protein: 4.8 g 10 %",
				"Cholesterol: 6 mg 2 %",
				"Sodium: 60 mg 2 %"
			],
			"comment": "This is one fast and totally addicting recipe. It's easy to adjust to your tastes or what's in your cupboard - try adding chocolate chips, coconut, raisins, cherries or a spoonful of peanut butter. You'll be making this every week.",
			"cal": 169,
			"total_time": 105,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/613888.jpg",
			"ingredients": [
				"2 cups quick-cooking oats ",
				" 1 cup old-fashioned oats ",
				" 1/2 cup hulled pumpkin seeds ",
				" 1/2 cup slivered almonds ",
				" 1 cup mixed nuts ",
				" 1 cup dried cranberries ",
				" 1 (14 ounce) can sweetened condensed milk "
			]
		},
		{
			"name": "Irish Cream Creme Brulee",
			"reviews": "125",
			"directions": "Preheat oven to 300 degrees F (150 degrees C). Place 6 ramekins on a towel set in a roasting pan at least 3 inches deep. Stir together cream and sugar in a saucepan over medium heat, and cook until very hot, stirring until the sugar dissolves. Whisk together egg yolks, vanilla, and Irish cream until combined. Slowly add 1/3 of the hot cream, whisking it in 2 tablespoons at a time until incorporated. Once you have incorporated 1/3 of the cream, you can stir in the remaining hot cream without fear of the mixture curdling. Pour custard into the ramekins, then fill roasting pan with boiling hot water to come halfway up the sides of the ramekins. Bake in preheated oven until set, 50 to 60 minutes. Once the custard has set, place ramekins on a wire rack, and allow to cool to room temperature, about 1 hour. Cover, and refrigerate until cold, about 4 hours. Custards may remain refrigerated until ready to serve. Unwrap the custards, and sprinkle about 1 teaspoon of superfine sugar onto each. Gently shake the custards so the sugar coats the entire top surface, then tip the custards to a 45 degree angle and shake off excess sugar. Using a small hand torch, melt the sugar by making short passes over top of the custards with the flame not quite touching. Continue melting the sugar until it turns deep brown. Once the sugar has melted and turned to caramel, the cold custard underneath will harden the sugar into a crispy crust. Serve immediately. Alternatively, the sugar-dusted custards may be browned underneath the broiler in the oven.",
			"rating": "4.7724552154541",
			"cook_time": 70,
			"ready_in_time": 385,
			"id": 152362,
			"prep_time": 15,
			"nutrition": [
				"Calories: 417 kcal 21 %",
				"Fat: 33.8 g 52 %",
				"Carbs: 21.8g 7 %",
				"Protein: 4.3 g 9 %",
				"Cholesterol: 314 mg 105 %",
				"Sodium: 39 mg 2 %"
			],
			"comment": "This is a great twist on an excellent dessert! We first had this at the English restaurant at Epcot, and this is the recipe I came up with the recreate it.",
			"cal": 417,
			"total_time": 470,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/995355.jpg",
			"ingredients": [
				"2 cups heavy cream ",
				" 1/3 cup white sugar ",
				" 6 egg yolks ",
				" 1 teaspoon vanilla extract ",
				" 3 tablespoons Irish cream liqueur ",
				" superfine sugar as needed "
			]
		},
		{
			"name": "Coconut Cake IV",
			"reviews": "134",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 10-inch tube pan. Mix flour, baking powder, and salt together and set aside. Beat butter and sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. Add the room-temperature eggs one at a time, allowing each egg to blend into the butter mixture before adding the next. Mix in coconut extract. Pour in the flour mixture alternately with the buttermilk, mixing until just incorporated. Fold in coconut, mixing just enough to evenly combine. Pour batter into prepared pan. Bake at 350 degrees F (175 degrees C) for 1 hour, or until a toothpick inserted into the cake comes out clean.",
			"rating": "4.35570478439331",
			"cook_time": 60,
			"ready_in_time": 90,
			"id": 152366,
			"prep_time": 30,
			"nutrition": [
				"Calories: 408 kcal 20 %",
				"Fat: 19.5 g 30 %",
				"Carbs: 53.9g 17 %",
				"Protein: 5.8 g 12 %",
				"Cholesterol: 119 mg 40 %",
				"Sodium: 493 mg 20 %"
			],
			"comment": "This cake is soooo good and moist you should make two...that way you can be sure to get some. I take it to work and it disappears really fast.",
			"cal": 408,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/972033.jpg",
			"ingredients": [
				"2 cups all-purpose flour ",
				" 1 tablespoon baking powder ",
				" 1 teaspoon salt ",
				" 1 cup butter, room temperature ",
				" 2 cups white sugar ",
				" 5 eggs, room temperature ",
				" 1 teaspoon coconut extract ",
				" 1 cup buttermilk, room temperature ",
				" 1 cup flaked coconut "
			]
		},
		{
			"name": "Broiled Lemon and Garlic Tiger Prawns",
			"reviews": "90",
			"directions": "Preheat oven on broiler setting. With a sharp knife, remove tails from prawns, and butterfly them from the underside. Arrange prawns on broiler pan. In a small saucepan, melt butter with garlic and lemon juice. Pour 1/4 cup butter mixture in a small bowl, and brush onto prawns. Sprinkle Parmesan cheese over shrimp. Place broiler pan on top rack, and broil prawns for 4 to 5 minutes, or until done. Serve with remaining butter mixture for dipping.",
			"rating": "4.61983489990234",
			"cook_time": 5,
			"ready_in_time": 15,
			"id": 152367,
			"prep_time": 10,
			"nutrition": [
				"Calories: 371 kcal 19 %",
				"Fat: 32.4 g 50 %",
				"Carbs: 0.6g < 1 %",
				"Protein: 19.8 g 40 %",
				"Cholesterol: 256 mg 85 %",
				"Sodium: 455 mg 18 %"
			],
			"comment": "This is a family favorite for home movie night; it's quick and easy and kids like the 'finger food' style.",
			"cal": 371,
			"total_time": 30,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1089435.jpg",
			"ingredients": [
				"1 1/2 pounds tiger prawns, peeled and deveined ",
				" 1 cup butter ",
				" 1 teaspoon minced garlic ",
				" 1 1/2 tablespoons lemon juice ",
				" 3 tablespoons grated Parmesan cheese "
			]
		},
		{
			"name": "Hot Chocolate",
			"reviews": "97",
			"directions": "Put milk into a microwave-safe container and cook on High in microwave for 2 minutes. Mix in chocolate, sugar, and cinnamon. In a small bowl, whisk an egg until smooth, then mix it into the chocolate mixture. Return to microwave and cook on High for 3 to 4 minutes or until foamy (be careful not to let it boil.) Whisk until smooth and pour into 3 mugs. Garnish with a sprinkle of cinnamon if desired.",
			"rating": "4.27118635177612",
			"cook_time": 10,
			"ready_in_time": 15,
			"id": 152369,
			"prep_time": 3,
			"nutrition": [
				"Calories: 256 kcal 13 %",
				"Fat: 12.5 g 19 %",
				"Carbs: 26.7g 9 %",
				"Protein: 11.5 g 23 %",
				"Cholesterol: 82 mg 27 %",
				"Sodium: 123 mg 5 %"
			],
			"comment": "Hot chocolate made from scratch in the microwave. If your kids can use the microwave, they can make this recipe!",
			"cal": 256,
			"total_time": 28,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/46221.jpg",
			"ingredients": [
				"3 cups milk ",
				" 1/3 cup semisweet chocolate, grated ",
				" 1 tablespoon white sugar ",
				" 1/2 teaspoon ground cinnamon ",
				" 1 egg "
			]
		},
		{
			"name": "Eclair Cake with Chocolate Ganache",
			"reviews": "91",
			"directions": "Preheat an oven to 400 degrees F (200 degrees C). Grease a 9x13-inch baking dish. Place a mixing bowl in the freezer to chill. Combine the water, butter, and salt in a medium saucepan and bring to a boil over medium-high heat. Reduce the heat to medium and stir in the flour. Cook and stir until the mixture pulls away from the sides of the pan and forms a ball. Transfer the mixture to a mixing bowl and beat in the eggs, one at a time, until fully incorporated. Spread the dough evenly in the bottom of the baking dish. Bake the pastry in the preheated oven until golden brown, 25 to 30 minutes. (The dough will rise and make a boat shape, but should drop as it cools.) Cool completely on wire rack. Remove the chilled mixing bowl from the freezer and pour in 2 cups of cold whipping cream. Whip until the cream thickens, about 1 minute; stir in the confectioners' sugar and the vanilla extract. Continue to whip until the cream forms stiff peaks. Refrigerate the whipped cream while you mix the pudding. Pour the pudding mixes and the milk into a mixing bowl and stir until creamy. Fold in the whipped cream. Spread the filling over the cooled crust and refrigerate. Place the chopped chocolate in a heat-proof bowl. Bring 1 cup of cream almost to a boil in a small saucepan over medium heat. Pour the hot cream over the chocolate and allow it to soften for 1 minute. Whisk the mixture until smooth. Let the mixture cool slightly to thicken, about 10 minutes. Pour the ganache over the cream filling, spreading to cover the entire surface. Return the pan to the refrigerator and chill for at least 1 hour before serving.",
			"rating": "4.71818161010742",
			"cook_time": 25,
			"ready_in_time": 160,
			"id": 152371,
			"prep_time": 30,
			"nutrition": [
				"Calories: 530 kcal 27 %",
				"Fat: 38.9 g 60 %",
				"Carbs: 39.6g 13 %",
				"Protein: 6.9 g 14 %",
				"Cholesterol: 161 mg 54 %",
				"Sodium: 400 mg 16 %"
			],
			"comment": "A delicious, creamy filling on top of a light choux pastry gets glazed with a rich chocolate ganache. This dessert sounds fancy but it is so easy to make and it's a definite crowd-pleaser!",
			"cal": 530,
			"total_time": 215,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/586096.jpg",
			"ingredients": [
				"Pastry Shell: ",
				" 1 cup water ",
				" 1/2 cup butter ",
				" 1/4 teaspoon salt ",
				" 1 cup all-purpose flour ",
				" 4 eggs ",
				" Filling: ",
				" 2 cups cold heavy whipping cream ",
				" 2 tablespoons confectioners' sugar ",
				" 1 teaspoon vanilla extract ",
				" 2 (3.5 ounce) packages instant vanilla pudding mix ",
				" 2 cups cold milk ",
				" Chocolate Ganache: ",
				" 1 cup bittersweet chocolate, chopped ",
				" 1 cup heavy cream "
			]
		},
		{
			"name": "Ravishing Red Velvet Cake",
			"reviews": "78",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch round pans. Beat shortening and sugar until light and fluffy. Add eggs one at a time, mixing until fully incorporated. Stir in butter flavoring. Make a paste with food coloring and cocoa and add to the shortening mixture. Mix buttermilk, salt, baking soda and vinegar; add to batter alternating with the flour mixture. Divide batter into prepared pans. Bake in preheated oven until cake springs back when touched lightly with a finger or tester comes out clean, 20 to 30 minutes. Cook completely on wire rack. To Make Cream Cheese Frosting: beat butter and cream cheese with an electric mixer until smooth. Gradually beat in confectioners' sugar and 1 teaspoon vanilla. Mix until well blended.",
			"rating": "4.10112380981445",
			"cook_time": 25,
			"ready_in_time": 115,
			"id": 152375,
			"prep_time": 30,
			"nutrition": [
				"Calories: 579 kcal 29 %",
				"Fat: 24.1 g 37 %",
				"Carbs: 86.8g 28 %",
				"Protein: 6.1 g 12 %",
				"Cholesterol: 73 mg 24 %",
				"Sodium: 443 mg 18 %"
			],
			"comment": "Quick and easy red velvet cake.",
			"cal": 579,
			"total_time": 170,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/30065.jpg",
			"ingredients": [
				"Cake: ",
				" 1/2 cup shortening ",
				" 1 1/2 cups white sugar ",
				" 2 eggs, room temperature ",
				" 1 teaspoon butter flavored extract ",
				" 4 tablespoons red food coloring ",
				" 2 tablespoons unsweetened cocoa powder ",
				" 1 cup buttermilk, room temperature ",
				" 1 teaspoon salt ",
				" 2 1/2 cups sifted all-purpose flour ",
				" 1 tablespoon white vinegar ",
				" 1 teaspoon baking soda ",
				" Cream Cheese Frosting: ",
				" 1/2 cup butter, room temperature ",
				" 1 (8 ounce) package cream cheese, room temperature ",
				" 4 cups confectioners' sugar, sifted ",
				" 1 teaspoon vanilla extract "
			]
		},
		{
			"name": "Chili Chicken",
			"reviews": "87",
			"directions": "In a large bowl, mix together the honey, sweet chili sauce and soy sauce. Set aside a small dish of the marinade for basting. Place chicken drumsticks into the bowl. Cover and refrigerate at least 1 hour. Preheat an outdoor grill for medium-high heat. Lightly oil the grill grate. Arrange drumsticks on the grill. Cook for 10 minutes per side, or until juices run clear. Baste frequently with the reserved sauce during the last 5 minutes.",
			"rating": "4.15966367721558",
			"cook_time": 20,
			"ready_in_time": 90,
			"id": 152378,
			"prep_time": 10,
			"nutrition": [
				"Calories: 142 kcal 7 %",
				"Fat: 4.1 g 6 %",
				"Carbs: 5.9g 2 %",
				"Protein: 19.6 g 39 %",
				"Cholesterol: 62 mg 21 %",
				"Sodium: 353 mg 14 %"
			],
			"comment": "A tasty version of drumsticks with a bit of sweetness and spiciness. Thai sweet chili sauce adds an Asian flair.",
			"cal": 142,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/259769.jpg",
			"ingredients": [
				"2 tablespoons honey ",
				" 5 tablespoons sweet chili sauce ",
				" 3 tablespoons soy sauce ",
				" 12 chicken drumsticks, skin removed "
			]
		},
		{
			"name": "Delicious Vegan Hot Chocolate",
			"reviews": "71",
			"directions": "Bring the soy milk, sugar, cocoa powder, salt, vanilla extract, cinnamon, and cayenne pepper to a simmer in a saucepan over medium-high heat. Remove from the heat and whisk until frothy. Serve immediately.",
			"rating": "4.07692289352417",
			"cook_time": 5,
			"ready_in_time": 10,
			"id": 152379,
			"prep_time": 5,
			"nutrition": [
				"Calories: 259 kcal 13 %",
				"Fat: 6.4 g 10 %",
				"Carbs: 42.9g 14 %",
				"Protein: 11.4 g 23 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 738 mg 30 %"
			],
			"comment": "Finally, a vegan hot chocolate recipe that actually tastes good! For best results, use plain soy milk.",
			"cal": 259,
			"total_time": 20,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/384430.jpg",
			"ingredients": [
				"2 1/2 cups soy milk ",
				" 3 tablespoons white sugar ",
				" 3 tablespoons cocoa powder ",
				" 1/2 teaspoon salt ",
				" 1/2 teaspoon vanilla extract ",
				" 1 pinch ground cinnamon ",
				" 1 pinch cayenne pepper "
			]
		},
		{
			"name": "Baked Hawaiian Sandwiches",
			"reviews": "68",
			"directions": "Place a rack into lower half of oven and preheat oven to 400 degrees F (200 degrees C). Arrange bottom halves of Hawaiian rolls on a baking sheet. Place a half slice each of ham, Swiss cheese, smoked turkey, and provolone cheese onto each roll bottom. Place top halves onto each bottom to make sandwiches. Melt butter in a saucepan over low heat and stir in sugar, dried onion flakes, poppy seeds, and honey mustard until mixture is smoothly combined, creamy, and the sugar has dissolved, about 2 minutes; brush over the tops of each sandwich. Bake sandwiches on the preheated oven's lower rack until tops are golden brown and fillings are hot, about 15 minutes.",
			"rating": "4.75903606414795",
			"cook_time": 15,
			"ready_in_time": 45,
			"id": 152382,
			"prep_time": 30,
			"nutrition": [
				"Calories: 426 kcal 21 %",
				"Fat: 11.4 g 17 %",
				"Carbs: 46.6g 15 %",
				"Protein: 23 g 46 %",
				"Cholesterol: 78 mg 26 %",
				"Sodium: 488 mg 20 %"
			],
			"comment": "These sandwiches are quick, easy, and always a hit. They can be served at receptions, baby showers, Bible studies, or tailgate parties! I have made large quantities and they have always turned out. Sandwiches can be made up in advance and stored in refrigerator until ready to bake. Try them and enjoy!",
			"cal": 426,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/893191.jpg",
			"ingredients": [
				"24 Hawaiian bread rolls (such as King's®), split ",
				" 12 thin slices of honey-cured deli ham, halved ",
				" 12 slices Swiss cheese, halved ",
				" 12 thin slices deli smoked turkey, halved ",
				" 12 thin slices provolone cheese, halved ",
				" 1/2 cup butter ",
				" 1/4 cup white sugar ",
				" 1/4 cup dried onion flakes ",
				" 2 tablespoons poppy seeds ",
				" 1 tablespoon honey mustard "
			]
		},
		{
			"name": "Margarita Cake with Key Lime Cream Cheese Frosting",
			"reviews": "71",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour a 9x13-inch cake pan. In a large mixing bowl, beat together the cake mix, egg whites, frozen margarita mix, vegetable oil, lime zest, and 1 tablespoon lime juice. Pour the batter into the prepared pan. Bake in the preheated oven until a toothpick inserted into the center shows moist crumbs, 30 to 35 minutes. Cake will be very moist. Cool in the pan. To make frosting, beat the cream cheese and butter together until light and fluffy, and stir in the lemon peel and 1 tablespoon of lime juice. Beat in the confectioners' sugar, 1 cup at a time, scraping the sides of the bowl thoroughly with a spatula after each addition. Spread the frosting over the cooled cake.",
			"rating": "4.5119047164917",
			"cook_time": 30,
			"ready_in_time": 120,
			"id": 152383,
			"prep_time": 30,
			"nutrition": [
				"Calories: 567 kcal 28 %",
				"Fat: 20.9 g 32 %",
				"Carbs: 91.9g 30 %",
				"Protein: 4.3 g 9 %",
				"Cholesterol: 41 mg 14 %",
				"Sodium: 372 mg 15 %"
			],
			"comment": "You can even make an adult version, by adding 3 shots of either rum or tequila to the icing! I make this cake for parties and on birthdays.",
			"cal": 567,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/677244.jpg",
			"ingredients": [
				"1 (18.25 ounce) package white cake mix ",
				" 3 egg whites ",
				" 1 (10 fluid ounce) can frozen margarita mix (such as Bacardi®), thawed ",
				" 2 tablespoons vegetable oil ",
				" 1 tablespoon grated lime peel ",
				" 1 tablespoon lime juice ",
				" 1 (8 ounce) package cream cheese, softened ",
				" 1/2 cup unsalted butter, softened ",
				" 1 tablespoon grated lemon peel ",
				" 1 tablespoon lime juice ",
				" 5 cups confectioners' sugar "
			]
		},
		{
			"name": "Apple Toast",
			"reviews": "58",
			"directions": "Set oven to broil. Spread butter on one side of each slice of bread. Place apple slices on buttered side of bread. Sprinkle cinnamon on top. Place bread on a baking sheet. Place in a preheated oven until toasted, about 2 minutes.",
			"rating": "4.15000009536743",
			"cook_time": 2,
			"ready_in_time": 5,
			"id": 152386,
			"prep_time": 3,
			"nutrition": [
				"Calories: 124 kcal 6 %",
				"Fat: 3.8 g 6 %",
				"Carbs: 21.4g 7 %",
				"Protein: 2.1 g 4 %",
				"Cholesterol: 8 mg 3 %",
				"Sodium: 191 mg 8 %"
			],
			"comment": "Apple toast is a great after-school snack for kids who are picky eaters. It doesn't take long to make and is a light snack that will leave you satisfied.",
			"cal": 124,
			"total_time": 10,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/136614.jpg",
			"ingredients": [
				"1 tablespoon butter ",
				" 4 slices white or whole wheat bread ",
				" 1 tablespoon cinnamon ",
				" 1 large apple, cored and thinly sliced "
			]
		},
		{
			"name": "Bloody Broken Glass Cupcakes",
			"reviews": "68",
			"directions": "Preheat an oven to 350 degrees F (175 degrees C). Line 2, 12-cupcake tins with paper cupcake liners. Blend cake mix, 1 cup water, vegetable oil, and eggs in a large bowl. Beat with a mixer on low speed for 2 minutes. Divide cake batter between lined cupcake tins. Bake cupcakes in preheated oven until a toothpick inserted in the center comes out clean, 18 to 22 minutes. Cool completely. Frost cupcakes with white frosting. Make the sugar glass. Mix 2 cups water, 1 cup corn syrup, white sugar, and cream of tartar in a large saucepan; bring to a boil. Use a candy thermometer and boil sugar syrup until temperature reaches 300 degrees (hard ball), stirring constantly. The mixture will thicken as water evaporates. When sugar reaches 300 degrees, quickly pour onto a metal baking pan. Cool until completely hardened. Break into \"shards\" using a meat mallet. Make the edible blood. Mix together 1/2 cup corn syrup and cornstarch in a large bowl. Slowly stir in the 1/4 cup of water, adding more if necessary, until the corn syrup mixture has thickened to the consistency of blood. Stir in the red and blue food coloring. Stab each frosted cupcake with a few shards of broken sugar glass. Drizzle on drops of \"blood\" to complete the effect.",
			"rating": "4.36046504974365",
			"cook_time": 30,
			"ready_in_time": 80,
			"id": 152387,
			"prep_time": 30,
			"nutrition": [
				"Calories: 377 kcal 19 %",
				"Fat: 9 g 14 %",
				"Carbs: 74.6g 24 %",
				"Protein: 1.7 g 3 %",
				"Cholesterol: 23 mg 8 %",
				"Sodium: 198 mg 8 %"
			],
			"comment": "I made made these cupcakes for my nephew's birthday and they turned out so creepy that I thought I would share them here for Halloween. I tried out a few different methods for sugar glass and included the method which produced the clearest glass for me.",
			"cal": 377,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/722313.jpg",
			"ingredients": [
				"1 (18.25 ounce) package white cake mix ",
				" 1 cup water ",
				" 1/3 cup vegetable oil ",
				" 3 eggs ",
				" 1 (16 ounce) can white frosting ",
				" Sugar Glass: ",
				" 2 cups water ",
				" 1 cup light corn syrup ",
				" 3 1/2 cups white sugar ",
				" 1/4 teaspoon cream of tartar ",
				" Edible Blood: ",
				" 1/2 cup light corn syrup ",
				" 1 tablespoon cornstarch ",
				" 1/4 cup water, or more as needed ",
				" 15 drops red food coloring ",
				" 3 drops blue food coloring "
			]
		},
		{
			"name": "Chiffon Cake",
			"reviews": "52",
			"directions": "Preheat oven to 325 degrees F (165 degrees C). Wash a 10 inch angel food tube pan in hot soapy water to ensure it is totally grease free. Measure flour, sugar, baking powder, and salt into sifter. Sift into bowl. Make a well; add oil, egg yolks, water, vanilla, and lemon flavoring to the well in the order that is given. Set aside. Don't beat. In a large mixing bowl, beat egg whites and cream of tartar until very stiff. Set aside. Using same beaters, beat egg yolk batter until smooth and light. Pour gradually over egg whites, folding in with rubber spatula. Do not stir. Pour batter into angel food tube pan. Bake for 55 minutes. Increase heat to 350 degrees F (175 degrees C), and bake 10 to 15 minutes until done. Invert pan until cool.",
			"rating": "4.671875",
			"cook_time": 60,
			"ready_in_time": 90,
			"id": 152389,
			"prep_time": 30,
			"nutrition": [
				"Calories: 264 kcal 13 %",
				"Fat: 10.2 g 16 %",
				"Carbs: 38.2g 12 %",
				"Protein: 4.8 g 10 %",
				"Cholesterol: 102 mg 34 %",
				"Sodium: 303 mg 12 %"
			],
			"comment": "This is a favorite for children's birthday parties. Serve with fruit or decorate with Butter Cream Frosting.",
			"cal": 264,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/69864.jpg",
			"ingredients": [
				"2 cups sifted cake flour ",
				" 1 1/2 cups white sugar ",
				" 1 tablespoon baking powder ",
				" 1 teaspoon salt ",
				" 1/2 cup vegetable oil ",
				" 7 egg yolks ",
				" 3/4 cup cold water ",
				" 2 teaspoons vanilla extract ",
				" 1 teaspoon lemon extract ",
				" 7 egg whites ",
				" 1/2 teaspoon cream of tartar ",
				" 1 recipe Williamsburg Butter Frosting "
			]
		},
		{
			"name": "White Mountain Cake",
			"reviews": "44",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease two 9-inch round pans. Sift and measure cake flour. Add salt and baking powder, and sift again. In a large bowl, beat shortening until smooth. Add sugar gradually, and beat until fluffy. Add sifted ingredients alternately with milk and flavorings (see Cook's Note). Beat thoroughly after each addition. Beat egg whites until stiff, and fold into mixture. Pour batter into prepared pans. Bake in preheated oven until cake springs back when lightly touched with a fingertip and a toothpick inserted in the center comes out clean, 25 to 30 minutes. Allow to cool completely before frosting.",
			"rating": "4",
			"cook_time": 25,
			"ready_in_time": 60,
			"id": 152392,
			"prep_time": 35,
			"nutrition": [
				"Calories: 375 kcal 19 %",
				"Fat: 13.5 g 21 %",
				"Carbs: 58.6g 19 %",
				"Protein: 5.1 g 10 %",
				"Cholesterol: 2 mg < 1 %",
				"Sodium: 292 mg 12 %"
			],
			"comment": "This is a great showpiece of a cake. Top with White Mountain Frosting.",
			"cal": 375,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/383086.jpg",
			"ingredients": [
				"3/4 cup shortening ",
				" 1 3/4 cups white sugar ",
				" 3 cups cake flour ",
				" 1/2 teaspoon salt ",
				" 4 teaspoons baking powder ",
				" 1 cup milk ",
				" 5 egg whites ",
				" 1 teaspoon vanilla extract ",
				" 1/2 teaspoon almond extract "
			]
		},
		{
			"name": "Hot Pink Lemonade",
			"reviews": "49",
			"directions": "Boil one cup of water with the sugar in a saucepan over medium-high heat, stirring until the liquid becomes clear. Remove from heat and stir in the lemon juice. Pour 7 cups of cool water and ice into a serving pitcher. Add the lemon syrup and blueberries; stir until you get a 'hot pink' color.",
			"rating": "4.48387098312378",
			"cook_time": 5,
			"ready_in_time": 20,
			"id": 152393,
			"prep_time": 15,
			"nutrition": [
				"Calories: 291 kcal 15 %",
				"Fat: 0.1 g < 1 %",
				"Carbs: 77.2g 25 %",
				"Protein: 0.5 g < 1 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 13 mg < 1 %"
			],
			"comment": "Refreshing, fun recipe for blueberry lemonade! Tart and sweet with a boost of antioxidants from the blueberries. The finished drink is hot pink, almost purple.",
			"cal": 291,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/445924.jpg",
			"ingredients": [
				"1 cup water ",
				" 2 cups white sugar ",
				" 2 1/4 cups fresh lemon juice ",
				" 7 cups cool water ",
				" 2 cups ice ",
				" 3/4 cup blueberries "
			]
		},
		{
			"name": "Super Nachos",
			"reviews": "44",
			"directions": "Cook and stir ground beef in a skillet over medium heat until meat is crumbly and no longer pink, 5 to 10 minutes. Drain excess grease. Stir in taco seasoning mix and water and simmer until beef mixture has thickened, 8 to 10 minutes. Set the oven rack about 6 inches from the heat source and preheat the broiler. Line a baking sheet with aluminum foil. Spread tortilla chips on the prepared baking sheet; top with Cheddar cheese and dot with refried beans and ground beef mixture. Broil in the preheated oven until cheese is melted, watching carefully to prevent burning, 3 to 5 minutes. Top nachos with salsa, sour cream, black olives, green onions, and jalapeno peppers.",
			"rating": "4.6712327003479",
			"cook_time": 20,
			"ready_in_time": 50,
			"id": 152395,
			"prep_time": 30,
			"nutrition": [
				"Calories: 432 kcal 22 %",
				"Fat: 24.5 g 38 %",
				"Carbs: 39.7g 13 %",
				"Protein: 15.2 g 30 %",
				"Cholesterol: 44 mg 15 %",
				"Sodium: 1081 mg 43 %"
			],
			"comment": "This makes a huge meal-sized tray of nachos with lots of good stuff! You can adjust ingredient quantities to suit your preference. Serve with extra chips if required. Great for game day.",
			"cal": 432,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2433064.jpg",
			"ingredients": [
				"1 pound ground beef ",
				" 1 (1.25 ounce) package taco seasoning mix ",
				" 3/4 cup water ",
				" 1 (18 ounce) package restaurant-style tortilla chips ",
				" 1 cup shredded sharp Cheddar cheese, or more to taste ",
				" 1 (15.5 ounce) can refried beans ",
				" 1 cup salsa ",
				" 1 cup sour cream, or more to taste ",
				" 1 (10 ounce) can pitted black olives, drained and chopped ",
				" 4 green onions, diced ",
				" 1 (4 ounce) can sliced jalapeno peppers, drained "
			]
		},
		{
			"name": "One - Two - Three - Four Cake II",
			"reviews": "43",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 9-inch round pans. Beat butter and 1 cup of sugar with an electric mixer in a large bowl until light and fluffy. The mixture should be noticeably lighter in color. In a separate bowl, beat egg yolks well, then add to butter mixture. Sift together flour and baking powder. Add alternately with the milk to the butter-sugar mixture. Beat well. Add vanilla. Beat egg whites until stiff but not dry. Add 1 cup sugar to the egg whites. Fold into cake batter. Divide evenly into three prepared 9 inch round pans. Bake at 350 degrees F (175 degrees C) for 25 minutes.",
			"rating": "4.12962961196899",
			"cook_time": 25,
			"ready_in_time": 65,
			"id": 152396,
			"prep_time": 40,
			"nutrition": [
				"Calories: 429 kcal 21 %",
				"Fat: 17.5 g 27 %",
				"Carbs: 62.8g 20 %",
				"Protein: 5.9 g 12 %",
				"Cholesterol: 111 mg 37 %",
				"Sodium: 220 mg 9 %"
			],
			"comment": "This is a very old recipe. It uses basic items found in most any pantry.",
			"cal": 429,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/972421.jpg",
			"ingredients": [
				"1 cup butter ",
				" 2 cups white sugar, divided ",
				" 3 cups cake flour ",
				" 4 egg yolks, room temperature ",
				" 4 egg whites, room temperature ",
				" 2 teaspoons baking powder ",
				" 1 cup milk, room temperature ",
				" 1 teaspoon vanilla extract "
			]
		},
		{
			"name": "Willard Family German Chocolate Cake",
			"reviews": "55",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease and flour 3 8-inch cake pans and line bottoms with parchment paper. Place the chunks of chocolate into the boiling water and stir until the chocolate has melted; set aside to cool. In a large bowl, beat 1 cup of softened margarine with 2 cups of sugar with an electric mixer until light and fluffy. Stir in 4 egg yolks, one at a time, beating well after each addition. Beat in 1 teaspoon of vanilla extract and the chocolate-water mixture until thoroughly blended. Sift the flour, baking soda, and salt into a bowl. Beat the flour mixture into the liquid ingredients, alternating with buttermilk, in 3 or 4 additions. Beat until batter is smooth, about 1 minute. In a metal or glass bowl, beat the reserved egg whites until they hold stiff peaks when the beaters are lifted straight up. Gently fold the beaten egg whites into the batter, keeping as much volume as possible. Pour the batter into the prepared cake pans. Bake in the preheated oven until the cakes have browned lightly and a toothpick inserted into the center of a cake comes out clean, 35 to 40 minutes. Allow the cakes to cool in pans before removing. To make frosting, pour the evaporated milk into a large saucepan, and mix in 1 cup of sugar, 3 egg yolks, 1/4 cup of margarine, and 1 teaspoon of vanilla extract. Bring to a boil, reduce heat to medium, and cook until thickened, stirring constantly, about 12 minutes. Remove from heat, and mix in the coconut and pecans, beating the frosting until cooled and spreadable. Frost and fill the cake with the coconut frosting.",
			"rating": "4.80000019073486",
			"cook_time": 50,
			"ready_in_time": 140,
			"id": 152397,
			"prep_time": 30,
			"nutrition": [
				"Calories: 809 kcal 40 %",
				"Fat: 41.8 g 64 %",
				"Carbs: 101.8g 33 %",
				"Protein: 11.5 g 23 %",
				"Cholesterol: 144 mg 48 %",
				"Sodium: 617 mg 25 %"
			],
			"comment": "This recipe has been in my family for a very long time. My great-grandma could make this with her eyes closed. My father was born on her birthday so she made this cake for him every year. Even shipped it to him in Korea when he was stationed there in the army.",
			"cal": 809,
			"total_time": 220,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/785957.jpg",
			"ingredients": [
				"1 (4 ounce) package sweet baking chocolate (such as Baker's German's Sweet Chocolate®) - broken into pieces ",
				" 1/2 cup boiling water ",
				" 1 cup margarine, softened ",
				" 2 cups white sugar ",
				" 4 eggs, separated ",
				" 1 teaspoon vanilla extract ",
				" 2 1/2 cups sifted all purpose flour ",
				" 1 teaspoon baking soda ",
				" 1/2 teaspoon salt ",
				" 1 cup buttermilk ",
				" 1 cup evaporated milk ",
				" 1 cup white sugar ",
				" 3 egg yolks ",
				" 1/4 cup margarine ",
				" 1 teaspoon vanilla extract ",
				" 1 1/3 cups sweetened flake coconut ",
				" 1 cup chopped pecans "
			]
		},
		{
			"name": "Watermelon Lemonade",
			"reviews": "62",
			"directions": "Place the watermelon into a blender. Cover, and puree until smooth. Strain through a fine mesh sieve. Bring sugar and 1/2 cup water to a boil in a saucepan over medium-high heat until sugar dissolves, about 5 minutes. Remove from heat. Stir in 3 cups of cold water and the lemon juice. Divide the ice into 12 glasses, and scoop 2 to 3 tablespoons of watermelon puree over the ice, then top with the lemonade. Gently stir before serving.",
			"rating": "4.37837839126587",
			"cook_time": 5,
			"ready_in_time": 15,
			"id": 152398,
			"prep_time": 10,
			"nutrition": [
				"Calories: 50 kcal 2 %",
				"Fat: 0.1 g < 1 %",
				"Carbs: 13g 4 %",
				"Protein: 0.3 g < 1 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 6 mg < 1 %"
			],
			"comment": "Light and refreshing summer drink. Garnish with watermelon slice. Can be made into an adult cocktail by adding a little vodka.",
			"cal": 50,
			"total_time": 30,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/877592.jpg",
			"ingredients": [
				"1/2 cup white sugar ",
				" 1/2 cup water ",
				" 4 cups cubed watermelon ",
				" 3 cups cold water ",
				" 1/2 cup fresh lemon juice ",
				" 6 cups ice cubes "
			]
		},
		{
			"name": "Cream Cheese Won Tons",
			"reviews": "50",
			"directions": "In a medium-sized mixing bowl, combine cream cheese, clams, green onions, water chestnuts, paprika and ground black pepper. Place about 1 teaspoon of filling into the won ton skin and seal corner to corner forming a triangle. In a large skillet, heat oil to a high temperature. Fry the won tons until they are browned on both sides. Drain on paper towels and serve hot.",
			"rating": "4.44736862182617",
			"cook_time": 20,
			"ready_in_time": 40,
			"id": 152399,
			"prep_time": 20,
			"nutrition": [
				"Calories: 152 kcal 8 %",
				"Fat: 9.3 g 14 %",
				"Carbs: 12.3g 4 %",
				"Protein: 5 g 10 %",
				"Cholesterol: 26 mg 9 %",
				"Sodium: 153 mg 6 %"
			],
			"comment": "This is the only way I will eat cream cheese. I thought I would try it, because I love won tons and the kids love cream cheese. Try it, it's onolicious! I usually use a little bit of beaten egg to seal the won ton skins into their package shape.",
			"cal": 152,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/21594.jpg",
			"ingredients": [
				"2 (8 ounce) packages cream cheese, softened ",
				" 1 (6.5 ounce) can minced clams ",
				" 2 green onions, chopped ",
				" 2 (8 ounce) cans water chestnuts, drained ",
				" 1 teaspoon paprika ",
				" 1 teaspoon ground black pepper ",
				" 1 (14 ounce) package small won ton wrappers ",
				" 3 cups vegetable oil for frying "
			]
		},
		{
			"name": "Hungarian Flourless Hazelnut Cake",
			"reviews": "64",
			"directions": "Preheat the oven to 325 degrees F (165 degrees C). Grease and flour a 9-inch springform pan. Grind hazelnuts until very fine. Add baking powder and set aside. In a large bowl, whip the egg yolks with the sugar until pale yellow in color. Beat in the ground hazelnut mixture. In a separate CLEAN bowl, with a CLEAN whisk, whip the egg whites until stiff. Quickly fold 1/3 of the egg whites into the yolk mixture, then add the remaining whites and fold in until no streaks remain. Pour into a 9 inch springform. Bake in preheated oven for 60 to 75 minutes, or until top of cake springs back when lightly tapped. Cool on wire rack. When cake is cool, slice horizontally into 3 layers. Whip the cream until stiff, and spread generously between layers, on top and on the sides of the cake. Sprinkle chopped hazelnuts on top for decoration.",
			"rating": "4.37681150436401",
			"cook_time": 60,
			"ready_in_time": 90,
			"id": 152400,
			"prep_time": 30,
			"nutrition": [
				"Calories: 399 kcal 20 %",
				"Fat: 35 g 54 %",
				"Carbs: 17.1g 6 %",
				"Protein: 8.4 g 17 %",
				"Cholesterol: 157 mg 52 %",
				"Sodium: 128 mg 5 %"
			],
			"comment": "This cake was traditionally a birthday cake in my friend's home. Her mother is from Hungary and only has this recipe in her head! Now it will be preserved.... Note: hazelnuts may be toasted or untoasted. The skins may be removed or left on.",
			"cal": 399,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/3797.jpg",
			"ingredients": [
				"12 ounces hazelnuts ",
				" 2 teaspoons baking powder ",
				" 6 egg yolks ",
				" 5/8 cup white sugar ",
				" 6 egg whites ",
				" 1 pint heavy whipping cream ",
				" 1/8 cup chopped hazelnuts, for garnish "
			]
		}
	]
}