{
	"foods": [
		{
			"name": "Chef John's Oysters Rockefeller",
			"reviews": "2",
			"directions": "Preheat an oven to 500 degrees F (260 degrees C). Pour rock salt into a large, shallow casserole dish. Combine watercress, butter, bread crumbs, green onions, celery, tarragon, Italian parsley, anise-flavored liqueur, salt, black pepper, and cayenne pepper in a food processor; blend until smooth. Place 8 to 12 shucked oysters on top of the rock salt. Spoon 1 to 2 teaspoons of watercress mixture a top each oyster. Bake in the preheated oven until oysters are firm and butter has melted, about 5 minutes. Repeat with remaining oysters.",
			"rating": "5",
			"cook_time": 15,
			"ready_in_time": 55,
			"id": 19301,
			"prep_time": 40,
			"nutrition": [
				"Calories: 94 kcal 5 %",
				"Fat: 4.4 g 7 %",
				"Carbs: 5g 2 %",
				"Protein: 7.6 g 15 %",
				"Cholesterol: 46 mg 15 %",
				"Sodium: 112 mg 4 %"
			],
			"comment": "There's much debate over how many of America's greatest recipes got their name, but that's not an issue with Oysters Rockefeller. Thanks to the rich, money-colored butter sauce, this decadent creation's name pretty much wrote itself. Serve with a squeeze of fresh lemon over the top.",
			"cal": 94,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1060192.jpg",
			"ingredients": [
				"2 cups rock salt, or more as needed ",
				" 1 cup chopped watercress ",
				" 1/2 cup butter, room temperature ",
				" 1/4 cup bread crumbs ",
				" 2 tablespoons minced green onion (white and pale green parts only) ",
				" 2 tablespoons chopped celery ",
				" 2 tablespoons chopped fresh tarragon ",
				" 2 tablespoons chopped fresh parsley ",
				" 2 tablespoons anise-flavored liqueur (such as Pernod®) ",
				" 1 pinch cayenne pepper, or to taste ",
				" salt and freshly ground black pepper to taste ",
				" 36 oysters on the half shell "
			]
		},
		{
			"name": "Egg and Sausage Casserole",
			"reviews": "637",
			"directions": "Place sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside. Preheat oven to 325 degrees F (165 degrees C). Lightly grease a 9x13 inch baking dish. Line the bottom of the prepared baking dish with crescent roll dough, and sprinkle with crumbled sausage. In a large bowl, mix beaten eggs, mozzarella, and Cheddar. Season the mixture with oregano, and pour over the sausage and crescent rolls. Bake 25 to 30 minutes in the preheated oven, or until a knife inserted in the center comes out clean.",
			"rating": "4.6130952835083",
			"cook_time": 35,
			"ready_in_time": 50,
			"id": 19302,
			"prep_time": 15,
			"nutrition": [
				"Calories: 341 kcal 17 %",
				"Fat: 24.7 g 38 %",
				"Carbs: 8.7g 3 %",
				"Protein: 19.9 g 40 %",
				"Cholesterol: 177 mg 59 %",
				"Sodium: 764 mg 31 %"
			],
			"comment": "This recipe was given to me by a friend several years ago. It's easy to make and always a hit! Co-workers beg for it, and it's my husband's favorite!",
			"cal": 341,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/46338.jpg",
			"ingredients": [
				"1 pound pork sausage ",
				" 1 (8 ounce) package refrigerated crescent roll dough ",
				" 8 eggs, beaten ",
				" 2 cups shredded mozzarella cheese ",
				" 2 cups shredded Cheddar cheese ",
				" 1 teaspoon dried oregano "
			]
		},
		{
			"name": "Creamy Hot Cocoa",
			"reviews": "932",
			"directions": "Combine the cocoa, sugar and pinch of salt in a saucepan. Blend in the boiling water. Bring this mixture to an easy boil while you stir. Simmer and stir for about 2 minutes. Watch that it doesn't scorch. Stir in 3 1/2 cups of milk and heat until very hot, but do not boil! Remove from heat and add vanilla. Divide between 4 mugs. Add the cream to the mugs of cocoa to cool it to drinking temperature.",
			"rating": "4.59369802474976",
			"cook_time": 5,
			"ready_in_time": 7,
			"id": 19303,
			"prep_time": 2,
			"nutrition": [
				"Calories: 310 kcal 15 %",
				"Fat: 8.7 g 13 %",
				"Carbs: 52.8g 17 %",
				"Protein: 9.3 g 19 %",
				"Cholesterol: 28 mg 9 %",
				"Sodium: 102 mg 4 %"
			],
			"comment": "It's old fashioned, it's comforting, it makes the kitchen smell wonderful and it's good for the soul.",
			"cal": 310,
			"total_time": 14,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/509474.jpg",
			"ingredients": [
				"1/3 cup unsweetened cocoa powder ",
				" 3/4 cup white sugar ",
				" 1 pinch salt ",
				" 1/3 cup boiling water ",
				" 3 1/2 cups milk ",
				" 3/4 teaspoon vanilla extract ",
				" 1/2 cup half-and-half cream "
			]
		},
		{
			"name": "Vanilla Crepes",
			"reviews": "565",
			"directions": "In a large bowl, mix together the milk, egg yolks and vanilla. Stir in the flour, sugar, salt and melted butter until well blended. Heat a crepe pan over medium heat until hot. Coat with vegetable oil or cooking spray. Pour about 1/4 cup of batter into the pan and tip to spread the batter to the edges. When bubbles form on the top and the edges are dry, flip over and cook until lightly browned on the other side and edges are golden. Repeat with remaining batter. Fill crepes with your favorite fruit, cream, caramel or even ice cream or cheese to serve.",
			"rating": "4.66541814804077",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 19304,
			"prep_time": 10,
			"nutrition": [
				"Calories: 142 kcal 7 %",
				"Fat: 6.7 g 10 %",
				"Carbs: 15.9g 5 %",
				"Protein: 3.3 g 7 %",
				"Cholesterol: 66 mg 22 %",
				"Sodium: 146 mg 6 %"
			],
			"comment": "When I was a little girl, my mother would always make us crepes on Sundays. I also loved the smell of vanilla when my mother would make her cookies. So, I would always ask her to make her cookies, and when she refused, I would take out the vanilla and sit it next to me with the cap open, so that I could breathe the aroma. My mother get a kick out of this, and said, well, if it's that important, we'll add a little vanilla kick, just for you. After the first time she put the vanilla in, there was never a last...it became a tradition.",
			"cal": 142,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/696723.jpg",
			"ingredients": [
				"1 1/2 cups milk ",
				" 3 egg yolks ",
				" 2 tablespoons vanilla extract ",
				" 1 1/2 cups all-purpose flour ",
				" 2 tablespoons sugar ",
				" 1/2 teaspoon salt ",
				" 5 tablespoons melted butter "
			]
		},
		{
			"name": "Fried Cabbage II",
			"reviews": "532",
			"directions": "Place bacon in a large, deep skillet. Cook over medium-high heat until evenly brown. Remove bacon, and set aside. Cook onion in the hot bacon grease until tender. Add cabbage, and stir in water, sugar, salt, and pepper. Cook until cabbage wilts, about 15 minutes. Stir in bacon. Splash with vinegar before serving.",
			"rating": "4.59154939651489",
			"cook_time": 25,
			"ready_in_time": 45,
			"id": 19305,
			"prep_time": 20,
			"nutrition": [
				"Calories: 47 kcal 2 %",
				"Fat: 2 g 3 %",
				"Carbs: 5.2g 2 %",
				"Protein: 2.8 g 6 %",
				"Cholesterol: 5 mg 2 %",
				"Sodium: 114 mg 5 %"
			],
			"comment": "Cabbage and onions are sauteed in bacon grease, and served with a splash of vinegar, for a tangy, hearty dish that will surprise you.",
			"cal": 47,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/116544.jpg",
			"ingredients": [
				"3 slices bacon, chopped ",
				" 1/4 cup chopped onion ",
				" 6 cups cabbage, cut into thin wedges ",
				" 2 tablespoons water ",
				" 1 pinch white sugar ",
				" salt and pepper to taste ",
				" 1 tablespoon cider vinegar "
			]
		},
		{
			"name": "Crepes",
			"reviews": "702",
			"directions": "In a blender combine eggs, milk, flour, salt and oil. Process until smooth. Cover and refrigerate 1 hour. Heat a skillet over medium-high heat and brush with oil. Pour 1/4 cup of crepe batter into pan, tilting to completely coat the surface of the pan. Cook 2 to 5 minutes, turning once, until golden. Repeat with remaining batter.",
			"rating": "4.7681450843811",
			"cook_time": 15,
			"ready_in_time": 80,
			"id": 19306,
			"prep_time": 5,
			"nutrition": [
				"Calories: 79 kcal 4 %",
				"Fat: 2.8 g 4 %",
				"Carbs: 9.5g 3 %",
				"Protein: 3.7 g 7 %",
				"Cholesterol: 49 mg 16 %",
				"Sodium: 30 mg 1 %"
			],
			"comment": "This French delicacy is extremely versatile, as it can be filled with virtually anything -- fruits, pudding, mousse for desserts as well as vegetables and meats for dinner. No need to add more oil each time unless the pan begins to stick. Freeze extra crepes for later use.",
			"cal": 79,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/949777.jpg",
			"ingredients": [
				"2 eggs ",
				" 1 cup milk ",
				" 2/3 cup all-purpose flour ",
				" 1 pinch salt ",
				" 1 1/2 teaspoons vegetable oil "
			]
		},
		{
			"name": "King Crab Appetizers",
			"reviews": "225",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease 12 tartlet pans. Divide rolls in half and press into the prepared tartlet pans. Set aside. In a large bowl, combine cream cheese, crab, mayonnaise, Parmesan cheese, Cheddar cheese, green onions and Worcestershire sauce. Spoon 1 teaspoon of mixture into tarts and garnish with paprika. Bake at 375 degrees F (190 degrees C) for 15 to 20 minutes, or until light brown. These freeze wonderfully. Just reheat before serving.",
			"rating": "4.39518880844116",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 19307,
			"prep_time": 10,
			"nutrition": [
				"Calories: 299 kcal 15 %",
				"Fat: 18 g 28 %",
				"Carbs: 25.1g 8 %",
				"Protein: 9.6 g 19 %",
				"Cholesterol: 40 mg 13 %",
				"Sodium: 721 mg 29 %"
			],
			"comment": "These crab tartlets have long since been a family favorite and are requested often at holiday get togethers.",
			"cal": 299,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2998578.jpg",
			"ingredients": [
				"2 (12 ounce) packages refrigerated biscuit dough ",
				" 1 (8 ounce) package cream cheese, softened ",
				" 1 (6 ounce) can crab meat, drained ",
				" 2 tablespoons mayonnaise ",
				" 2 tablespoons grated Parmesan cheese ",
				" 1/2 cup shredded Cheddar cheese ",
				" 2 tablespoons thinly sliced green onion ",
				" 1 teaspoon Worcestershire sauce ",
				" 1 pinch paprika "
			]
		},
		{
			"name": "Charleston Breakfast Casserole",
			"reviews": "451",
			"directions": "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Preheat oven to 325 degrees F (165 degrees C). Melt butter in the microwave, or in a small pan on the stove over low heat. Spray a 9x12 inch baking dish with vegetable spray. Place croutons in the bottom of the dish, and drizzle with melted butter. Sprinkle with grated Cheddar cheese. Crack the eggs into a bowl, whisking to break up the yolks. Add milk, peppers, mustard, salt, and pepper, and beat until well-combined. Pour over the croutons and cheese, and sprinkle with crumbled bacon. Bake in the preheated oven for 40 minutes. Remove from oven and allow to stand 10 minutes before serving.",
			"rating": "4.55017280578613",
			"cook_time": 50,
			"ready_in_time": 80,
			"id": 19309,
			"prep_time": 20,
			"nutrition": [
				"Calories: 388 kcal 19 %",
				"Fat: 29.3 g 45 %",
				"Carbs: 10.8g 3 %",
				"Protein: 19.4 g 39 %",
				"Cholesterol: 168 mg 56 %",
				"Sodium: 901 mg 36 %"
			],
			"comment": "An easy, crowd-pleasing breakfast or brunch idea. Try playing with the ingredients to dress it up or down, depending on your occasion.",
			"cal": 388,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/5880.jpg",
			"ingredients": [
				"12 slices bacon ",
				" 1/4 cup butter, melted ",
				" 3 cups croutons ",
				" 2 cups grated Cheddar cheese ",
				" 6 eggs ",
				" 1 3/4 cups milk ",
				" 1 bell pepper (any color), diced ",
				" 1 tablespoon prepared mustard ",
				" salt and pepper to taste "
			]
		},
		{
			"name": "Dessert Crepes",
			"reviews": "644",
			"directions": "In large bowl, whisk together eggs, milk, melted butter, flour sugar and salt until smooth. Heat a medium-sized skillet or crepe pan over medium heat. Grease pan with a small amount of butter or oil applied with a brush or paper towel. Using a serving spoon or small ladle, spoon about 3 tablespoons crepe batter into hot pan, tilting the pan so that bottom surface is evenly coated. Cook over medium heat, 1 to 2 minutes on a side, or until golden brown. Serve immediately.",
			"rating": "4.82118463516235",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 19310,
			"prep_time": 10,
			"nutrition": [
				"Calories: 164 kcal 8 %",
				"Fat: 7.7 g 12 %",
				"Carbs: 17.2g 6 %",
				"Protein: 6.4 g 13 %",
				"Cholesterol: 111 mg 37 %",
				"Sodium: 235 mg 9 %"
			],
			"comment": "Essential crepe recipe. Sprinkle warm crepes with sugar and lemon, or serve with cream or ice cream and fruit.",
			"cal": 164,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/827152.jpg",
			"ingredients": [
				"4 eggs, lightly beaten ",
				" 1 1/3 cups milk ",
				" 2 tablespoons butter, melted ",
				" 1 cup all-purpose flour ",
				" 2 tablespoons white sugar ",
				" 1/2 teaspoon salt "
			]
		},
		{
			"name": "Perfect Crab-Stuffed Mushrooms",
			"reviews": "19",
			"directions": "Preheat oven to 400 degrees F (200 degrees C). Melt 2 tablespoons butter in a skillet; cook and stir green onion until softened, about 2 minutes. Transfer green onion to a bowl. Stir in crabmeat, bread crumbs, 1/4 cup Monterey Jack cheese, egg, lemon juice, and dill weed until well mixed. Pour 1/2 cup melted butter in a 9x13-inch baking dish; turn mushroom caps in butter to coat. Fill mushroom caps with the crab mixture and sprinkle with remaining 1/2 cup Monterey Jack cheese. Pour white wine into baking dish. Bake in preheated oven until cheese is melted and lightly brown, 15 to 20 minutes.",
			"rating": "4.7142858505249",
			"cook_time": 20,
			"ready_in_time": 40,
			"id": 19312,
			"prep_time": 20,
			"nutrition": [
				"Calories: 329 kcal 16 %",
				"Fat: 25.4 g 39 %",
				"Carbs: 11.1g 4 %",
				"Protein: 14.5 g 29 %",
				"Cholesterol: 112 mg 37 %",
				"Sodium: 381 mg 15 %"
			],
			"comment": "These little goodies are the perfect addition to your next holiday gathering or even the perfect appetizer to serve before a cozy dinner at home. Everyone will be dazzled by every delicious bite (they won't be able to keep their hands off of them!) You can smile while you think of how easy they were to toss together! And the best part - I usually end up with leftover stuffing, which freezes beautifully until the next carry-in!",
			"cal": 329,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1220286.jpg",
			"ingredients": [
				"2 tablespoons butter ",
				" 2 tablespoons minced green onion ",
				" 1 cup cooked crabmeat, finely chopped ",
				" 1/2 cup dry bread crumbs ",
				" 1/4 cup shredded Monterey Jack cheese ",
				" 1 egg, beaten ",
				" 1 teaspoon lemon juice ",
				" 1/2 teaspoon dried dill weed ",
				" 1/2 cup butter, melted ",
				" 1 1/2 pounds fresh button mushrooms, stems removed ",
				" 1/2 cup shredded Monterey Jack cheese ",
				" 1/4 cup dry white wine "
			]
		},
		{
			"name": "Baked Kale Chips",
			"reviews": "1716",
			"directions": "Preheat an oven to 350 degrees F (175 degrees C). Line a non insulated cookie sheet with parchment paper. With a knife or kitchen shears carefully remove the leaves from the thick stems and tear into bite size pieces. Wash and thoroughly dry kale with a salad spinner. Drizzle kale with olive oil and sprinkle with seasoning salt. Bake until the edges brown but are not burnt, 10 to 15 minutes.",
			"rating": "4.45976495742798",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 19313,
			"prep_time": 10,
			"nutrition": [
				"Calories: 58 kcal 3 %",
				"Fat: 2.8 g 4 %",
				"Carbs: 7.6g 2 %",
				"Protein: 2.5 g 5 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 185 mg 7 %"
			],
			"comment": "These are a low calorie nutritious snack. Like potato chips, you cannot stop at just eating one. They are great for parties and a good conversation topic.",
			"cal": 58,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/490832.jpg",
			"ingredients": [
				"1 bunch kale ",
				" 1 tablespoon olive oil ",
				" 1 teaspoon seasoned salt "
			]
		},
		{
			"name": "Mouth-Watering Stuffed Mushrooms",
			"reviews": "2607",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Spray a baking sheet with cooking spray. Clean mushrooms with a damp paper towel. Carefully break off stems. Chop stems extremely fine, discarding tough end of stems. Heat oil in a large skillet over medium heat. Add garlic and chopped mushroom stems to the skillet. Fry until any moisture has disappeared, taking care not to burn garlic. Set aside to cool. When garlic and mushroom mixture is no longer hot, stir in cream cheese, Parmesan cheese, black pepper, onion powder and cayenne pepper. Mixture should be very thick. Using a little spoon, fill each mushroom cap with a generous amount of stuffing. Arrange the mushroom caps on prepared cookie sheet. Bake for 20 minutes in the preheated oven, or until the mushrooms are piping hot and liquid starts to form under caps.",
			"rating": "4.61051464080811",
			"cook_time": 20,
			"ready_in_time": 45,
			"id": 19315,
			"prep_time": 25,
			"nutrition": [
				"Calories: 88 kcal 4 %",
				"Fat: 8.2 g 13 %",
				"Carbs: 1.5g < 1 %",
				"Protein: 2.7 g 5 %",
				"Cholesterol: 22 mg 7 %",
				"Sodium: 82 mg 3 %"
			],
			"comment": "These delicious mushrooms taste just like restaurant-style stuffed mushrooms and are my guy's absolute favorite.",
			"cal": 88,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/414837.jpg",
			"ingredients": [
				"12 whole fresh mushrooms ",
				" 1 tablespoon vegetable oil ",
				" 1 tablespoon minced garlic ",
				" 1 (8 ounce) package cream cheese, softened ",
				" 1/4 cup grated Parmesan cheese ",
				" 1/4 teaspoon ground black pepper ",
				" 1/4 teaspoon onion powder ",
				" 1/4 teaspoon ground cayenne pepper "
			]
		},
		{
			"name": "Artichoke Bruschetta",
			"reviews": "289",
			"directions": "Preheat the broiler. In a medium bowl, mix marinated artichoke hearts, Romano cheese, red onion and mayonnaise. Top French baguette slices with equal amounts of the artichoke heart mixture. Arrange slices in a single layer on a large baking sheet. Broil in the preheated oven 2 minutes, or until toppings are bubbly and lightly browned.",
			"rating": "4.53298139572144",
			"cook_time": 2,
			"ready_in_time": 20,
			"id": 19317,
			"prep_time": 18,
			"nutrition": [
				"Calories: 278 kcal 14 %",
				"Fat: 11.1 g 17 %",
				"Carbs: 35.7g 12 %",
				"Protein: 10 g 20 %",
				"Cholesterol: 11 mg 4 %",
				"Sodium: 593 mg 24 %"
			],
			"comment": "This is a great bruschetta recipe based on an artichoke dip. It's always a huge hit! Try adding spinach or tomatoes!",
			"cal": 278,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/257843.jpg",
			"ingredients": [
				"1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped ",
				" 1/2 cup grated Romano cheese ",
				" 1/3 cup finely chopped red onion ",
				" 5 tablespoons mayonnaise ",
				" 1 French baguette, cut into 1/3 inch thick slices "
			]
		},
		{
			"name": "Ethiopian Cabbage Dish",
			"reviews": "465",
			"directions": "Heat the olive oil in a skillet over medium heat. Cook the carrots and onion in the hot oil about 5 minutes. Stir in the salt, pepper, cumin, turmeric, and cabbage and cook another 15 to 20 minutes. Add the potatoes; cover. Reduce heat to medium-low and cook until potatoes are soft, 20 to 30 minutes.",
			"rating": "4.54036235809326",
			"cook_time": 40,
			"ready_in_time": 65,
			"id": 19318,
			"prep_time": 25,
			"nutrition": [
				"Calories: 428 kcal 21 %",
				"Fat: 22.2 g 34 %",
				"Carbs: 54.1g 17 %",
				"Protein: 6.9 g 14 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 428 mg 17 %"
			],
			"comment": "My Ethiopian friend brought this dish to a potluck and I've been making it ever since. It is healthy and delicious. Do not add liquid. The cabbage and potatoes release enough moisture on their own.",
			"cal": 428,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/391627.jpg",
			"ingredients": [
				"1/2 cup olive oil ",
				" 4 carrots, thinly sliced ",
				" 1 onion, thinly sliced ",
				" 1 teaspoon sea salt ",
				" 1/2 teaspoon ground black pepper ",
				" 1/2 teaspoon ground cumin ",
				" 1/4 teaspoon ground turmeric ",
				" 1/2 head cabbage, shredded ",
				" 5 potatoes, peeled and cut into 1-inch cubes "
			]
		},
		{
			"name": "Sausage Casserole",
			"reviews": "761",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13 inch square baking dish. Place sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside. In the prepared baking dish, stir together the shredded potatoes and butter. Line the bottom and sides of the baking dish with the mixture. In a bowl, mix the sausage, Cheddar cheese, onion, cottage cheese, and eggs. Pour over the potato mixture. Bake 1 hour in the preheated oven, or until a toothpick inserted into center of the casserole comes out clean. Let cool for 5 minutes before serving.",
			"rating": "4.67941188812256",
			"cook_time": 75,
			"ready_in_time": 105,
			"id": 19320,
			"prep_time": 25,
			"nutrition": [
				"Calories: 355 kcal 18 %",
				"Fat: 26.3 g 40 %",
				"Carbs: 7.9g 3 %",
				"Protein: 21.6 g 43 %",
				"Cholesterol: 188 mg 63 %",
				"Sodium: 755 mg 30 %"
			],
			"comment": "Mouth watering, bowl scraping good! This recipe also makes a great dinner entree!",
			"cal": 355,
			"total_time": 205,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/776788.jpg",
			"ingredients": [
				"1 pound sage flavored breakfast sausage ",
				" 3 cups shredded potatoes, drained and pressed ",
				" 1/4 cup butter, melted ",
				" 12 ounces mild Cheddar cheese, shredded ",
				" 1/2 cup onion, shredded ",
				" 1 (16 ounce) container small curd cottage cheese ",
				" 6 jumbo eggs "
			]
		},
		{
			"name": "Best Lemonade Ever",
			"reviews": "1664",
			"directions": "In a small saucepan, combine sugar and 1 cup water. Bring to boil and stir to dissolve sugar. Allow to cool to room temperature, then cover and refrigerate until chilled. Remove seeds from lemon juice, but leave pulp. In pitcher, stir together chilled syrup, lemon juice and remaining 7 cups water.",
			"rating": "4.7722373008728",
			"cook_time": 5,
			"ready_in_time": 275,
			"id": 19321,
			"prep_time": 30,
			"nutrition": [
				"Calories: 72 kcal 4 %",
				"Fat: 0 g 0 %",
				"Carbs: 19.1g 6 %",
				"Protein: 0.1 g < 1 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 3 mg < 1 %"
			],
			"comment": "This is a very refreshing drink!",
			"cal": 72,
			"total_time": 310,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/243447.jpg",
			"ingredients": [
				"1 3/4 cups white sugar ",
				" 8 cups water ",
				" 1 1/2 cups lemon juice "
			]
		},
		{
			"name": "Gourmet Sweet Potato Classic",
			"reviews": "1676",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. Bake sweet potatoes 35 minutes in the preheated oven, or until they begin to soften. Cool slightly, peel, and mash. In a large bowl, mix the mashed sweet potatoes, salt, 1/4 cup butter, eggs, vanilla extract, cinnamon, sugar, and heavy cream. Transfer to the prepared baking dish. In a medium bowl, combine 1/4 cup butter, flour, brown sugar, and chopped pecans. Mix with a pastry blender or your fingers to the consistency of course meal. Sprinkle over the sweet potato mixture. Bake 30 minutes in the preheated oven, until topping is crisp and lightly browned.",
			"rating": "4.79034376144409",
			"cook_time": 65,
			"ready_in_time": 85,
			"id": 19322,
			"prep_time": 20,
			"nutrition": [
				"Calories: 381 kcal 19 %",
				"Fat: 19.2 g 29 %",
				"Carbs: 50.7g 16 %",
				"Protein: 3.8 g 8 %",
				"Cholesterol: 82 mg 27 %",
				"Sodium: 201 mg 8 %"
			],
			"comment": "Once you taste this, you won't ever go back to the marshmallow-topped variety! I have peeled and cooked in the microwave, and also boiled the sweet potatoes. They taste the same no matter how you cook them. So, use the technique that works best for you!",
			"cal": 381,
			"total_time": 170,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/303240.jpg",
			"ingredients": [
				"5 sweet potatoes ",
				" 1/4 teaspoon salt ",
				" 1/4 cup butter ",
				" 2 eggs ",
				" 1 teaspoon vanilla extract ",
				" 1/2 teaspoon ground cinnamon ",
				" 1/2 cup white sugar ",
				" 2 tablespoons heavy cream ",
				" 1/4 cup butter, softened ",
				" 3 tablespoons all-purpose flour ",
				" 3/4 cup packed light brown sugar ",
				" 1/2 cup chopped pecans "
			]
		},
		{
			"name": "Sausage Egg Casserole",
			"reviews": "412",
			"directions": "Place sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, and set aside. Melt butter in skillet, and cook and stir the green onions and mushrooms until tender. In a large bowl, mix the eggs, cottage cheese, Monterey Jack cheese, and chiles. Stir in the sausage, green onions, and mushrooms. Cover, and refrigerate overnight. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. In a bowl, sift together the flour, baking powder, and salt. Blend in the melted butter. Stir the flour mixture into the egg mixture. Pour into the prepared baking dish. Bake 40 to 50 minutes in the preheated oven, or until lightly brown. Let stand 10 minutes before serving.",
			"rating": "4.67049789428711",
			"cook_time": 80,
			"ready_in_time": 580,
			"id": 19323,
			"prep_time": 20,
			"nutrition": [
				"Calories: 408 kcal 20 %",
				"Fat: 28.7 g 44 %",
				"Carbs: 12.4g 4 %",
				"Protein: 25.2 g 50 %",
				"Cholesterol: 224 mg 75 %",
				"Sodium: 1095 mg 44 %"
			],
			"comment": "Assemble the ingredients the night before, and bake this casserole in the morning. Stand back and wait for the compliments. I've made it with fat free cottage cheese, egg substitute, and reduced fat sausage; the taste is still wonderful!",
			"cal": 408,
			"total_time": 680,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/50498.jpg",
			"ingredients": [
				"3/4 pound ground pork sausage ",
				" 1 tablespoon butter ",
				" 4 green onions, chopped ",
				" 1/2 pound fresh mushrooms, sliced ",
				" 10 eggs, beaten ",
				" 1 (16 ounce) container low-fat cottage cheese ",
				" 1 pound Monterey Jack cheese, shredded ",
				" 2 (4 ounce) cans diced green chile peppers, drained ",
				" 1 cup all-purpose flour ",
				" 1 teaspoon baking powder ",
				" 1/2 teaspoon salt ",
				" 1/3 cup butter, melted "
			]
		},
		{
			"name": "Cheesy Ham and Hash Brown Casserole",
			"reviews": "1706",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a 9x13 inch baking dish. In a large bowl, mix hash browns, ham, cream of potato soup, sour cream, and Cheddar cheese. Spread evenly into prepared dish. Sprinkle with Parmesan cheese. Bake 1 hour in the preheated oven, or until bubbly and lightly brown. Serve immediately.",
			"rating": "4.52750110626221",
			"cook_time": 60,
			"ready_in_time": 75,
			"id": 19324,
			"prep_time": 15,
			"nutrition": [
				"Calories: 415 kcal 21 %",
				"Fat: 27.2 g 42 %",
				"Carbs: 29.7g 10 %",
				"Protein: 14.4 g 29 %",
				"Cholesterol: 53 mg 18 %",
				"Sodium: 761 mg 30 %"
			],
			"comment": "I mostly use this as a breakfast casserole, but it's great anytime. May be served with or without diced ham. Quick and easy to make, not to mention delicious!",
			"cal": 415,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/566024.jpg",
			"ingredients": [
				"1 (32 ounce) package frozen hash brown potatoes ",
				" 8 ounces cooked, diced ham ",
				" 2 (10.75 ounce) cans condensed cream of potato soup ",
				" 1 (16 ounce) container sour cream ",
				" 2 cups shredded sharp Cheddar cheese ",
				" 1 1/2 cups grated Parmesan cheese "
			]
		},
		{
			"name": "Basic Crepes",
			"reviews": "2125",
			"directions": "In a large mixing bowl, whisk together the flour and the eggs. Gradually add in the milk and water, stirring to combine. Add the salt and butter; beat until smooth. Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each crepe. Tilt the pan with a circular motion so that the batter coats the surface evenly. Cook the crepe for about 2 minutes, until the bottom is light brown. Loosen with a spatula, turn and cook the other side. Serve hot.",
			"rating": "4.64256191253662",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 19326,
			"prep_time": 10,
			"nutrition": [
				"Calories: 216 kcal 11 %",
				"Fat: 9.2 g 14 %",
				"Carbs: 25.5g 8 %",
				"Protein: 7.4 g 15 %",
				"Cholesterol: 111 mg 37 %",
				"Sodium: 235 mg 9 %"
			],
			"comment": "Here is a simple but delicious crepe batter which can be made in minutes. It's made from ingredients that everyone has on hand.",
			"cal": 216,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/400570.jpg",
			"ingredients": [
				"1 cup all-purpose flour ",
				" 2 eggs ",
				" 1/2 cup milk ",
				" 1/2 cup water ",
				" 1/4 teaspoon salt ",
				" 2 tablespoons butter, melted "
			]
		},
		{
			"name": "Wassail Punch",
			"reviews": "111",
			"directions": "In a slow-cooker or a large pot over low heat, combine apple cider, orange juice and lemon juice. Season with cloves, ginger and nutmeg. Bring to a simmer. If using a slow cooker, allow to simmer all day. Serve hot.",
			"rating": "4.65605115890503",
			"cook_time": 480,
			"ready_in_time": 485,
			"id": 19327,
			"prep_time": 5,
			"nutrition": [
				"Calories: 101 kcal 5 %",
				"Fat: 0.4 g < 1 %",
				"Carbs: 24.9g 8 %",
				"Protein: 0.5 g 1 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 8 mg < 1 %"
			],
			"comment": "Great for holiday gatherings. Using a slow-cooker to prepare this allows the aroma to be savored for hours.",
			"cal": 101,
			"total_time": 970,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/929749.jpg",
			"ingredients": [
				"2 quarts apple cider ",
				" 2 cups orange juice ",
				" 1/2 cup lemon juice ",
				" 12 whole cloves ",
				" 4 cinnamon sticks ",
				" 1 pinch ground ginger ",
				" 1 pinch ground nutmeg "
			]
		},
		{
			"name": "Brie Cheese Appetizer",
			"reviews": "242",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a cookie sheet. Slice one wheel of Brie cheese in half so you have 2 circles of cheese. Spread apricot or peach preserves on (the cut side) half of one circle of brie. Make sandwich out of the two halves of Brie, so that the preserves are in the center of both halves. Wrap the entire wheel of Brie with one sheet of puffed pastry and flip the entire concoction onto the prepared cooking sheet so the seam is on bottom. Brush the puffed pastry with the egg white. Bake for 30 minutes, or until the pastry in golden brown. Serve immediately.",
			"rating": "4.68292665481567",
			"cook_time": 30,
			"ready_in_time": 40,
			"id": 19328,
			"prep_time": 10,
			"nutrition": [
				"Calories: 286 kcal 14 %",
				"Fat: 19.5 g 30 %",
				"Carbs: 19.1g 6 %",
				"Protein: 8.6 g 17 %",
				"Cholesterol: 28 mg 9 %",
				"Sodium: 264 mg 11 %"
			],
			"comment": "A light, fluffy puff pastry is filled with melted Brie cheese and hot fruit preserves. If you do not want a sweet wheel, you may substitute herbed cheese spread for the preserves. Baking times are the same for the substitution.",
			"cal": 286,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1870524.jpg",
			"ingredients": [
				"1 (8 ounce) wheel Brie cheese ",
				" 3 tablespoons apricot preserves ",
				" 1/2 (17.5 ounce) package frozen puff pastry, thawed ",
				" 1 egg white "
			]
		},
		{
			"name": "Roasted Vegetables",
			"reviews": "1351",
			"directions": "Preheat oven to 475 degrees F (245 degrees C). In a large bowl, combine the squash, red bell peppers, sweet potato, and Yukon Gold potatoes. Separate the red onion quarters into pieces, and add them to the mixture. In a small bowl, stir together thyme, rosemary, olive oil, vinegar, salt, and pepper. Toss with vegetables until they are coated. Spread evenly on a large roasting pan. Roast for 35 to 40 minutes in the preheated oven, stirring every 10 minutes, or until vegetables are cooked through and browned.",
			"rating": "4.61581325531006",
			"cook_time": 40,
			"ready_in_time": 55,
			"id": 19329,
			"prep_time": 15,
			"nutrition": [
				"Calories: 123 kcal 6 %",
				"Fat: 4.7 g 7 %",
				"Carbs: 20g 6 %",
				"Protein: 2 g 4 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 13 mg < 1 %"
			],
			"comment": "A casserole dish of seasonal vegetables that is so easy to prepare. It can be made a day ahead - just reheat before serving. Lemon juice can be substituted for balsamic vinegar, and you can use baking potatoes if you don't have any Yukon Golds on hand.",
			"cal": 123,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1486.jpg",
			"ingredients": [
				"1 small butternut squash, cubed ",
				" 2 red bell peppers, seeded and diced ",
				" 1 sweet potato, peeled and cubed ",
				" 3 Yukon Gold potatoes, cubed ",
				" 1 red onion, quartered ",
				" 1 tablespoon chopped fresh thyme ",
				" 2 tablespoons chopped fresh rosemary ",
				" 1/4 cup olive oil ",
				" 2 tablespoons balsamic vinegar ",
				" salt and freshly ground black pepper "
			]
		},
		{
			"name": "Southern Fried Cabbage",
			"reviews": "339",
			"directions": "Place the bacon and vegetable oil into a large pot over medium heat. Season with salt and pepper. Cook for about 5 minutes, or until bacon is crisp. Add cabbage, onion, and sugar to the pot; cook and stir continuously for 5 minutes, until tender.",
			"rating": "4.62829732894897",
			"cook_time": 10,
			"ready_in_time": 15,
			"id": 19330,
			"prep_time": 5,
			"nutrition": [
				"Calories: 189 kcal 9 %",
				"Fat: 14.2 g 22 %",
				"Carbs: 13.6g 4 %",
				"Protein: 4.4 g 9 %",
				"Cholesterol: 5 mg 2 %",
				"Sodium: 528 mg 21 %"
			],
			"comment": "This dish was always a favorite at Mammaw's house. Cabbage is fried with onion and bacon in this simple quick side dish. Terrific with cornbread.",
			"cal": 189,
			"total_time": 30,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/848416.jpg",
			"ingredients": [
				"3 slices bacon, cut into thirds ",
				" 1/3 cup vegetable oil ",
				" 1 teaspoon salt, or to taste ",
				" 1 teaspoon ground black pepper, or to taste ",
				" 1 head cabbage, cored and sliced ",
				" 1 white onion, chopped ",
				" 1 pinch white sugar "
			]
		},
		{
			"name": "Bacon Wrapped Dates Stuffed with Blue Cheese",
			"reviews": "250",
			"directions": "Preheat the oven to 375 degrees F (190 degrees C). Slice dates in half, and open them up. Pinch off pieces of blue cheese, and place them into the center of the dates. Close the halves of the dates, and wrap a half-slice of bacon around the outside. Secure each one with a toothpick. Arrange in a baking dish or on a baking sheet with sides to catch any grease. Bake for 30 to 40 minutes in the preheated oven, or until the bacon is crisp. Turn dates over after the first 20 minutes for even cooking.",
			"rating": "4.59752321243286",
			"cook_time": 40,
			"ready_in_time": 60,
			"id": 19331,
			"prep_time": 20,
			"nutrition": [
				"Calories: 78 kcal 4 %",
				"Fat: 3 g 5 %",
				"Carbs: 10.8g 3 %",
				"Protein: 2.8 g 6 %",
				"Cholesterol: 8 mg 3 %",
				"Sodium: 157 mg 6 %"
			],
			"comment": "Dates are stuffed with blue cheese, wrapped in bacon and baked until crisp. These are delicious and very easy to make for a party. You can serve them at room temperature, so it is okay to make a few hours in advance!",
			"cal": 78,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/32064.jpg",
			"ingredients": [
				"1 pound sliced bacon, cut in half ",
				" 1 pound pitted dates ",
				" 4 ounces blue cheese "
			]
		},
		{
			"name": "Country Breakfast Casserole",
			"reviews": "389",
			"directions": "Preheat oven to 325 degrees F (165 degrees C). Grease an 11x8 inch baking dish. Brown sausage in a large skillet; drain fat. Combine sausage with green onion and spread evenly across the bottom of the baking dish. Top with shredded cheese. Whisk together eggs, water, milk, and gravy mix; add mixture to baking dish. Arrange bread squares evenly on top. If desired, drizzle melted butter over bread, and sprinkle with paprika. Bake 40 minutes in the preheated oven, or until a knife inserted into the center comes out clean. Set aside 10 minutes before serving.",
			"rating": "4.58403348922729",
			"cook_time": 50,
			"ready_in_time": 75,
			"id": 19332,
			"prep_time": 15,
			"nutrition": [
				"Calories: 493 kcal 25 %",
				"Fat: 39.9 g 61 %",
				"Carbs: 12.3g 4 %",
				"Protein: 20.5 g 41 %",
				"Cholesterol: 217 mg 72 %",
				"Sodium: 788 mg 32 %"
			],
			"comment": "A one-dish casserole with all of your Sunday morning favorites: sausage, gravy, eggs, cheese, and toast.",
			"cal": 493,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1093220.jpg",
			"ingredients": [
				"1 (16 ounce) package breakfast sausage ",
				" 1 chopped green onion ",
				" 2 cups shredded Cheddar cheese ",
				" 6 eggs, lightly beaten ",
				" 1 cup water ",
				" 1/2 cup milk ",
				" 1 (2.64 ounce) package country gravy mix ",
				" 6 slices bread, cut into 1 inch cubes ",
				" 2 tablespoons melted butter (optional) ",
				" paprika to taste (optional) "
			]
		},
		{
			"name": "Fabulous Fried Cabbage",
			"reviews": "237",
			"directions": "Bring the butter and chicken broth to a boil in a large skillet. Reduce heat to low and add the cabbage. Cover and cook over low heat to steam the cabbage for about 45 minutes, stirring frequently, or until cabbage is tender and sweet. Season with salt and pepper and serve.",
			"rating": "4.48113203048706",
			"cook_time": 45,
			"ready_in_time": 50,
			"id": 19333,
			"prep_time": 5,
			"nutrition": [
				"Calories: 66 kcal 3 %",
				"Fat: 1.7 g 3 %",
				"Carbs: 11.8g 4 %",
				"Protein: 2.9 g 6 %",
				"Cholesterol: 5 mg 2 %",
				"Sodium: 449 mg 18 %"
			],
			"comment": "A favorite old Irish family recipe for fried cabbage and it's so easy.",
			"cal": 66,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/567274.jpg",
			"ingredients": [
				"2 teaspoons butter ",
				" 1 (15 ounce) can chicken broth ",
				" 1 head cabbage, cored and coarsely chopped ",
				" 1 pinch salt and pepper to taste "
			]
		},
		{
			"name": "Butternut Squash Casserole",
			"reviews": "402",
			"directions": "Preheat oven to 425 degrees F (220 degrees C). Put butternut squash in the microwave and cook on high, until soft, 2 to 3 minutes. Cut in half, scoop out seeds and cube. Bring a large pot of water to a boil. Add squash and cook until tender, about 15 minutes. Drain and mash. In a 9x13 inch casserole dish combine 3 cups mashed butternut squash, white sugar, milk, vanilla extract, salt, flour, eggs and 1/4 cup melted margarine. Bake in preheated oven for 45 minutes, or until set. In a medium bowl combine crushed vanilla wafers, 1/2 cup melted margarine and brown sugar. Crumble over top of cooked casserole and return to oven to brown.",
			"rating": "4.65199995040894",
			"cook_time": 60,
			"ready_in_time": 75,
			"id": 19334,
			"prep_time": 15,
			"nutrition": [
				"Calories: 320 kcal 16 %",
				"Fat: 13.5 g 21 %",
				"Carbs: 48.7g 16 %",
				"Protein: 4.1 g 8 %",
				"Cholesterol: 39 mg 13 %",
				"Sodium: 183 mg 7 %"
			],
			"comment": "This recipe is in great demand from my friends and family. It tastes similar to sweet potato souffle, with a custard-like texture. Use with any meal that sweet potatoes seem to go with (for example, ham, pork, etc). Yum yum!!!",
			"cal": 320,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/423340.jpg",
			"ingredients": [
				"1 butternut squash ",
				" 1 cup white sugar ",
				" 1 1/2 cups milk ",
				" 1 teaspoon vanilla extract ",
				" 1 pinch salt ",
				" 2 tablespoons all-purpose flour ",
				" 3 eggs ",
				" 1/4 cup margarine, melted ",
				" TOPPING ",
				" 1/2 (16 ounce) package vanilla wafers, crushed ",
				" 1/2 cup margarine, melted ",
				" 1 cup brown sugar "
			]
		},
		{
			"name": "Moroccan-Style Stuffed Acorn Squash",
			"reviews": "318",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Arrange squash halves cut side down on a baking sheet. Bake 30 minutes, or until tender. Dissolve the sugar in the melted butter. Brush squash with the butter mixture, and keep squash warm while preparing the stuffing. Heat the olive oil in a skillet over medium heat. Stir in the garlic, celery, and carrots, and cook 5 minutes. Mix in the garbanzo beans and raisins. Season with cumin, salt, and pepper, and continue to cook and stir until vegetables are tender. Pour the chicken broth into the skillet, and mix in the couscous. Cover skillet, and turn off heat. Allow couscous to absorb liquid for 5 minutes. Stuff squash halves with the skillet mixture to serve.",
			"rating": "4.48617506027222",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 19335,
			"prep_time": 15,
			"nutrition": [
				"Calories: 502 kcal 25 %",
				"Fat: 11.7 g 18 %",
				"Carbs: 93.8g 30 %",
				"Protein: 11.2 g 22 %",
				"Cholesterol: 10 mg 3 %",
				"Sodium: 728 mg 29 %"
			],
			"comment": "Vegetables, garbanzos, raisins and couscous in a lovely Moroccan broth taste delicious inside butter and brown sugar-brushed acorn squash. You can experiment with different vegetables, or add diced chicken. Feel free to be creative with your amounts - I usually freestyle and end up with leftover stuffing mixture, which tastes great on its own the next day. For vegetarians, substitute vegetable broth for the chicken broth.",
			"cal": 502,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1118127.jpg",
			"ingredients": [
				"2 tablespoons brown sugar ",
				" 1 tablespoon butter, melted ",
				" 2 large acorn squash, halved and seeded ",
				" 2 tablespoons olive oil ",
				" 2 cloves garlic, chopped ",
				" 2 stalks celery, chopped ",
				" 2 carrots, chopped ",
				" 1 cup garbanzo beans, drained ",
				" 1/2 cup raisins ",
				" 1 1/2 tablespoons ground cumin ",
				" salt and pepper to taste ",
				" 1 (14 ounce) can chicken broth ",
				" 1 cup uncooked couscous "
			]
		},
		{
			"name": "Roasted Beets and Sauteed Beet Greens",
			"reviews": "326",
			"directions": "Preheat the oven to 350 degrees (175 degrees C). Wash the beets thoroughly, leaving the skins on, and remove the greens. Rinse greens, removing any large stems, and set aside. Place the beets in a small baking dish or roasting pan, and toss with 2 tablespoons of olive oil. If you wish to peel the beets, it is easier to do so once they have been roasted. Cover, and bake for 45 to 60 minutes, or until a knife can slide easily through the largest beet. When the roasted beets are almost done, heat the remaining 2 tablespoons olive oil in a skillet over medium-low heat. Add the garlic and onion, and cook for a minute. Tear the beet greens into 2 to 3 inch pieces, and add them to the skillet. Cook and stir until greens are wilted and tender. Season with salt and pepper. Serve the greens as is, and the roasted beets sliced with either red-wine vinegar, or butter and salt and pepper.",
			"rating": "4.58057403564453",
			"cook_time": 60,
			"ready_in_time": 70,
			"id": 19336,
			"prep_time": 10,
			"nutrition": [
				"Calories: 204 kcal 10 %",
				"Fat: 13.9 g 21 %",
				"Carbs: 18g 6 %",
				"Protein: 5.3 g 11 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 442 mg 18 %"
			],
			"comment": "This is a great way to use every part of the fresh beets you buy. You can get two delicious side dishes out of this one vegetable.",
			"cal": 204,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/350902.jpg",
			"ingredients": [
				"1 bunch beets with ",
				" greens ",
				" 1/4 cup olive oil, divided ",
				" 2 cloves garlic, minced ",
				" 2 tablespoons chopped onion (optional) ",
				" salt and pepper to taste ",
				" 1 tablespoon red wine vinegar (optional) "
			]
		},
		{
			"name": "Butternut Squash Risotto",
			"reviews": "334",
			"directions": "Place squash cubes into a steamer basket in a saucepan. Add water, cover, and bring to a boil over medium-high heat. Allow to steam until the squash is tender (10 to 15 minutes), then drain, and mash in a bowl with a fork. Melt butter in a saucepan over medium-high heat. Add onion; cook and stir for 2 minutes until the onion begins to soften, then stir in the rice. Continue cooking and stirring until the rice is glossy from the butter, and the onion begins to brown on the edges, about 5 minutes more. Pour in the white wine; cook, stirring constantly, until it has evaporated. Stir in the mashed squash and 1/3 of the hot chicken stock; reduce heat to medium. Cook and stir until the chicken stock has been absorbed by the rice, 5 to 7 minutes. Add half of the remaining chicken stock, and continue stirring until it has been absorbed. Finally, pour in the remaining stock, and continue stirring until the risotto is creamy. Finish by stirring in the Parmesan cheese, and seasoning to taste with salt and pepper.",
			"rating": "4.50210094451904",
			"cook_time": 35,
			"ready_in_time": 55,
			"id": 19337,
			"prep_time": 20,
			"nutrition": [
				"Calories: 342 kcal 17 %",
				"Fat: 8 g 12 %",
				"Carbs: 57.1g 18 %",
				"Protein: 7.4 g 15 %",
				"Cholesterol: 21 mg 7 %",
				"Sodium: 979 mg 39 %"
			],
			"comment": "If you like the natural sweet flavor of butternut squash, you'll love this risotto! It is so creamy and full of flavor! Great as a side dish or main course.",
			"cal": 342,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2842565.jpg",
			"ingredients": [
				"2 cups cubed butternut squash ",
				" 2 tablespoons butter ",
				" 1/2 onion, minced ",
				" 1 cup Arborio rice ",
				" 1/3 cup dry white wine ",
				" 5 cups hot chicken stock ",
				" 1/4 cup grated Parmesan cheese ",
				" salt and ground black pepper to taste "
			]
		},
		{
			"name": "Charline's Sweet Potato Casserole",
			"reviews": "284",
			"directions": "Preheat oven to 400 degrees F (200 degrees C). Prepare a 9x13 inch baking dish with butter. In a large bowl, mash the sweet potatoes. Mix together with sugar, eggs, 3/4 cup margarine, evaporated milk, nutmeg, cinnamon, marshmallows and coconut. Scoop the mixture into the baking dish. Bake 20 minutes in the preheated oven, or until sweet potatoes are tender. In a small bowl, mix the crushed cornflakes, brown sugar, pecans and remaining 3/4 cup margarine. Spread the topping over the baked casserole. Return the casserole to the 400 degrees F (200 degrees C) oven and bake an additional 10 minutes.",
			"rating": "4.6811146736145",
			"cook_time": 30,
			"ready_in_time": 45,
			"id": 19338,
			"prep_time": 15,
			"nutrition": [
				"Calories: 305 kcal 15 %",
				"Fat: 18.7 g 29 %",
				"Carbs: 33.5g 11 %",
				"Protein: 3.1 g 6 %",
				"Cholesterol: 34 mg 11 %",
				"Sodium: 185 mg 7 %"
			],
			"comment": "A great sweet potato casserole recipe -- my children insist on this every holiday! Lots of miniature marshmallows, coconut and pecans make this an extra special and yummy Thanksgiving delight. Use fresh or canned sweet potatoes. Prepare the topping while the casserole is baking.",
			"cal": 305,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/53989.jpg",
			"ingredients": [
				"4 cups sweet potatoes, peeled and cubed ",
				" 2 cups white sugar ",
				" 4 eggs, beaten ",
				" 3/4 cup margarine, melted ",
				" 1 cup evaporated milk ",
				" 1 teaspoon ground nutmeg ",
				" 1 teaspoon ground cinnamon ",
				" 2 cups miniature marshmallows ",
				" 1 cup flaked coconut ",
				" 1 1/2 cups crushed cornflakes cereal ",
				" 1/2 cup packed brown sugar ",
				" 1 cup chopped pecans ",
				" 3/4 cup margarine, melted "
			]
		},
		{
			"name": "Spanakopita II",
			"reviews": "231",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Heat vegetable oil in a large saucepan over medium heat. Slowly cook and stir onions until softened. Mix in spinach, dill and flour. Cook approximately 10 minutes, or until most of the moisture has been absorbed. Remove from heat. Mix in feta cheese, eggs, salt and pepper. Separate one sheet of phyllo from the stack and evenly brush with a light coating of butter. Place another sheet of phyllo over the butter and press the two sheets together. Cut the layered phyllo dough into long strips about 3 inches wide. Keep the remaining phyllo covered with plastic wrap to keep it from drying out. Lay out one strip of phyllo at a time on your work surface with one of the narrow ends close to you. Place a heaping tablespoon of filling 1 inch from the end closest to you. Fold the bottom right corner over the filling to the left edge to form a triangle. Fold the triangle up, bringing the point at the bottom left up to rest along the left edge. Turn the lower left corner over to touch the right edge. Continue turning the triangle over in this manner until you reach the end of the phyllo. Repeat with the remaining filling and phyllo dough. Place filled phyllo dough triangles on a large baking sheet and brush with the remaining butter. Bake in the preheated oven until golden brown, 45 minutes to 1 hour.",
			"rating": "4.69009590148926",
			"cook_time": 65,
			"ready_in_time": 95,
			"id": 19340,
			"prep_time": 30,
			"nutrition": [
				"Calories: 246 kcal 12 %",
				"Fat: 18.4 g 28 %",
				"Carbs: 15.9g 5 %",
				"Protein: 5 g 10 %",
				"Cholesterol: 62 mg 21 %",
				"Sodium: 313 mg 13 %"
			],
			"comment": "The recipe for these spinach and feta appetizer triangles came from a Greek family friend. They may be frozen prior to baking.",
			"cal": 246,
			"total_time": 190,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/251287.jpg",
			"ingredients": [
				"1/2 cup vegetable oil ",
				" 2 large onions, chopped ",
				" 2 (10 ounce) packages frozen chopped spinach - thawed, drained and squeezed dry ",
				" 2 tablespoons chopped fresh dill ",
				" 2 tablespoons all-purpose flour ",
				" 2 (4 ounce) packages feta cheese, crumbled ",
				" 4 eggs, lightly beaten ",
				" salt and pepper to taste ",
				" 1 1/2 (16 ounce) packages phyllo dough ",
				" 3/4 pound butter, melted "
			]
		},
		{
			"name": "Artichoke Bruschetta",
			"reviews": "289",
			"directions": "Preheat the broiler. In a medium bowl, mix marinated artichoke hearts, Romano cheese, red onion and mayonnaise. Top French baguette slices with equal amounts of the artichoke heart mixture. Arrange slices in a single layer on a large baking sheet. Broil in the preheated oven 2 minutes, or until toppings are bubbly and lightly browned.",
			"rating": "4.53298139572144",
			"cook_time": 2,
			"ready_in_time": 20,
			"id": 19341,
			"prep_time": 18,
			"nutrition": [
				"Calories: 278 kcal 14 %",
				"Fat: 11.1 g 17 %",
				"Carbs: 35.7g 12 %",
				"Protein: 10 g 20 %",
				"Cholesterol: 11 mg 4 %",
				"Sodium: 593 mg 24 %"
			],
			"comment": "This is a great bruschetta recipe based on an artichoke dip. It's always a huge hit! Try adding spinach or tomatoes!",
			"cal": 278,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/257843.jpg",
			"ingredients": [
				"1 (6.5 ounce) jar marinated artichoke hearts, drained and chopped ",
				" 1/2 cup grated Romano cheese ",
				" 1/3 cup finely chopped red onion ",
				" 5 tablespoons mayonnaise ",
				" 1 French baguette, cut into 1/3 inch thick slices "
			]
		},
		{
			"name": "Black-Eyed Pea Gumbo",
			"reviews": "405",
			"directions": "Heat the olive oil in a large saucepan over medium heat, and cook the onion, pepper, and celery until tender. Pour in the chicken broth, and mix in rice, black-eyed peas with liquid, diced tomatoes and green chiles, diced tomatoes, and garlic. Bring to a boil, reduce heat to low, and simmer 45 minutes, or until rice is tender. Add water if soup is too thick.",
			"rating": "4.42942333221436",
			"cook_time": 55,
			"ready_in_time": 70,
			"id": 19343,
			"prep_time": 15,
			"nutrition": [
				"Calories: 272 kcal 14 %",
				"Fat: 3.4 g 5 %",
				"Carbs: 48.5g 16 %",
				"Protein: 12.5 g 25 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 870 mg 35 %"
			],
			"comment": "A winter time favorite at our house. We always have it for New Year's Day while we watch football! Serve with a tossed salad and corn bread.",
			"cal": 272,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/160914.jpg",
			"ingredients": [
				"1 tablespoon olive oil ",
				" 1 medium onion, chopped ",
				" 1 medium green bell pepper, chopped ",
				" 5 stalks celery, chopped ",
				" 2 cups chicken broth ",
				" 1 cup brown rice ",
				" 4 (15 ounce) cans black-eyed peas with liquid ",
				" 1 (10 ounce) can diced tomatoes and green chiles ",
				" 1 (14.5 ounce) can diced tomatoes ",
				" 2 cloves garlic, finely chopped "
			]
		},
		{
			"name": "Baked Ham and Cheese Party Sandwiches",
			"reviews": "282",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish. In a bowl, mix together butter, Dijon mustard, Worcestershire sauce, poppy seeds, and dried onion. Separate the tops from bottoms of the rolls, and place the bottom pieces into the prepared baking dish. Layer about half the ham onto the rolls. Arrange the Swiss cheese over the ham, and top with remaining ham slices in a layer. Place the tops of the rolls onto the sandwiches. Pour the mustard mixture evenly over the rolls. Bake in the preheated oven until the rolls are lightly browned and the cheese has melted, about 20 minutes. Slice into individual rolls through the ham and cheese layers to serve.",
			"rating": "4.79310321807861",
			"cook_time": 20,
			"ready_in_time": 35,
			"id": 19344,
			"prep_time": 15,
			"nutrition": [
				"Calories: 208 kcal 10 %",
				"Fat: 14 g 22 %",
				"Carbs: 10.8g 3 %",
				"Protein: 9.8 g 20 %",
				"Cholesterol: 43 mg 14 %",
				"Sodium: 439 mg 18 %"
			],
			"comment": "These small, delicious sandwiches are perfect for any party. They are so good that even the pickiest of eaters will eat these.",
			"cal": 208,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1081745.jpg",
			"ingredients": [
				"3/4 cup melted butter ",
				" 1 1/2 tablespoons Dijon mustard ",
				" 1 1/2 teaspoons Worcestershire sauce ",
				" 1 1/2 tablespoons poppy seeds ",
				" 1 tablespoon dried minced onion ",
				" 24 mini sandwich rolls ",
				" 1 pound thinly sliced cooked deli ham ",
				" 1 pound thinly sliced Swiss cheese "
			]
		},
		{
			"name": "Four Cheese Margherita Pizza",
			"reviews": "286",
			"directions": "Stir together olive oil, garlic, and salt; toss with tomatoes, and allow to stand for 15 minutes. Preheat oven to 400 degrees F (200 degrees C). Brush each pizza crust with some of the tomato marinade. Sprinkle the pizzas evenly with Mozzarella and Fontina cheeses. Arrange tomatoes overtop, then sprinkle with shredded basil, Parmesan, and feta cheese. Bake in preheated oven until the cheese is bubbly and golden brown, about 10 minutes.",
			"rating": "4.79764699935913",
			"cook_time": 10,
			"ready_in_time": 40,
			"id": 19345,
			"prep_time": 15,
			"nutrition": [
				"Calories: 551 kcal 28 %",
				"Fat: 25.6 g 39 %",
				"Carbs: 54.4g 18 %",
				"Protein: 28.9 g 58 %",
				"Cholesterol: 58 mg 19 %",
				"Sodium: 1183 mg 47 %"
			],
			"comment": "This is a fantastic version of an Italian classic. The feta cheese adds a rich flavor that brings this dish to life. Incredibly easy and incredibly delicious!",
			"cal": 551,
			"total_time": 65,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/694708.jpg",
			"ingredients": [
				"1/4 cup olive oil ",
				" 1 tablespoon minced garlic ",
				" 1/2 teaspoon sea salt ",
				" 8 Roma tomatoes, sliced ",
				" 2 (12 inch) pre-baked pizza crusts ",
				" 8 ounces shredded Mozzarella cheese ",
				" 4 ounces shredded Fontina cheese ",
				" 10 fresh basil leaves, washed, dried ",
				" 1/2 cup freshly grated Parmesan cheese ",
				" 1/2 cup crumbled feta cheese "
			]
		},
		{
			"name": "Easy, Cheesy Tortellini Bake",
			"reviews": "223",
			"directions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook according to package directions; drain. Adjust oven rack to the highest position and turn oven on to Broil. Generously butter or grease an 8x8 inch baking dish. Bring marinara and Alfredo sauces along with spinach and 1 tablespoon of Italian seasoning to a simmer over medium-high heat. Reduce heat to medium-low, and simmer for 10 minutes. Stir cooked tortellini into sauce, then pour into prepared baking dish. Sprinkle with Mozzarella cheese, Parmesan cheese, and remaining 1 teaspoon Italian seasoning. Broil for a minute or two until cheese has melted and turned golden brown.",
			"rating": "4.32398748397827",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 19346,
			"prep_time": 15,
			"nutrition": [
				"Calories: 711 kcal 36 %",
				"Fat: 39.8 g 61 %",
				"Carbs: 62.5g 20 %",
				"Protein: 29.6 g 59 %",
				"Cholesterol: 97 mg 32 %",
				"Sodium: 1830 mg 73 %"
			],
			"comment": "This is such an easy recipe, but it looks and smells great, and tastes even better! Your guests will think you spent hours on it. You can add cooked Italian sausage, too! Great with a salad and garlic bread.",
			"cal": 711,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/309701.jpg",
			"ingredients": [
				"2 (9 ounce) packages cheese tortellini ",
				" 1 (24 ounce) jar marinara sauce ",
				" 1 (16 ounce) jar Alfredo sauce ",
				" 1 (10 ounce) box frozen chopped spinach, thawed and squeezed dry ",
				" 1 tablespoon dried Italian seasoning ",
				" 1 (8 ounce) package shredded Mozzarella cheese ",
				" 1/4 cup freshly grated Parmesan cheese ",
				" 1 teaspoon dried Italian seasoning "
			]
		},
		{
			"name": "Cajun Style Baked Sweet Potato",
			"reviews": "282",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). In a small bowl, stir together paprika, brown sugar, black pepper, onion powder, thyme, rosemary, garlic powder, and cayenne pepper. Slice the sweet potatoes in half lengthwise. Brush each half with olive oil. Rub the seasoning mix over the cut surface of each half. Place sweet potatoes on a baking sheet, or in a shallow pan. Bake in preheated oven until tender, or about 1 hour.",
			"rating": "4.43958854675293",
			"cook_time": 60,
			"ready_in_time": 70,
			"id": 19348,
			"prep_time": 10,
			"nutrition": [
				"Calories: 229 kcal 11 %",
				"Fat: 2.3 g 3 %",
				"Carbs: 49.1g 16 %",
				"Protein: 4.8 g 10 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 83 mg 3 %"
			],
			"comment": "Tired of the same old baked sweet potato? Great for picnics and barbecues, these sweet potatoes are seasoned with a homemade herb and spice mix.",
			"cal": 229,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/275456.jpg",
			"ingredients": [
				"1 1/2 teaspoons paprika ",
				" 1 teaspoon brown sugar ",
				" 1/4 teaspoon black pepper ",
				" 1/4 teaspoon onion powder ",
				" 1/4 teaspoon dried thyme ",
				" 1/4 teaspoon dried rosemary ",
				" 1/4 teaspoon garlic powder ",
				" 1/8 teaspoon cayenne pepper ",
				" 2 large sweet potatoes ",
				" 1 1/2 teaspoons olive oil "
			]
		},
		{
			"name": "Brie Cheese Appetizer",
			"reviews": "242",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a cookie sheet. Slice one wheel of Brie cheese in half so you have 2 circles of cheese. Spread apricot or peach preserves on (the cut side) half of one circle of brie. Make sandwich out of the two halves of Brie, so that the preserves are in the center of both halves. Wrap the entire wheel of Brie with one sheet of puffed pastry and flip the entire concoction onto the prepared cooking sheet so the seam is on bottom. Brush the puffed pastry with the egg white. Bake for 30 minutes, or until the pastry in golden brown. Serve immediately.",
			"rating": "4.68292665481567",
			"cook_time": 30,
			"ready_in_time": 40,
			"id": 19349,
			"prep_time": 10,
			"nutrition": [
				"Calories: 286 kcal 14 %",
				"Fat: 19.5 g 30 %",
				"Carbs: 19.1g 6 %",
				"Protein: 8.6 g 17 %",
				"Cholesterol: 28 mg 9 %",
				"Sodium: 264 mg 11 %"
			],
			"comment": "A light, fluffy puff pastry is filled with melted Brie cheese and hot fruit preserves. If you do not want a sweet wheel, you may substitute herbed cheese spread for the preserves. Baking times are the same for the substitution.",
			"cal": 286,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1870524.jpg",
			"ingredients": [
				"1 (8 ounce) wheel Brie cheese ",
				" 3 tablespoons apricot preserves ",
				" 1/2 (17.5 ounce) package frozen puff pastry, thawed ",
				" 1 egg white "
			]
		},
		{
			"name": "Shrimpcargot",
			"reviews": "195",
			"directions": "Preheat oven to 325 degrees F (165 degrees C). Heat the butter and garlic in a skillet over medium heat until the butter begins to bubble. Stir in the shrimp, and cook until they just turn pink, about 3 minutes. Place one shrimp into each mushroom cap, and place into a small baking dish. Spoon the garlic butter into the mushroom caps, and sprinkle each with a pinch of mozzarella cheese. Bake in the preheated oven until the mushrooms are tender and the cheese is golden and bubbly, 10 to 15 minutes.",
			"rating": "4.56097555160522",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 19350,
			"prep_time": 15,
			"nutrition": [
				"Calories: 203 kcal 10 %",
				"Fat: 17 g 26 %",
				"Carbs: 2.4g < 1 %",
				"Protein: 11.1 g 22 %",
				"Cholesterol: 108 mg 36 %",
				"Sodium: 202 mg 8 %"
			],
			"comment": "After having these shrimp as an appetizer at a restaurant I have been trying to duplicate them. Serve with bread to mop up the extra yummy garlic butter!",
			"cal": 203,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/630516.jpg",
			"ingredients": [
				"1/4 cup butter ",
				" 2 cloves garlic, minced ",
				" 6 peeled and deveined large shrimp (21 to 25 per lb) ",
				" 6 mushrooms, stems removed ",
				" 2 tablespoons shredded mozzarella cheese "
			]
		},
		{
			"name": "Caramel Snack Mix",
			"reviews": "251",
			"directions": "Preheat oven to 275 degrees F (135 degrees C). Spray a large roasting pan with non-stick cooking spray. In a medium-size microwave safe bowl, mix butter, white corn syrup and brown sugar. Place the mixture in the microwave and cook 2 minutes, or until butter melts. Place the cereal, pecans and almonds into the prepared roasting pan. Pour the melted butter mixture over the cereal and nuts and mix gently until the cereal and nuts are coated. Bake for 1 hour, stirring every 15 minutes. As the snack mix is cooling, be sure to continue to stir so that the mix will not harden in one big lump.",
			"rating": "4.68686866760254",
			"cook_time": 60,
			"ready_in_time": 70,
			"id": 19352,
			"prep_time": 10,
			"nutrition": [
				"Calories: 262 kcal 13 %",
				"Fat: 12.6 g 19 %",
				"Carbs: 36.9g 12 %",
				"Protein: 3.4 g 7 %",
				"Cholesterol: 12 mg 4 %",
				"Sodium: 183 mg 7 %"
			],
			"comment": "This is the most requested item I bring to the office. It has become the Christmas gift of choice from my kitchen.",
			"cal": 262,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/8548.jpg",
			"ingredients": [
				"1/2 cup butter ",
				" 3/4 cup white corn syrup ",
				" 1 cup packed brown sugar ",
				" 1 cup chopped pecans ",
				" 1 cup almonds ",
				" 1 (12 ounce) package crispy corn and rice cereal "
			]
		},
		{
			"name": "Grandma Jeanette's Amazing German Red Cabbage",
			"reviews": "243",
			"directions": "Place butter, cabbage, apples, and sugar into a large pot. Pour in the vinegar and water, and season with salt, pepper, and clove. Bring to a boil over medium-high heat, then reduce heat to low, cover, and simmer until the cabbage is tender, 1 1/2 to 2 hours.",
			"rating": "4.6120400428772",
			"cook_time": 90,
			"ready_in_time": 110,
			"id": 19353,
			"prep_time": 20,
			"nutrition": [
				"Calories: 148 kcal 7 %",
				"Fat: 6 g 9 %",
				"Carbs: 23.6g 8 %",
				"Protein: 1.4 g 3 %",
				"Cholesterol: 15 mg 5 %",
				"Sodium: 1375 mg 55 %"
			],
			"comment": "This yummy, sweet and sour German red cabbage is easy to make!",
			"cal": 148,
			"total_time": 220,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/398520.jpg",
			"ingredients": [
				"2 tablespoons butter ",
				" 5 cups shredded red cabbage ",
				" 1 cup sliced green apples ",
				" 1/3 cup apple cider vinegar ",
				" 3 tablespoons water ",
				" 1/4 cup white sugar ",
				" 2 1/4 teaspoons salt ",
				" 1/4 teaspoon black pepper ",
				" 1/4 teaspoon ground cloves "
			]
		},
		{
			"name": "Cheesy Acorn Squash",
			"reviews": "200",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Place squash cut side down in a glass dish. Cook in microwave for 20 minutes on HIGH, until almost tender. In a saucepan over medium heat, melt butter and add celery and onion; saute until transparent. Stir in mushrooms; cook 2 to 3 minutes more. Sprinkle with salt, pepper, and parsley. Divide mixture in half, spoon into the squash and cover. Cook 15 minutes in the preheated 350 degrees F (175 degrees C) oven. Uncover, sprinkle with cheese and put back in the oven until the cheese bubbles.",
			"rating": "4.47470808029175",
			"cook_time": 40,
			"ready_in_time": 55,
			"id": 19354,
			"prep_time": 15,
			"nutrition": [
				"Calories: 413 kcal 21 %",
				"Fat: 27.2 g 42 %",
				"Carbs: 35.8g 12 %",
				"Protein: 11.9 g 24 %",
				"Cholesterol: 75 mg 25 %",
				"Sodium: 504 mg 20 %"
			],
			"comment": "Very tasty squash! Goes best with beef or ham.",
			"cal": 413,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/10431.jpg",
			"ingredients": [
				"1 acorn squash, halved and seeded ",
				" 3 tablespoons butter ",
				" 1 cup diced celery ",
				" 1 cup finely chopped onion ",
				" 1 cup fresh mushrooms, sliced ",
				" 1/8 teaspoon salt ",
				" 1 pinch ground black pepper ",
				" 1 teaspoon chopped parsley ",
				" 1/2 cup shredded Cheddar cheese "
			]
		},
		{
			"name": "Pecan Snack",
			"reviews": "177",
			"directions": "Preheat oven to 250 degrees F (120 degrees C). In a large bowl, beat egg white with water until frothy. Stir in pecans and mix to coat. Combine sugar, cinnamon and salt and stir into pecan mixture. Spread on a baking sheet. Bake in preheated oven 1 hour, stirring every 15 minutes. Store in an airtight container.",
			"rating": "4.88034200668335",
			"cook_time": 60,
			"ready_in_time": 70,
			"id": 19356,
			"prep_time": 10,
			"nutrition": [
				"Calories: 117 kcal 6 %",
				"Fat: 10.2 g 16 %",
				"Carbs: 6.7g 2 %",
				"Protein: 1.4 g 3 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 74 mg 3 %"
			],
			"comment": "These smell like a walk through a county fair, and they taste heavenly!",
			"cal": 117,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/25757.jpg",
			"ingredients": [
				"1 egg white ",
				" 1 tablespoon water ",
				" 1 pound pecans ",
				" 3/4 cup white sugar ",
				" 1 teaspoon ground cinnamon ",
				" 1 teaspoon salt "
			]
		},
		{
			"name": "Roasted Vegetable Medley",
			"reviews": "142",
			"directions": "Preheat oven to 425 degrees F (220 degrees C). Grease 2 baking sheets with 1 tablespoon olive oil. Place the yams, parsnips, and carrots onto the baking sheets. Bake in the preheated oven for 30 minutes, then add the zucchini and asparagus, and drizzle with the remaining 1 tablespoon of olive oil. Continue baking until all of the vegetables are tender, about 30 minutes more. Once tender, remove from the oven, and allow to cool for 30 minutes on the baking sheet. Toss the roasted peppers together with the garlic, basil, salt, and pepper in a large bowl until combined. Add the roasted vegetables, and toss to mix. Serve at room temperature or cold.",
			"rating": "4.61885261535645",
			"cook_time": 60,
			"ready_in_time": 115,
			"id": 19357,
			"prep_time": 25,
			"nutrition": [
				"Calories: 191 kcal 10 %",
				"Fat: 5 g 8 %",
				"Carbs: 34.6g 11 %",
				"Protein: 4 g 8 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 257 mg 10 %"
			],
			"comment": "This colorful dish has the perfect blend of sweet and savory. It is simple to prepare and can be served as a side dish, salad, or light meal. Feel free to substitute whatever veggies and herbs you have on hand.",
			"cal": 191,
			"total_time": 200,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/249686.jpg",
			"ingredients": [
				"2 tablespoons olive oil, divided ",
				" 1 large yam, peeled and cut into 1 inch pieces ",
				" 1 large parsnip, peeled and cut into 1 inch pieces ",
				" 1 cup baby carrots ",
				" 1 zucchini, cut into 1 inch slices ",
				" 1 bunch fresh asparagus, trimmed and cut into 1 inch pieces ",
				" 1/2 cup roasted red peppers, cut into 1-inch pieces ",
				" 2 cloves garlic, minced ",
				" 1/4 cup chopped fresh basil ",
				" 1/2 teaspoon kosher salt ",
				" 1/2 teaspoon ground black pepper "
			]
		},
		{
			"name": "Roasted Yam and Kale Salad",
			"reviews": "181",
			"directions": "Preheat an oven to 400 degrees F (200 degrees C). Toss the yams with 2 tablespoons of olive oil in a bowl. Season to taste with salt and pepper, and arrange evenly onto a baking sheet. Bake in the preheated oven until the yams are tender, 20 to 25 minutes. Cool to room temperature in the refrigerator. Meanwhile, heat the remaining 1 tablespoon of olive oil in a large skillet over medium heat. Cook and stir the onion and garlic until the onion has caramelized to a golden brown, about 15 minutes. Stir in the kale, cooking until wilted and tender. Transfer the kale mixture to a bowl, and cool to room temperature in the refrigerator. Once all the ingredients have cooled, combine the yams, kale, red wine vinegar, and fresh thyme in a bowl. Season to taste with salt and pepper, and gently stir to combine.",
			"rating": "4.65020561218262",
			"cook_time": 20,
			"ready_in_time": 75,
			"id": 19358,
			"prep_time": 20,
			"nutrition": [
				"Calories: 274 kcal 14 %",
				"Fat: 7.5 g 12 %",
				"Carbs: 49.2g 16 %",
				"Protein: 5 g 10 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 46 mg 2 %"
			],
			"comment": "A bright contrast in flavors makes this salad a favorite among friends and family. The yams have a subtle sweetness that pairs nicely with the caramelized onions and kale.",
			"cal": 274,
			"total_time": 115,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/865543.jpg",
			"ingredients": [
				"2 jewel yams, cut into 1-inch cubes ",
				" 2 tablespoons olive oil ",
				" salt and freshly ground black pepper to taste ",
				" 1 tablespoon olive oil ",
				" 1 onion, sliced ",
				" 3 cloves garlic, minced ",
				" 1 bunch kale, torn into bite-sized pieces ",
				" 2 tablespoons red wine vinegar ",
				" 1 teaspoon chopped fresh thyme "
			]
		},
		{
			"name": "Bacon and Date Appetizer",
			"reviews": "211",
			"directions": "Preheat the broiler. Slit dates. Place one almond inside each date. Wrap dates with bacon, using toothpicks to hold them together. Broil 10 minutes, or until bacon is evenly brown and crisp.",
			"rating": "4.64661645889282",
			"cook_time": 5,
			"ready_in_time": 35,
			"id": 19360,
			"prep_time": 30,
			"nutrition": [
				"Calories: 560 kcal 28 %",
				"Fat: 43.7 g 67 %",
				"Carbs: 32.2g 10 %",
				"Protein: 13.7 g 27 %",
				"Cholesterol: 51 mg 17 %",
				"Sodium: 631 mg 25 %"
			],
			"comment": "An easy, quick appetizer that I first tasted at a Native American wedding ceremony. Dates are stuffed with almonds and wrapped in bacon!",
			"cal": 560,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/695887.jpg",
			"ingredients": [
				"1 (8 ounce) package pitted dates ",
				" 4 ounces almonds ",
				" 1 pound sliced bacon "
			]
		},
		{
			"name": "Acorn Squash with Apple",
			"reviews": "214",
			"directions": "To easily peel the acorn squash without losing a lot of vegetable, gently drop the squash in a large pot of boiling water, and boil for 15 minutes. Pour off the boiling water and fill with cold water and let sit 5 minutes to cool. When cool enough to handle, use a knife to slice off the peel on the ridges and use a teaspoon to dig out the peel in the valleys. Slice the squash in half and remove the seeds and stem. Then slice the halves into sections and finally cut into 1 inch chunks. Place the squash chunks into a large microwave-safe bowl along with the apples. Dot with pieces of butter. Sprinkle the brown sugar, walnuts, salt and cinnamon over the top. Cover with plastic wrap, and poke a few holes in it for ventilation. Cook in the microwave for 7 1/2 minutes on full power. Remove, uncover, and stir. Return to the microwave, and cook for another 7 1/2 minutes on full power, until tender. Serve hot.",
			"rating": "4.47079038619995",
			"cook_time": 15,
			"ready_in_time": 35,
			"id": 19361,
			"prep_time": 20,
			"nutrition": [
				"Calories: 98 kcal 5 %",
				"Fat: 2.9 g 4 %",
				"Carbs: 19.2g 6 %",
				"Protein: 1 g 2 %",
				"Cholesterol: 5 mg 2 %",
				"Sodium: 211 mg 8 %"
			],
			"comment": "Peeling an acorn squash is the key to this delicious dish that's cooked in a microwave. A fast and easy delight for busy families.",
			"cal": 98,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/129428.jpg",
			"ingredients": [
				"1 acorn squash ",
				" 2 apples, cored and sliced ",
				" 1 tablespoon butter ",
				" 2 tablespoons brown sugar ",
				" 1 tablespoon finely chopped walnuts ",
				" 1/2 teaspoon salt ",
				" 1/2 teaspoon ground cinnamon "
			]
		},
		{
			"name": "Real Homemade Tamales",
			"reviews": "187",
			"directions": "Place pork into a Dutch oven with onion and garlic, and add water to cover. Bring to a boil, then reduce heat to low and simmer until the meat is cooked through, about 2 hours. Use rubber gloves to remove stems and seeds from the chile pods. Place chiles in a saucepan with 2 cups of water. Simmer, uncovered, for 20 minutes, then remove from heat to cool. Transfer the chiles and water to a blender and blend until smooth. Strain the mixture, stir in salt, and set aside. Shred the cooked meat and mix in one cup of the chile sauce. Soak the corn husks in a bowl of warm water. In a large bowl, beat the lard with a tablespoon of the broth until fluffy. Combine the masa harina, baking powder and salt; stir into the lard mixture, adding more broth as necessary to form a spongy dough. Spread the dough out over the corn husks to 1/4 to 1/2 inch thickness. Place one tablespoon of the meat filling into the center. Fold the sides of the husks in toward the center and place in a steamer. Steam for 1 hour. Remove tamales from husks and drizzle remaining chile sauce over. Top with sour cream. For a creamy sauce, mix sour cream into the chile sauce.",
			"rating": "4.42489290237427",
			"cook_time": 180,
			"ready_in_time": 215,
			"id": 19362,
			"prep_time": 35,
			"nutrition": [
				"Calories: 236 kcal 12 %",
				"Fat: 16.6 g 26 %",
				"Carbs: 12.6g 4 %",
				"Protein: 9.1 g 18 %",
				"Cholesterol: 37 mg 12 %",
				"Sodium: 401 mg 16 %"
			],
			"comment": "I had been looking for a Tamale recipe for years. One day I went to the international market and stood in the Mexican aisle till a woman with a full cart came by. I just asked her if she knew how to make Tamales. This is her recipe with a few additions from me. The pork can be substituted with either chicken or beef. This is great served with refried beans and a salad.",
			"cal": 236,
			"total_time": 430,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/417213.jpg",
			"ingredients": [
				"Tamale Filling: ",
				" 1 1/4 pounds pork loin ",
				" 1 large onion, halved ",
				" 1 clove garlic ",
				" 4 dried California chile pods ",
				" 2 cups water ",
				" 1 1/2 teaspoons salt ",
				" Tamale Dough: ",
				" 2 cups masa harina ",
				" 1 (10.5 ounce) can beef broth ",
				" 1 teaspoon baking powder ",
				" 1/2 teaspoon salt ",
				" 2/3 cup lard ",
				" 1 (8 ounce) package dried corn husks ",
				" 1 cup sour cream "
			]
		},
		{
			"name": "Tiramisu Cheesecake",
			"reviews": "251",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Place a pan of water on the bottom of the oven. Crush the package of ladyfingers to fine crumbs. Mix the melted butter into the crumbs. Moisten with 2 tablespoons of the coffee liqueur. Press into an 8-inch springform pan. In a large bowl, mix cream cheese, mascarpone, and sugar until very smooth. Add 2 tablespoons coffee liqueur, and mix. Add the eggs and the flour; mix slowly just until smooth. Pour batter over crust in the springform pan. Place pan on middle rack of oven. Bake until just set, 40 to 45 minutes. Open oven door, and turn off the heat. Leave cake to cool in oven for 20 minutes. Remove from oven, and let it finish cooling, about 30 minutes. Refrigerate for at least 3 hours, or overnight. Grate semisweet chocolate over the top right before serving.",
			"rating": "4.55128192901611",
			"cook_time": 40,
			"ready_in_time": 300,
			"id": 19363,
			"prep_time": 30,
			"nutrition": [
				"Calories: 528 kcal 26 %",
				"Fat: 36.2 g 56 %",
				"Carbs: 40.2g 13 %",
				"Protein: 10.1 g 20 %",
				"Cholesterol: 188 mg 63 %",
				"Sodium: 256 mg 10 %"
			],
			"comment": "Tiramisu-flavored cheesecake combines the flavors and richness of tiramisu and NY Cheesecake. Just before serving, grate some semisweet chocolate on the top.",
			"cal": 528,
			"total_time": 370,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/514088.jpg",
			"ingredients": [
				"1 (12 ounce) package ladyfingers ",
				" 1/4 cup butter, melted ",
				" 1/4 cup coffee-flavored liqueur, divided ",
				" 3 (8 ounce) packages cream cheese ",
				" 1 (8 ounce) container mascarpone cheese ",
				" 1 cup white sugar ",
				" 2 eggs ",
				" 1/4 cup all-purpose flour ",
				" 1 (1 ounce) square semisweet chocolate "
			]
		},
		{
			"name": "Sausage Brunch Casserole",
			"reviews": "236",
			"directions": "Place sausage in a large, deep skillet. Cook over medium high heat until evenly brown. Drain, crumble and set aside. Preheat oven to 425 degrees F (220 degrees C). Lightly grease a 9x13 inch baking pan. Lay crescent rolls flat in the bottom of the pan. Combine cooked sausage, cheese, eggs, milk, salt and pepper; pour over crescent rolls. Bake in preheated oven for 15 minutes, until bubbly and rolls are baked.",
			"rating": "4.58139514923096",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 19364,
			"prep_time": 15,
			"nutrition": [
				"Calories: 389 kcal 19 %",
				"Fat: 31.8 g 49 %",
				"Carbs: 9.3g 3 %",
				"Protein: 15.1 g 30 %",
				"Cholesterol: 114 mg 38 %",
				"Sodium: 671 mg 27 %"
			],
			"comment": "This is a great breakfast casserole my grandmother and mother always make!",
			"cal": 389,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/4158007.jpg",
			"ingredients": [
				"1 1/2 pounds ground pork sausage ",
				" 1 (8 ounce) package refrigerated crescent roll dough ",
				" 2 cups mozzarella cheese ",
				" 4 eggs, beaten ",
				" 3/4 cup milk ",
				" salt and pepper to taste "
			]
		},
		{
			"name": "Banana Crepes",
			"reviews": "233",
			"directions": "Sift flour and powdered sugar into a mixing bowl. Add eggs, milk, butter, vanilla, and salt; beat until smooth. Heat a lightly greased 6 inch skillet. Add about 3 tablespoons batter. Tilt skillet so that batter spreads to almost cover the bottom of skillet. Cook until lightly browned; turn and brown the other side. Repeat process with remaining batter, grease skillet as needed. Melt 1/4 cup butter in a large skillet. Stir in brown sugar, 1/4 teaspoon cinnamon and nutmeg. Stir in cream and cook until slightly thickened. Add half the bananas at a time to skillet; cook for 2 to 3 minutes, spooning sauce over them. Remove from heat. Roll a crepe around each banana half and place on serving platter. Spoon sauce over crepes. Top with whipped cream and a pinch of cinnamon.",
			"rating": "4.62300300598145",
			"cook_time": 15,
			"ready_in_time": 20,
			"id": 19365,
			"prep_time": 5,
			"nutrition": [
				"Calories: 518 kcal 26 %",
				"Fat: 28.7 g 44 %",
				"Carbs: 60.7g 20 %",
				"Protein: 8 g 16 %",
				"Cholesterol: 146 mg 49 %",
				"Sodium: 252 mg 10 %"
			],
			"comment": "French crepes filled with a sweet cream sauce over bananas and topped with whipped cream.",
			"cal": 518,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/5441.jpg",
			"ingredients": [
				"1 cup all-purpose flour ",
				" 1/4 cup confectioners' sugar ",
				" 2 eggs ",
				" 1 cup milk ",
				" 3 tablespoons butter, melted ",
				" 1 teaspoon vanilla extract ",
				" 1/4 teaspoon salt ",
				" 1/4 cup butter ",
				" 1/4 cup packed brown sugar ",
				" 1/4 teaspoon ground cinnamon ",
				" 1/4 teaspoon ground nutmeg ",
				" 1/4 cup half-and-half cream ",
				" 6 bananas, halved lengthwise ",
				" 1 1/2 cups whipped heavy cream ",
				" 1 pinch ground cinnamon "
			]
		},
		{
			"name": "Stewed Cabbage",
			"reviews": "216",
			"directions": "Melt butter in a large saucepan over medium heat. Add onion, celery, and garlic and saute for 3 to 5 minutes, or until translucent. Stir in cabbage, reduce heat to low, and simmer for 15 minutes. Pour in tomatoes and season with salt and pepper to taste. Cover pan and cook over medium heat for 30 to 40 minutes, or until cabbage is tender.",
			"rating": "4.49275350570679",
			"cook_time": 40,
			"ready_in_time": 55,
			"id": 19366,
			"prep_time": 15,
			"nutrition": [
				"Calories: 200 kcal 10 %",
				"Fat: 11.9 g 18 %",
				"Carbs: 23.1g 7 %",
				"Protein: 4.4 g 9 %",
				"Cholesterol: 31 mg 10 %",
				"Sodium: 331 mg 13 %"
			],
			"comment": "This is a family favorite that my mother-in-law fixed for me while I was visiting her home last year. Serve over white rice, if desired.",
			"cal": 200,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/126189.jpg",
			"ingredients": [
				"1/4 cup butter ",
				" 2 onions, chopped ",
				" 1 stalk celery, chopped ",
				" 2 cloves garlic, chopped ",
				" 1 medium head cabbage, cut into squares ",
				" 1 (14.5 ounce) can stewed tomatoes, with liquid ",
				" salt and pepper to taste "
			]
		},
		{
			"name": "Vintage Lemonade",
			"reviews": "203",
			"directions": "Peel the rinds from the 5 lemons and cut them into 1/2 inch slices. Set the lemons aside. Place the rinds in a bowl and sprinkle the sugar over them. Let this stand for about one hour, so that the sugar begins to soak up the oils from the lemons. Bring water to a boil in a covered saucepan and then pour the hot water over the sugared lemon rinds. Allow this mixture to cool for 20 minutes and then remove the rinds. Squeeze the lemons into another bowl. Pour the juice through a strainer into the sugar mixture. Stir well, pour into pitcher and pop it in the fridge! Serve with ice cubes.",
			"rating": "4.62692308425903",
			"cook_time": 20,
			"ready_in_time": 65,
			"id": 19367,
			"prep_time": 45,
			"nutrition": [
				"Calories: 269 kcal 13 %",
				"Fat: 0.4 g < 1 %",
				"Carbs: 76.9g 25 %",
				"Protein: 1.6 g 3 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 13 mg < 1 %"
			],
			"comment": "In the 1800's this is how people made lemonade--you can do it too! It's not that difficult, and tastes wonderful!",
			"cal": 269,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/445154.jpg",
			"ingredients": [
				"5 lemons ",
				" 1 1/4 cups white sugar ",
				" 1 1/4 quarts water "
			]
		},
		{
			"name": "Make Ahead Breakfast Casserole",
			"reviews": "231",
			"directions": "Spread croutons on bottom of greased 9x13 inch baking dish. Crumble sausage into medium skillet. Cook over medium heat until browned, stirring occasionally. Drain off any drippings. Spread sausage over croutons. In a large bowl, whisk together eggs and milk until well blended. Stir in soup, spinach, mushrooms, cheeses and mustard. Pour egg mixture over sausage and croutons. Refrigerate overnight. The next morning, preheat oven to 325 degrees F (165 degrees C). Bake in preheated oven for 50 to 55 minutes or until set and lightly browned on top. Garnish with parsley sprigs and serve hot.",
			"rating": "4.56774187088013",
			"cook_time": 55,
			"ready_in_time": 80,
			"id": 19368,
			"prep_time": 25,
			"nutrition": [
				"Calories: 419 kcal 21 %",
				"Fat: 32.4 g 50 %",
				"Carbs: 14g 5 %",
				"Protein: 18.2 g 36 %",
				"Cholesterol: 132 mg 44 %",
				"Sodium: 882 mg 35 %"
			],
			"comment": "Mmm mmm good! This is a must do for every holiday in my household, or just when you have guests overnight! Can be made with egg substitute, skim milk and turkey sausage to make it healthier!",
			"cal": 419,
			"total_time": 160,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/595622.jpg",
			"ingredients": [
				"2 1/2 cups seasoned croutons ",
				" 1 pound spicy pork sausage ",
				" 4 eggs ",
				" 2 1/4 cups milk ",
				" 1 (10.75 ounce) can condensed cream of mushroom soup ",
				" 1 (10 ounce) package frozen chopped spinach - thawed, drained and squeezed dry ",
				" 1 (4.5 ounce) can mushrooms, drained and chopped ",
				" 1 cup shredded sharp Cheddar cheese ",
				" 1 cup shredded Monterey Jack cheese ",
				" 1/4 teaspoon dry mustard ",
				" 2 sprigs fresh parsley, for garnish "
			]
		},
		{
			"name": "Southern Candied Sweet Potatoes",
			"reviews": "221",
			"directions": "In a small bowl, mix the sugar, cinnamon, nutmeg, and salt together. Melt butter in a large skillet over medium heat; add sweet potatoes, and stir to coat. Sprinkle sugar mixture over the sweet potatoes, and stir. Cover skillet, and reduce heat to low. Cook, stirring occasionally, for 1 hour, or until the sauce is dark and the potatoes are candied. They should be tender, but a little hard around the edges. Stir in vanilla, and serve.",
			"rating": "4.72664356231689",
			"cook_time": 70,
			"ready_in_time": 85,
			"id": 19369,
			"prep_time": 15,
			"nutrition": [
				"Calories: 386 kcal 19 %",
				"Fat: 11.7 g 18 %",
				"Carbs: 70.2g 23 %",
				"Protein: 1.7 g 3 %",
				"Cholesterol: 31 mg 10 %",
				"Sodium: 155 mg 6 %"
			],
			"comment": "Traditional sweet potato recipe. It is usually served as a side dish.",
			"cal": 386,
			"total_time": 170,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/209245.jpg",
			"ingredients": [
				"2 cups white sugar ",
				" 1 teaspoon ground cinnamon ",
				" 1 teaspoon ground nutmeg ",
				" 1 pinch salt ",
				" 1/2 cup butter ",
				" 6 sweet potatoes, peeled and sliced ",
				" 1 tablespoon vanilla extract "
			]
		},
		{
			"name": "Zippy Egg Casserole",
			"reviews": "173",
			"directions": "Place sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside. In a lightly greased 9x13 inch baking dish, arrange the croutons in a single layer. Layer with Cheddar cheese, Swiss cheese, and pepperjack cheese. Top with the cooked sausage. In a large bowl, beat together the eggs, half-and-half, milk, mustard, onion, salt, and pepper. Pour into the dish over the sausage. Cover, and refrigerate overnight. The next morning, bake in an oven preheated to 350 degrees F (175 degrees C) for 45 to 60 minutes. Let sit for 20 minutes before serving.",
			"rating": "4.6834864616394",
			"cook_time": 70,
			"ready_in_time": 585,
			"id": 19370,
			"prep_time": 15,
			"nutrition": [
				"Calories: 416 kcal 21 %",
				"Fat: 30.6 g 47 %",
				"Carbs: 13.3g 4 %",
				"Protein: 21.5 g 43 %",
				"Cholesterol: 201 mg 67 %",
				"Sodium: 846 mg 34 %"
			],
			"comment": "This egg casserole has a little zip to it due to the pepperjack cheese! A big hit at church brunches",
			"cal": 416,
			"total_time": 670,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/387740.jpg",
			"ingredients": [
				"1 pound pork sausage ",
				" 1 (5.5 ounce) package seasoned croutons ",
				" 1 1/2 cups shredded Cheddar cheese ",
				" 1 cup shredded Swiss cheese ",
				" 1 cup shredded pepperjack cheese ",
				" 8 eggs ",
				" 1 pint half-and-half cream ",
				" 1 1/2 cups milk ",
				" 1 1/2 teaspoons dry mustard ",
				" 1 tablespoon minced onion ",
				" salt and pepper to taste "
			]
		},
		{
			"name": "Pork Roast with Sauerkraut and Kielbasa",
			"reviews": "145",
			"directions": "Preheat the oven broiler. Place the roast in a roasting pan, brush with olive oil, sprinkle with thyme leaves, and season with salt and pepper. Place under the broiler for 10 minutes, until lightly browned in several places. Place 2 pounds sauerkraut in a slow cooker. Arrange kielbasa pieces around the edges of the slow cooker pot, and place the roast in the center. Cover with remaining sauerkraut. Cover slow cooker, and cook roast 6 hours on High.",
			"rating": "4.52406406402588",
			"cook_time": 370,
			"ready_in_time": 385,
			"id": 19372,
			"prep_time": 15,
			"nutrition": [
				"Calories: 229 kcal 11 %",
				"Fat: 15.7 g 24 %",
				"Carbs: 7.6g 2 %",
				"Protein: 14.8 g 30 %",
				"Cholesterol: 52 mg 17 %",
				"Sodium: 1358 mg 54 %"
			],
			"comment": "This is the traditional New Year's Day meal I learned from my husband, whose family originated in central Pennsylvania. It's wonderful, especially served with mashed potatoes and applesauce.",
			"cal": 229,
			"total_time": 770,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/162552.jpg",
			"ingredients": [
				"1 (2 pound) boneless pork loin roast ",
				" 2 tablespoons olive oil ",
				" 2 sprigs fresh thyme leaves ",
				" salt and pepper to taste ",
				" 4 pounds sauerkraut ",
				" 1 pound kielbasa, cut into 3-inch pieces "
			]
		},
		{
			"name": "New Year's Day Black-Eyed Peas",
			"reviews": "174",
			"directions": "Place black-eyed peas in 8 quart pot. Add enough water to fill pot 3/4 full. Stir in ham and diced onions, and season with salt, pepper, and garlic powder. Place tomatoes in a blender or food processor, and blend until the tomatoes are liquefied. Add tomatoes to pot. Bring all ingredients to boil. Cover the pot, and simmer on low heat for 2 1/2 to 3 hours, or until the peas are tender.",
			"rating": "4.355140209198",
			"cook_time": 180,
			"ready_in_time": 195,
			"id": 19374,
			"prep_time": 15,
			"nutrition": [
				"Calories: 120 kcal 6 %",
				"Fat: 3.4 g 5 %",
				"Carbs: 16.8g 5 %",
				"Protein: 5.7 g 11 %",
				"Cholesterol: 9 mg 3 %",
				"Sodium: 281 mg 11 %"
			],
			"comment": "Remember, black-eyed peas on New Year's Day brings good luck for the entire year!",
			"cal": 120,
			"total_time": 390,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3062070.jpg",
			"ingredients": [
				"1 pound dry black-eyed peas ",
				" 2 cups chopped cooked ham ",
				" salt and pepper to taste ",
				" 1 pinch garlic powder ",
				" 2 onions, diced ",
				" 1 (14.5 ounce) can whole tomatoes "
			]
		},
		{
			"name": "Broccoli and Cheese Brunch Casserole",
			"reviews": "140",
			"directions": "Place sausage in a large, deep skillet. Cook over medium-high heat until evenly brown. Drain, crumble, and set aside. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 7x11 inch baking dish. In a bowl, mix cooked sausage, broccoli, and 1/2 cup Cheddar cheese. In a separate bowl, mix 1/2 cup Cheddar cheese, ricotta cheese, eggs, milk, pepper, and salt. Spoon the sausage mixture into the prepared baking dish. Spread the Cheddar and ricotta mixture over the sausage mixture. Sprinkle with remaining Cheddar. Arrange tomato slices on top. Cover with aluminum foil, and bake 30 minutes in the preheated oven. Uncover, and bake for an additional 15 minutes. Let stand for 10 minutes before serving.",
			"rating": "4.53488349914551",
			"cook_time": 55,
			"ready_in_time": 80,
			"id": 19375,
			"prep_time": 15,
			"nutrition": [
				"Calories: 286 kcal 14 %",
				"Fat: 20.7 g 32 %",
				"Carbs: 5g 2 %",
				"Protein: 20.2 g 40 %",
				"Cholesterol: 234 mg 78 %",
				"Sodium: 648 mg 26 %"
			],
			"comment": "Delicious for a brunch or weekend breakfast",
			"cal": 286,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/55184.jpg",
			"ingredients": [
				"8 ounces pork sausage ",
				" 1 (10 ounce) package chopped frozen broccoli, thawed and drained ",
				" 1 1/2 cups shredded Cheddar cheese, divided ",
				" 1 cup ricotta cheese ",
				" 8 eggs, lightly beaten ",
				" 1/4 cup milk ",
				" 1 teaspoon ground black pepper ",
				" 1/2 teaspoon salt ",
				" 1 roma (plum) tomato, thinly sliced "
			]
		},
		{
			"name": "Slow Cooker Lancaster County Pork and Sauerkraut",
			"reviews": "175",
			"directions": "Cut pork loin, if necessary, to fit in the slow cooker. Season with caraway seeds, and salt and pepper to taste. Pour sauerkraut over the roast. Cook on High for 1 hour, then cook on Low for 5 to 6 hours. Internal temperature of the roast should be at least 145 degrees F (63 degrees C).",
			"rating": "4.4330358505249",
			"cook_time": 360,
			"ready_in_time": 380,
			"id": 19376,
			"prep_time": 20,
			"nutrition": [
				"Calories: 245 kcal 12 %",
				"Fat: 8.5 g 13 %",
				"Carbs: 3.5g 1 %",
				"Protein: 36.8 g 74 %",
				"Cholesterol: 105 mg 35 %",
				"Sodium: 582 mg 23 %"
			],
			"comment": "Old fashioned pork and sauerkraut that is served here on New Year's Day for luck! Serve with mashed potatoes, and apple sauce for dipping the pork in.",
			"cal": 245,
			"total_time": 760,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2617627.jpg",
			"ingredients": [
				"1 (4 pound) pork loin roast ",
				" 1 teaspoon caraway seeds ",
				" salt and pepper to taste ",
				" 2 cups sauerkraut with liquid "
			]
		},
		{
			"name": "Hoppin' John",
			"reviews": "171",
			"directions": "In a large pan place the peas, ham hock, onion, red pepper, salt and pepper. Cover with water and bring to a boil. Reduce heat to medium-low and cook for 1 1/2 hours. Remove ham hock and cut meat into pieces. Return meat to pot. Stir in the rice, cover and cook until rice is tender, about 20 to 25 minutes. Season to taste with salt and pepper. Sprinkle shredded cheese over top, if desired. Serve",
			"rating": "4.25116300582886",
			"cook_time": 120,
			"ready_in_time": 135,
			"id": 19377,
			"prep_time": 15,
			"nutrition": [
				"Calories: 475 kcal 24 %",
				"Fat: 9.3 g 14 %",
				"Carbs: 64.1g 21 %",
				"Protein: 33.6 g 67 %",
				"Cholesterol: 61 mg 20 %",
				"Sodium: 619 mg 25 %"
			],
			"comment": "I eat this dish every New Year's day, it's supposed to bring you luck, and so far my life's been pretty good. It's also good anytime you need a hearty homey meal!",
			"cal": 475,
			"total_time": 270,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/402664.jpg",
			"ingredients": [
				"1 1/2 cups dry black-eyed peas ",
				" 1 pound ham hocks ",
				" 1 onion, chopped ",
				" 1/2 teaspoon crushed red pepper flakes ",
				" salt and pepper to taste ",
				" 4 cups water ",
				" 1 1/2 cups long-grain white rice ",
				" 1 cup shredded smoked Cheddar cheese "
			]
		},
		{
			"name": "Blue Cheese and Pear Tartlets",
			"reviews": "134",
			"directions": "Pre-bake phyllo shells according to package directions. Set aside to cool. Mix together blue cheese, pear, and cream. Season to taste with pepper. Spoon mixture into cooled shells. Bake at 350 degrees F (175 degrees C) for 15 minutes. Serve warm.",
			"rating": "4.07303380966187",
			"cook_time": 25,
			"ready_in_time": 35,
			"id": 19380,
			"prep_time": 10,
			"nutrition": [
				"Calories: 60 kcal 3 %",
				"Fat: 3.6 g 5 %",
				"Carbs: 4.5g 1 %",
				"Protein: 2.2 g 4 %",
				"Cholesterol: 7 mg 2 %",
				"Sodium: 116 mg 5 %"
			],
			"comment": "Tasty, hot appetizers that take little time to prepare but will impress your guests!",
			"cal": 60,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/691320.jpg",
			"ingredients": [
				"4 ounces blue cheese, crumbled ",
				" 1 ripe pear - peeled, cored, and chopped ",
				" 2 tablespoons light cream ",
				" ground black pepper to taste ",
				" 1 (2.1 ounce) package mini phyllo tart shells "
			]
		},
		{
			"name": "Costas French Market Doughnuts (Beignets)",
			"reviews": "174",
			"directions": "Pour 1/2 cup room temperature water into a small bowl. Sprinkle the yeast over the water and let stand for about 5 minutes to dissolve. Combine the shortening, sugar, and salt in a large bowl. Pour the boiling water over the shortening mixture and then stir in the evaporated milk. Wait for the mixture to cool down until it is lukewarm. Then, add the yeast and water mixture and beaten eggs. Slowly mix in the flour until the dough forms a ball. Cover the dough with plastic wrap and refrigerate for 30 minutes to 1 hour. Working with a small portion (a little larger than a baseball) at a time, roll out the dough 1/8-inch thick. Cut the rolled out dough into strips 2 to 3-inches wide, then cut again in the opposite direction and at an angle, making diamond shapes. Heat your oil for frying in a deep and wide, heavy-bottomed skillet over medium-high heat to 360 degree F (180 degrees C). Slide dough slowly into the oil to avoid splattering and deep fry until they puff up and are golden brown, 3 to 5 minutes. Carefully remove onto a rack with paper towels underneath and allow to cool until you can handle them. Place in a clean paper bag with confectioners' sugar and shake gently until covered generously or, use a sifter to dust the beignets with powdered sugar.",
			"rating": "4.58986186981201",
			"cook_time": 30,
			"ready_in_time": 90,
			"id": 19382,
			"prep_time": 30,
			"nutrition": [
				"Calories: 503 kcal 25 %",
				"Fat: 14.8 g 23 %",
				"Carbs: 80.9g 26 %",
				"Protein: 10.9 g 22 %",
				"Cholesterol: 37 mg 12 %",
				"Sodium: 231 mg 9 %"
			],
			"comment": "As kids, we always put in a heart-filled request for these on Christmas Eve. It was quite a family affair - my mom would make up the dough, my dad would roll them out and cut them and then after frying them up, us kids would take turns shaking them in a paper bag with powdered sugar! I finally got to go to New Orleans and I was excited to get to try 'the real thing' at the famous Cafe Du Monde...I was SO HAPPY because my husband and I both said our recipe was a near carbon copy of CAFE DU MONDE! We've made this recipe for over 40 years and I promise it won't disappoint!",
			"cal": 503,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/93991.jpg",
			"ingredients": [
				"1/2 cup water ",
				" 1 tablespoon yeast ",
				" 1/4 cup shortening ",
				" 1/2 cup sugar ",
				" 1 teaspoon salt ",
				" 1 cup boiling water ",
				" 1 cup evaporated milk ",
				" 2 eggs, beaten ",
				" 7 1/2 cups flour ",
				" 1 quart vegetable oil for frying ",
				" 1 cup confectioners' sugar for dusting "
			]
		},
		{
			"name": "Quick Hoppin' John Soup",
			"reviews": "180",
			"directions": "Crumble sausage into a skillet over medium heat and cook until evenly brown. In a large pot, mix the cooked sausage, rice mix with seasoning packet, black-eyed peas, tomatoes, broth and water. Bring to a boil. Reduce heat to low, cover and simmer 20 minutes, or until rice is tender. Season to taste with salt.",
			"rating": "4.68493127822876",
			"cook_time": 25,
			"ready_in_time": 35,
			"id": 19383,
			"prep_time": 10,
			"nutrition": [
				"Calories: 307 kcal 15 %",
				"Fat: 13.2 g 20 %",
				"Carbs: 29.8g 10 %",
				"Protein: 16.1 g 32 %",
				"Cholesterol: 35 mg 12 %",
				"Sodium: 1451 mg 58 %"
			],
			"comment": "This is a modification of my father's hoppin' john recipe. The only difference between his and mine is the use of tomatoes. It's a great recipe for the holidays (New Year's) or any time during winter months. There are many versions of this recipe here, but this one is quick so you can throw it together after a long day at work for the whole family to enjoy!",
			"cal": 307,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/763125.jpg",
			"ingredients": [
				"1 pound sage pork sausage ",
				" 1 (6 ounce) package uncooked long grain and wild rice mix, with seasoning packet ",
				" 2 (15 ounce) cans black-eyed peas, drained ",
				" 2 (14.5 ounce) cans diced tomatoes, with liquid ",
				" 2 (14 ounce) cans chicken broth ",
				" 2 cups water ",
				" salt to taste "
			]
		},
		{
			"name": "Blue Bacon Stuffed Mushrooms",
			"reviews": "137",
			"directions": "Cook bacon strips in a large skillet over medium heat until crispy; drain on paper towels. While the bacon is cooking, remove stems from mushrooms. Set caps aside, and chop stems. Add butter to skillet with bacon grease. When melted, stir in mushroom stems, onion, and garlic. Cook, stirring frequently until the onions caramelize, 15 to 20 minutes. Preheat oven to 350 degrees F (175 degrees C). Spray a small baking dish with cooking spray. Once the onion mixture has reached a deep, rich brown color, place into a blender along with bacon, cream cheese, blue cheese, and bread crumbs. Blend on low until ingredients are roughly chopped and evenly combined. Stuff cheese mixture into mushroom caps and place into prepared baking dish. Bake in preheated oven until bubbly and lightly browned, 10 to 15 minutes.",
			"rating": "4.61016941070557",
			"cook_time": 33,
			"ready_in_time": 38,
			"id": 19385,
			"prep_time": 5,
			"nutrition": [
				"Calories: 348 kcal 17 %",
				"Fat: 26.6 g 41 %",
				"Carbs: 13.4g 4 %",
				"Protein: 14.7 g 29 %",
				"Cholesterol: 73 mg 24 %",
				"Sodium: 814 mg 33 %"
			],
			"comment": "Mushrooms stuffed with blue cheese, bacon, caramelized onions and garlic make a delicious appetizer!",
			"cal": 348,
			"total_time": 76,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/199114.jpg",
			"ingredients": [
				"3 strips bacon ",
				" 6 large mushrooms ",
				" 1 tablespoon butter ",
				" 1/2 onion, diced ",
				" 1 clove garlic, sliced ",
				" 3 ounces cream cheese ",
				" 3 ounces blue cheese ",
				" 1/3 cup bread crumbs "
			]
		},
		{
			"name": "Eggless Sweet Potato Casserole",
			"reviews": "144",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Grease one 2 quart casserole dish and set aside. Blend together the sweet potatoes, evaporated milk, orange juice, vanilla, sugar, salt, 3 tablespoons butter, nutmeg and cinnamon. Pour into prepared casserole dish. Prepare the topping by mixing together the 1/3 cup butter, brown sugar, flour and pecans. Sprinkle over casserole and bake for 45 minutes or until hot.",
			"rating": "4.75568199157715",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 19389,
			"prep_time": 15,
			"nutrition": [
				"Calories: 577 kcal 29 %",
				"Fat: 26.9 g 41 %",
				"Carbs: 82.1g 26 %",
				"Protein: 5.4 g 11 %",
				"Cholesterol: 45 mg 15 %",
				"Sodium: 398 mg 16 %"
			],
			"comment": "This sweet potato casserole is topped with brown sugar and pecans. A family favorite!",
			"cal": 577,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/4216357.jpg",
			"ingredients": [
				"6 sweet potato -- cooked, peeled and mashed ",
				" 1/4 cup evaporated milk ",
				" 1/4 cup orange juice ",
				" 1 teaspoon vanilla extract ",
				" 1/2 cup white sugar ",
				" 1/2 teaspoon salt ",
				" 3 tablespoons butter, melted ",
				" 1/2 teaspoon ground nutmeg ",
				" 1/2 teaspoon ground cinnamon ",
				" 1/3 cup butter, melted ",
				" 3/4 cup packed brown sugar ",
				" 1/2 cup all-purpose flour ",
				" 3/4 cup chopped pecans "
			]
		},
		{
			"name": "Dawn's Easy Red Velvet Sandwich Cookies",
			"reviews": "112",
			"directions": "Preheat the oven to 375 degrees F (190 degrees C). Mix together cake mix, eggs, oil, and bourbon in a large bowl. Roll the dough into balls the size of walnuts. Place 2 inches apart on ungreased baking sheets. Bake in the preheated oven until the tops start to crack, about 8 minutes. Cool in the pans for 10 minutes before removing to cool completely on a wire rack. In a large bowl combine cream cheese, butter, evaporated milk, vanilla, and coconut. Add the confectioners' sugar 1 cup at a time, mixing well with each addition. If consistency is too stiff, add more milk. Place the chopped pecans in a bowl. Spread a generous amount of icing on the bottom of a cookie, sandwich it with another cookie, pressing firmly so that the icing comes all the way out to the edge. Roll the edges of the sandwich cookies in the chopped pecans. Repeat with the remaining cookies.",
			"rating": "4.40259742736816",
			"cook_time": 8,
			"ready_in_time": 33,
			"id": 19390,
			"prep_time": 25,
			"nutrition": [
				"Calories: 292 kcal 15 %",
				"Fat: 14.3 g 22 %",
				"Carbs: 39.9g 13 %",
				"Protein: 2.5 g 5 %",
				"Cholesterol: 29 mg 10 %",
				"Sodium: 182 mg 7 %"
			],
			"comment": "As a Southern girl, I love baking from scratch and red velvet cakes are a must for the holidays. I usually make one every Christmas, especially one for my brother-in-law David. This year was so busy, I just didn't have time to make him one, but I am always making cake mix cookies for my girls as a quick snack in the afternoons after school, so I whipped up a batch of these gems for him for Christmas. They are out of this world! You don't just have to make them for holidays they are wonderful anytime, see for your self.",
			"cal": 292,
			"total_time": 66,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/577495.jpg",
			"ingredients": [
				"1 (18.25 ounce) box red velvet cake mix ",
				" 2 eggs, lightly beaten ",
				" 1/2 cup vegetable oil ",
				" 1 tablespoon bourbon ",
				" Icing ",
				" 1 (8 ounce) package cream cheese, softened ",
				" 1/4 cup butter, softened ",
				" 2 teaspoons evaporated milk ",
				" 1 teaspoon vanilla ",
				" 1/2 cup flaked coconut ",
				" 4 cups confectioners' sugar ",
				" 1/2 cup chopped pecans "
			]
		},
		{
			"name": "Sweet, Salty, Spicy Party Nuts",
			"reviews": "134",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Line a baking sheet with aluminum foil and lightly coat with cooking spray. Combine walnut halves, pecan halves, almonds, and cashews in a large bowl. Add salt, black pepper, cumin, and cayenne pepper; toss to coat. Heat sugar, water, and butter in a small saucepan over medium heat until the butter is melted. Cook for 1 minute and remove from heat. Slowly pour butter mixture over the bowl of nuts and stir to coat. Transfer nuts to the prepared baking sheet and spread into a single layer. Bake nuts in the preheated oven for 10 minutes. Stir nuts until the warm syrup coats every nut. Spread into a single layer, return to the oven, and bake until nuts are sticky and roasted, about 6 minutes. Allow to cool before serving.",
			"rating": "4.77070045471191",
			"cook_time": 17,
			"ready_in_time": 27,
			"id": 19391,
			"prep_time": 10,
			"nutrition": [
				"Calories: 219 kcal 11 %",
				"Fat: 18.1 g 28 %",
				"Carbs: 12.7g 4 %",
				"Protein: 4.8 g 10 %",
				"Cholesterol: 2 mg < 1 %",
				"Sodium: 206 mg 8 %"
			],
			"comment": "I find this technique much easier than the stovetop pan method. You'll get beautiful, perfectly frosted nuts that are roasted evenly, with no bitter burned spots.",
			"cal": 219,
			"total_time": 54,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1082000.jpg",
			"ingredients": [
				"Cooking spray ",
				" 1 cup untoasted walnut halves ",
				" 1 cup untoasted pecan halves ",
				" 1 cup unsalted, dry roasted almonds ",
				" 1 cup unsalted, dry roasted cashews ",
				" 1 teaspoon salt ",
				" 1/2 teaspoon freshly ground black pepper ",
				" 1/4 teaspoon ground cumin ",
				" 1/4 teaspoon cayenne pepper ",
				" 1/2 cup white sugar ",
				" 1/4 cup water ",
				" 1 tablespoon butter "
			]
		},
		{
			"name": "Baked Acorn Squash",
			"reviews": "99",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Place squash in a shallow baking pan, cut side down. Bake in preheated oven for 30 minutes, or until tender. Turn cut side up; season with salt and pepper, dot with butter and sprinkle with brown sugar and cinnamon. Bake for 20 minutes more.",
			"rating": "4.42957735061646",
			"cook_time": 60,
			"ready_in_time": 70,
			"id": 19392,
			"prep_time": 10,
			"nutrition": [
				"Calories: 320 kcal 16 %",
				"Fat: 11.9 g 18 %",
				"Carbs: 56.7g 18 %",
				"Protein: 3 g 6 %",
				"Cholesterol: 31 mg 10 %",
				"Sodium: 97 mg 4 %"
			],
			"comment": "This is a very easy and yummy vegetable side dish to make!!",
			"cal": 320,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/476555.jpg",
			"ingredients": [
				"2 acorn squash, halved and seeded ",
				" salt and pepper to taste ",
				" 1/4 cup butter, diced ",
				" 6 tablespoons firmly packed brown sugar ",
				" 1/2 teaspoon ground cinnamon "
			]
		},
		{
			"name": "Movie Star Popcorn",
			"reviews": "141",
			"directions": "Heat the oil in a 2 to 3 quart saucepan or pot with a lid set over medium-high heat. Pour in popcorn kernels and sprinkle enough salt to lightly cover the layer of kernels. Remember, you can always add more salt later. Add the butter to the pot and cover with the lid. As soon as the kernels start to pop, shake the pan back and forth across the burner constantly until the popping slows down. As soon as the pops are about 2 seconds apart, remove from the heat and pour into a serving bowl. Taste, and season with additional salt if desired.",
			"rating": "4.6369047164917",
			"cook_time": 5,
			"ready_in_time": 10,
			"id": 19395,
			"prep_time": 5,
			"nutrition": [
				"Calories: 187 kcal 9 %",
				"Fat: 13.7 g 21 %",
				"Carbs: 14.8g 5 %",
				"Protein: 2.5 g 5 %",
				"Cholesterol: 12 mg 4 %",
				"Sodium: 266 mg 11 %"
			],
			"comment": "With all of the artificial ingredients and disregard of our health in the store-bought microwave popcorn, I've been making homemade popcorn every weekend the old-fashioned way. I like to use peanut oil due to its high smoke point, but if you have allergies, then substitute vegetable oil.",
			"cal": 187,
			"total_time": 20,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1106512.jpg",
			"ingredients": [
				"3 tablespoons peanut oil ",
				" 2 tablespoons butter ",
				" 1/2 cup unpopped popcorn ",
				" 1/2 teaspoon salt "
			]
		},
		{
			"name": "Sweet Potato and Apple Casserole",
			"reviews": "117",
			"directions": "Place sweet potatoes in a large saucepan with enough water to cover. Bring to a boil and cook 25 minutes, or until tender but firm. Drain, cool and cut into 1/4 inch slices. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 7x11 inch baking dish. In a small bowl, mix brown sugar, cinnamon and nutmeg. Layer sweet potatoes, brown sugar mixture and apples in the prepared baking dish. In a medium bowl, mix flour, brown sugar, butter and pecans. Sprinkle over the sweet potatoes. Bake in the preheated oven 30 minutes, or until lightly browned.",
			"rating": "4.59872627258301",
			"cook_time": 55,
			"ready_in_time": 75,
			"id": 19396,
			"prep_time": 20,
			"nutrition": [
				"Calories: 239 kcal 12 %",
				"Fat: 8.5 g 13 %",
				"Carbs: 41.2g 13 %",
				"Protein: 1.7 g 3 %",
				"Cholesterol: 15 mg 5 %",
				"Sodium: 74 mg 3 %"
			],
			"comment": "This wonderful sweet potato recipe tastes like a dessert. It's always a favorite. ",
			"cal": 239,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/4205262.jpg",
			"ingredients": [
				"3 sweet potatoes, peeled and quartered ",
				" 1/2 cup firmly packed brown sugar ",
				" 1 teaspoon ground cinnamon ",
				" 1 teaspoon ground nutmeg ",
				" 2 large cooking apples - peeled, cored and cut into 1/4 inch rings ",
				" 1/4 cup all-purpose flour ",
				" 1/4 cup firmly packed brown sugar ",
				" 1/4 cup butter ",
				" 1/4 cup chopped pecans "
			]
		},
		{
			"name": "Pear Honey",
			"reviews": "123",
			"directions": "Place chopped pears into a large pot, and pour pineapple juice over them to prevent them from browning. Stir in sugar, and bring to a boil over medium-high heat. Stir frequently to prevent scorching. When the pears are at a full boil, reduce heat to medium, and cook until the mixture is the color and texture of honey. The longer you cook it, the thicker it gets. Cooking time is usually 2 to 3 hours. Ladle into hot sterile jars, filling to within 1/4 inch of the top. Wipe rims with a clean damp cloth, and seal jars with lids and rings. Process in a boiling water canner for 10 minutes, or the amount of time recommended by your local extension for your area.",
			"rating": "4.53521108627319",
			"cook_time": 180,
			"ready_in_time": 225,
			"id": 19399,
			"prep_time": 45,
			"nutrition": [
				"Calories: 111 kcal 6 %",
				"Fat: 0 g < 1 %",
				"Carbs: 28.7g 9 %",
				"Protein: 0.1 g < 1 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: < 1 mg < 1 %"
			],
			"comment": "This tastes so much like honey, your friends will never believe that the bees did not make it. Great on hot biscuits and to give as gifts. This was my grandmother's recipe that she made every fall. Hope you love it!",
			"cal": 111,
			"total_time": 450,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2529923.jpg",
			"ingredients": [
				"8 cups peeled, cored and chopped pears ",
				" 1 cup unsweetened pineapple juice ",
				" 8 cups white sugar "
			]
		},
		{
			"name": "Irish Cream Creme Brulee",
			"reviews": "125",
			"directions": "Preheat oven to 300 degrees F (150 degrees C). Place 6 ramekins on a towel set in a roasting pan at least 3 inches deep. Stir together cream and sugar in a saucepan over medium heat, and cook until very hot, stirring until the sugar dissolves. Whisk together egg yolks, vanilla, and Irish cream until combined. Slowly add 1/3 of the hot cream, whisking it in 2 tablespoons at a time until incorporated. Once you have incorporated 1/3 of the cream, you can stir in the remaining hot cream without fear of the mixture curdling. Pour custard into the ramekins, then fill roasting pan with boiling hot water to come halfway up the sides of the ramekins. Bake in preheated oven until set, 50 to 60 minutes. Once the custard has set, place ramekins on a wire rack, and allow to cool to room temperature, about 1 hour. Cover, and refrigerate until cold, about 4 hours. Custards may remain refrigerated until ready to serve. Unwrap the custards, and sprinkle about 1 teaspoon of superfine sugar onto each. Gently shake the custards so the sugar coats the entire top surface, then tip the custards to a 45 degree angle and shake off excess sugar. Using a small hand torch, melt the sugar by making short passes over top of the custards with the flame not quite touching. Continue melting the sugar until it turns deep brown. Once the sugar has melted and turned to caramel, the cold custard underneath will harden the sugar into a crispy crust. Serve immediately. Alternatively, the sugar-dusted custards may be browned underneath the broiler in the oven.",
			"rating": "4.7724552154541",
			"cook_time": 70,
			"ready_in_time": 385,
			"id": 19400,
			"prep_time": 15,
			"nutrition": [
				"Calories: 417 kcal 21 %",
				"Fat: 33.8 g 52 %",
				"Carbs: 21.8g 7 %",
				"Protein: 4.3 g 9 %",
				"Cholesterol: 314 mg 105 %",
				"Sodium: 39 mg 2 %"
			],
			"comment": "This is a great twist on an excellent dessert! We first had this at the English restaurant at Epcot, and this is the recipe I came up with the recreate it.",
			"cal": 417,
			"total_time": 470,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/995355.jpg",
			"ingredients": [
				"2 cups heavy cream ",
				" 1/3 cup white sugar ",
				" 6 egg yolks ",
				" 1 teaspoon vanilla extract ",
				" 3 tablespoons Irish cream liqueur ",
				" superfine sugar as needed "
			]
		}
	]
}