{
	"foods": [
		{
			"name": "Chicken Marsala",
			"reviews": "3440",
			"directions": "In a shallow dish or bowl, mix together the flour, salt, pepper and oregano. Coat chicken pieces in flour mixture. In a large skillet, melt butter in oil over medium heat. Place chicken in the pan, and lightly brown. Turn over chicken pieces, and add mushrooms. Pour in wine and sherry. Cover skillet; simmer chicken 10 minutes, turning once, until no longer pink and juices run clear.",
			"rating": "4.5351767539978",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 20101,
			"prep_time": 10,
			"nutrition": [
				"Calories: 448 kcal 22 %",
				"Fat: 26.6 g 41 %",
				"Carbs: 13.3g 4 %",
				"Protein: 28.8 g 58 %",
				"Cholesterol: 99 mg 33 %",
				"Sodium: 543 mg 22 %"
			],
			"comment": "A delicious, classic chicken dish -- lightly coated chicken breasts braised with Marsala wine and mushrooms. Easy and ideal for both a quick weeknight entree AND serving to company.",
			"cal": 448,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1043747.jpg",
			"ingredients": [
				"1/4 cup all-purpose flour for coating ",
				" 1/2 teaspoon salt ",
				" 1/4 teaspoon ground black pepper ",
				" 1/2 teaspoon dried oregano ",
				" 4 skinless, boneless chicken breast halves - pounded 1/4 inch thick ",
				" 4 tablespoons butter ",
				" 4 tablespoons olive oil ",
				" 1 cup sliced mushrooms ",
				" 1/2 cup Marsala wine ",
				" 1/4 cup cooking sherry "
			]
		},
		{
			"name": "Curried Coconut Chicken",
			"reviews": "2285",
			"directions": "Season chicken pieces with salt and pepper. Heat oil and curry powder in a large skillet over medium-high heat for two minutes. Stir in onions and garlic, and cook 1 minute more. Add chicken, tossing lightly to coat with curry oil. Reduce heat to medium, and cook for 7 to 10 minutes, or until chicken is no longer pink in center and juices run clear. Pour coconut milk, tomatoes, tomato sauce, and sugar into the pan, and stir to combine. Cover and simmer, stirring occasionally, approximately 30 to 40 minutes.",
			"rating": "4.49748134613037",
			"cook_time": 50,
			"ready_in_time": 70,
			"id": 20102,
			"prep_time": 20,
			"nutrition": [
				"Calories: 375 kcal 19 %",
				"Fat: 20.9 g 32 %",
				"Carbs: 16.7g 5 %",
				"Protein: 32.2 g 64 %",
				"Cholesterol: 78 mg 26 %",
				"Sodium: 807 mg 32 %"
			],
			"comment": "Curried chicken simmered in coconut milk and tomatoes makes for a mouthwatering hint of the tropics! Goes great with rice and vegetables.",
			"cal": 375,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3591067.jpg",
			"ingredients": [
				"2 pounds boneless skinless chicken breasts, cut into 1/2-inch chunks ",
				" 1 teaspoon salt and pepper, or to taste ",
				" 1 1/2 tablespoons vegetable oil ",
				" 2 tablespoons curry powder ",
				" 1/2 onion, thinly sliced ",
				" 2 cloves garlic, crushed ",
				" 1 (14 ounce) can coconut milk ",
				" 1 (14.5 ounce) can stewed, diced tomatoes ",
				" 1 (8 ounce) can tomato sauce ",
				" 3 tablespoons sugar "
			]
		},
		{
			"name": "Restaurant-Style Buffalo Chicken Wings",
			"reviews": "2362",
			"directions": "In a small bowl mix together the flour, paprika, cayenne pepper and salt. Place chicken wings in a large nonporous glass dish or bowl and sprinkle flour mixture over them until they are evenly coated. Cover dish or bowl and refrigerate for 60 to 90 minutes. Heat oil in a deep fryer to 375 degrees F (190 degrees C). The oil should be just enough to cover wings entirely, an inch or so deep. Combine the butter, hot sauce, pepper and garlic powder in a small saucepan over low heat. Stir together and heat until butter is melted and mixture is well blended. Remove from heat and reserve for serving. Fry coated wings in hot oil for 10 to 15 minutes, or until parts of wings begin to turn brown. Remove from heat, place wings in serving bowl, add hot sauce mixture and stir together. Serve.",
			"rating": "4.78230857849121",
			"cook_time": 15,
			"ready_in_time": 120,
			"id": 20103,
			"prep_time": 15,
			"nutrition": [
				"Calories: 364 kcal 18 %",
				"Fat: 32.4 g 50 %",
				"Carbs: 10.7g 3 %",
				"Protein: 7.9 g 16 %",
				"Cholesterol: 44 mg 15 %",
				"Sodium: 497 mg 20 %"
			],
			"comment": "This is similar to the hot wings recipe served at a popular restaurant chain. If you have ever had them, you have to love them.",
			"cal": 364,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/445293.jpg",
			"ingredients": [
				"1/2 cup all-purpose flour ",
				" 1/4 teaspoon paprika ",
				" 1/4 teaspoon cayenne pepper ",
				" 1/4 teaspoon salt ",
				" 10 chicken wings ",
				" oil for deep frying ",
				" 1/4 cup butter ",
				" 1/4 cup hot sauce ",
				" 1 dash ground black pepper ",
				" 1 dash garlic powder "
			]
		},
		{
			"name": "Braised Balsamic Chicken",
			"reviews": "2745",
			"directions": "Season both sides of chicken breasts with garlic salt and pepper. Heat olive oil in a skillet over medium heat; cook seasoned chicken breasts until chicken is browned, 3 to 4 minutes per side. Add onion; cook and stir until onion is browned, 3 to 4 minutes. Pour diced tomatoes and balsamic vinegar over chicken; season with basil, oregano, rosemary and thyme. Simmer until chicken is no longer pink and the juices run clear, about 15 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
			"rating": "4.36730194091797",
			"cook_time": 25,
			"ready_in_time": 35,
			"id": 20104,
			"prep_time": 10,
			"nutrition": [
				"Calories: 196 kcal 10 %",
				"Fat: 7 g 11 %",
				"Carbs: 7.6g 2 %",
				"Protein: 23.8 g 48 %",
				"Cholesterol: 61 mg 20 %",
				"Sodium: 511 mg 20 %"
			],
			"comment": "This chicken is good with either rice or pasta. Green beans make a nice side dish.",
			"cal": 196,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/532125.jpg",
			"ingredients": [
				"6 skinless, boneless chicken breast halves ",
				" 1 teaspoon garlic salt ",
				" ground black pepper to taste ",
				" 2 tablespoons olive oil ",
				" 1 onion, thinly sliced ",
				" 1 (14.5 ounce) can diced tomatoes ",
				" 1/2 cup balsamic vinegar ",
				" 1 teaspoon dried basil ",
				" 1 teaspoon dried oregano ",
				" 1 teaspoon dried rosemary ",
				" 1/2 teaspoon dried thyme "
			]
		},
		{
			"name": "Chicken Pot Pie IX",
			"reviews": "7480",
			"directions": "Preheat oven to 425 degrees F (220 degrees C.) In a saucepan, combine chicken, carrots, peas, and celery. Add water to cover and boil for 15 minutes. Remove from heat, drain and set aside. In the saucepan over medium heat, cook onions in butter until soft and translucent. Stir in flour, salt, pepper, and celery seed. Slowly stir in chicken broth and milk. Simmer over medium-low heat until thick. Remove from heat and set aside. Place the chicken mixture in bottom pie crust. Pour hot liquid mixture over. Cover with top crust, seal edges, and cut away excess dough. Make several small slits in the top to allow steam to escape. Bake in the preheated oven for 30 to 35 minutes, or until pastry is golden brown and filling is bubbly. Cool for 10 minutes before serving.",
			"rating": "4.81118822097778",
			"cook_time": 50,
			"ready_in_time": 70,
			"id": 20105,
			"prep_time": 20,
			"nutrition": [
				"Calories: 415 kcal 21 %",
				"Fat: 24 g 37 %",
				"Carbs: 30.6g 10 %",
				"Protein: 18.7 g 37 %",
				"Cholesterol: 56 mg 19 %",
				"Sodium: 727 mg 29 %"
			],
			"comment": "A delicious chicken pie made from scratch with carrots, peas and celery.",
			"cal": 415,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/142350.jpg",
			"ingredients": [
				"1 pound skinless, boneless chicken breast halves - cubed ",
				" 1 cup sliced carrots ",
				" 1 cup frozen green peas ",
				" 1/2 cup sliced celery ",
				" 1/3 cup butter ",
				" 1/3 cup chopped onion ",
				" 1/3 cup all-purpose flour ",
				" 1/2 teaspoon salt ",
				" 1/4 teaspoon black pepper ",
				" 1/4 teaspoon celery seed ",
				" 1 3/4 cups chicken broth ",
				" 2/3 cup milk ",
				" 2 (9 inch) unbaked pie crusts "
			]
		},
		{
			"name": "Slow Cooker Chicken Stroganoff",
			"reviews": "2887",
			"directions": "Put chicken, margarine and dressing mix in slow cooker; mix together and cook on low for 5 to 6 hours. Add cream cheese and soup, mix together and cook on high for another 1/2 hour or until heated through and warm.",
			"rating": "4.38749027252197",
			"cook_time": 300,
			"ready_in_time": 310,
			"id": 20106,
			"prep_time": 10,
			"nutrition": [
				"Calories: 456 kcal 23 %",
				"Fat: 31 g 48 %",
				"Carbs: 9.5g 3 %",
				"Protein: 33.4 g 67 %",
				"Cholesterol: 136 mg 45 %",
				"Sodium: 1603 mg 64 %"
			],
			"comment": "Cubed chicken breast cooked in the slow cooker with a simple, creamy sauce mixture. This is so good, and so easy to make on a busy day. Serve over hot cooked rice, if desired.",
			"cal": 456,
			"total_time": 620,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/508287.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves - cubed ",
				" 1/8 cup margarine ",
				" 1 (.7 ounce) package dry Italian-style salad dressing mix ",
				" 1 (8 ounce) package cream cheese ",
				" 1 (10.75 ounce) can condensed cream of chicken soup "
			]
		},
		{
			"name": "Baked Teriyaki Chicken",
			"reviews": "4459",
			"directions": "In a small saucepan over low heat, combine the cornstarch, cold water, sugar, soy sauce, vinegar, garlic, ginger and ground black pepper. Let simmer, stirring frequently, until sauce thickens and bubbles. Preheat oven to 425 degrees F (220 degrees C). Place chicken pieces in a lightly greased 9x13 inch baking dish. Brush chicken with the sauce. Turn pieces over, and brush again. Bake in the preheated oven for 30 minutes. Turn pieces over, and bake for another 30 minutes, until no longer pink and juices run clear. Brush with sauce every 10 minutes during cooking.",
			"rating": "4.64493322372437",
			"cook_time": 60,
			"ready_in_time": 90,
			"id": 20107,
			"prep_time": 30,
			"nutrition": [
				"Calories: 272 kcal 14 %",
				"Fat: 9.8 g 15 %",
				"Carbs: 19.9g 6 %",
				"Protein: 24.7 g 49 %",
				"Cholesterol: 85 mg 28 %",
				"Sodium: 1282 mg 51 %"
			],
			"comment": "A much requested chicken recipe! Easy to double for a large group. Delicious!",
			"cal": 272,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/384820.jpg",
			"ingredients": [
				"1 tablespoon cornstarch ",
				" 1 tablespoon cold water ",
				" 1/2 cup white sugar ",
				" 1/2 cup soy sauce ",
				" 1/4 cup cider vinegar ",
				" 1 clove garlic, minced ",
				" 1/2 teaspoon ground ginger ",
				" 1/4 teaspoon ground black pepper ",
				" 12 skinless chicken thighs "
			]
		},
		{
			"name": "Sweet, Sticky and Spicy Chicken",
			"reviews": "2593",
			"directions": "Mix together brown sugar, honey, soy sauce, ginger, garlic and hot sauce in a small bowl. Lightly salt and pepper the chicken strips. Heat oil in a large skillet over medium heat. Add chicken strips and brown on both sides, about 1 minute per side. Pour the sauce over the chicken. Simmer uncovered until the sauce thickens, 8 to 10 minutes.",
			"rating": "4.50056982040405",
			"cook_time": 12,
			"ready_in_time": 22,
			"id": 20108,
			"prep_time": 10,
			"nutrition": [
				"Calories: 232 kcal 12 %",
				"Fat: 9.3 g 14 %",
				"Carbs: 13.9g 4 %",
				"Protein: 22.8 g 46 %",
				"Cholesterol: 59 mg 20 %",
				"Sodium: 1176 mg 47 %"
			],
			"comment": "This chicken dish uses skinless boneless chicken breasts and tastes delicious. It's great as an appetizer or as a main dish served with rice and a veggie.",
			"cal": 232,
			"total_time": 44,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1655056.jpg",
			"ingredients": [
				"1 tablespoon brown sugar ",
				" 2 tablespoons honey ",
				" 1/4 cup soy sauce ",
				" 2 teaspoons chopped fresh ginger root ",
				" 2 teaspoons chopped garlic ",
				" 2 tablespoons hot sauce ",
				" salt and pepper to taste ",
				" 4 skinless, boneless chicken breast halves - cut into 1/2 inch strips ",
				" 1 tablespoon vegetable oil "
			]
		},
		{
			"name": "Slow Cooker Chicken and Dumplings",
			"reviews": "6448",
			"directions": "Place the chicken, butter, soup, and onion in a slow cooker, and fill with enough water to cover. Cover, and cook for 5 to 6 hours on High. About 30 minutes before serving, place the torn biscuit dough in the slow cooker. Cook until the dough is no longer raw in the center.",
			"rating": "4.35990047454834",
			"cook_time": 360,
			"ready_in_time": 370,
			"id": 20109,
			"prep_time": 10,
			"nutrition": [
				"Calories: 385 kcal 19 %",
				"Fat: 18 g 28 %",
				"Carbs: 37g 12 %",
				"Protein: 18.1 g 36 %",
				"Cholesterol: 45 mg 15 %",
				"Sodium: 1245 mg 50 %"
			],
			"comment": "This is an easy slow cooker recipe that cooks while you are at work! It is wonderful on a cold, snowy day. I have four children who are picky eaters, and they LOVE this! Enjoy!",
			"cal": 385,
			"total_time": 740,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/806223.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves ",
				" 2 tablespoons butter ",
				" 2 (10.75 ounce) cans condensed cream of chicken soup ",
				" 1 onion, finely diced ",
				" 2 (10 ounce) packages refrigerated biscuit dough, torn into pieces "
			]
		},
		{
			"name": "Garlic Chicken",
			"reviews": "3774",
			"directions": "Preheat oven to 425 degrees F (220 degrees C). Heat olive oil and garlic in a small saucepan over low heat until warmed, 1 to 2 minutes. Transfer garlic and oil to a shallow bowl. Combine bread crumbs and Parmesan cheese in a separate shallow bowl. Dip chicken breasts in the olive oil-garlic mixture using tongs; transfer to bread crumb mixture and turn to evenly coat. Transfer coated chicken to a shallow baking dish. Bake in the preheated oven until no longer pink and juices run clear, 30 to 35 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
			"rating": "4.56381607055664",
			"cook_time": 35,
			"ready_in_time": 55,
			"id": 20110,
			"prep_time": 20,
			"nutrition": [
				"Calories: 300 kcal 15 %",
				"Fat: 16.8 g 26 %",
				"Carbs: 5.7g 2 %",
				"Protein: 30.3 g 61 %",
				"Cholesterol: 73 mg 24 %",
				"Sodium: 261 mg 10 %"
			],
			"comment": "Simple to make, just dip and bake! Garlicky goodness in a breaded chicken dish. Yum!",
			"cal": 300,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/394412.jpg",
			"ingredients": [
				"1/4 cup olive oil ",
				" 2 cloves garlic, crushed ",
				" 1/4 cup Italian-seasoned bread crumbs ",
				" 1/4 cup grated Parmesan cheese ",
				" 4 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Chicken Cordon Bleu II",
			"reviews": "4263",
			"directions": "Pound chicken breasts if they are too thick. Place a cheese and ham slice on each breast within 1/2 inch of the edges. Fold the edges of the chicken over the filling, and secure with toothpicks. Mix the flour and paprika in a small bowl, and coat the chicken pieces. Heat the butter in a large skillet over medium-high heat, and cook the chicken until browned on all sides. Add the wine and bouillon. Reduce heat to low, cover, and simmer for 30 minutes, until chicken is no longer pink and juices run clear. Remove the toothpicks, and transfer the breasts to a warm platter. Blend the cornstarch with the cream in a small bowl, and whisk slowly into the skillet. Cook, stirring until thickened, and pour over the chicken. Serve warm.",
			"rating": "4.77841377258301",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 20111,
			"prep_time": 15,
			"nutrition": [
				"Calories: 584 kcal 29 %",
				"Fat: 40.9 g 63 %",
				"Carbs: 7.7g 2 %",
				"Protein: 41.6 g 83 %",
				"Cholesterol: 195 mg 65 %",
				"Sodium: 655 mg 26 %"
			],
			"comment": "'Cordon Bleu' is a French term, literally translated as 'blue ribbon', that originally referred to an award for culinary excellence given to women cooks! The term can now apply to any superior cook (yes, men too), and also to this dish (chicken, ham and Swiss cheese slices, breaded and sauteed). This yummy version adds paprika and a creamy white wine sauce worthy of its own blue ribbon. Two blue ribbon tastes in wedded bliss -- Chicken Cordon Bleu II!",
			"cal": 584,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/378540.jpg",
			"ingredients": [
				"6 skinless, boneless chicken breast halves ",
				" 6 slices Swiss cheese ",
				" 6 slices ham ",
				" 3 tablespoons all-purpose flour ",
				" 1 teaspoon paprika ",
				" 6 tablespoons butter ",
				" 1/2 cup dry white wine ",
				" 1 teaspoon chicken bouillon granules ",
				" 1 tablespoon cornstarch ",
				" 1 cup heavy whipping cream "
			]
		},
		{
			"name": "Angel Chicken Pasta",
			"reviews": "2758",
			"directions": "Preheat oven to 325 degrees F (165 degrees C). In a large saucepan, melt butter over low heat. Stir in the package of dressing mix. Blend in wine and golden mushroom soup. Mix in cream cheese, and stir until smooth. Heat through, but do not boil. Arrange chicken breasts in a single layer in a 9x13 inch baking dish. Pour sauce over. Bake for 60 minutes in the preheated oven. Twenty minutes before the chicken is done, bring a large pot of lightly salted water to a rolling boil. Cook pasta until al dente, about 5 minutes. Drain. Serve chicken and sauce over pasta.",
			"rating": "4.4895806312561",
			"cook_time": 60,
			"ready_in_time": 90,
			"id": 20112,
			"prep_time": 30,
			"nutrition": [
				"Calories: 528 kcal 26 %",
				"Fat: 18.5 g 28 %",
				"Carbs: 48.3g 16 %",
				"Protein: 37.5 g 75 %",
				"Cholesterol: 107 mg 36 %",
				"Sodium: 1265 mg 51 %"
			],
			"comment": "A delicious, easy company dish - the flavors are wonderful. A favorite with my family. I usually double the recipe so we can have leftovers.",
			"cal": 528,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/525185.jpg",
			"ingredients": [
				"6 skinless, boneless chicken breast halves ",
				" 1/4 cup butter ",
				" 1 (.7 ounce) package dry Italian-style salad dressing mix ",
				" 1/2 cup white wine ",
				" 1 (10.75 ounce) can condensed golden mushroom soup ",
				" 4 ounces cream cheese with chives ",
				" 1 pound angel hair pasta "
			]
		},
		{
			"name": "Mom's Fabulous Chicken Pot Pie with Biscuit Crust",
			"reviews": "307",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Melt butter in a skillet over medium-low heat, and cook the onion, celery, and carrots until the celery and carrots are tender, about 15 minutes, stirring occasionally. Stir in peas, parsley, thyme and flour, and cook, stirring constantly, until the flour coats the vegetables and begins to fry, about 5 minutes. Whisk in chicken broth and half-and-half, and cook until the sauce is thick and bubbling. Season to taste with salt and black pepper, and mix in the chicken meat. Transfer the chicken, vegetables, and sauce into a 2-quart baking dish. Arrange biscuits on top of the filling. In a small bowl, beat egg yolk with water; brush egg yolk on the biscuits. Bake in the preheated oven until the biscuits are golden brown and the pie filling is bubbling, 20 to 25 minutes. Let rest 10 minutes before serving.",
			"rating": "4.61780118942261",
			"cook_time": 20,
			"ready_in_time": 60,
			"id": 20113,
			"prep_time": 30,
			"nutrition": [
				"Calories: 577 kcal 29 %",
				"Fat: 31.2 g 48 %",
				"Carbs: 44.7g 14 %",
				"Protein: 27.1 g 54 %",
				"Cholesterol: 120 mg 40 %",
				"Sodium: 1000 mg 40 %"
			],
			"comment": "Leftover chicken or rotisserie chicken from the supermarket helps on the ease of preparation of this fabulous comfort style dinner. Fresh vegetables gives this a very special added flavor and is worth the effort. Everyone loves Mom's Chicken Pot Pie! Serve with a green salad.",
			"cal": 577,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1635603.jpg",
			"ingredients": [
				"1/4 cup butter ",
				" 1 small onion, chopped ",
				" 3 celery ribs, chopped ",
				" 3 carrots, chopped ",
				" 2/3 cup frozen peas ",
				" 3 tablespoons chopped fresh parsley ",
				" 1/4 teaspoon dried thyme ",
				" 1/4 cup all-purpose flour ",
				" 2 cups lower-sodium chicken broth ",
				" 2/3 cup half-and-half cream ",
				" salt and ground black pepper to taste ",
				" 3 cups cooked chicken, cut into bite-size pieces ",
				" 1 (16.3 ounce) can refrigerated flaky-style biscuits (such as Pillsbury Grands®) ",
				" 1 egg yolk, beaten ",
				" 1 tablespoon water "
			]
		},
		{
			"name": "Roast Chicken with Thyme and Onions",
			"reviews": "25",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Lightly grease a medium baking dish. Pierce lemons several times with a fork, and place 1 inside each chicken cavity. Arrange chickens in the center of the prepared baking dish. Place onions, shallots, and garlic around the chickens. Sprinkle vegetables with olive oil, and season with salt and pepper. Spread butter over the chickens, and line each with thyme sprigs. Bake 20 minutes in the preheated oven. Increase temperature to 400 degrees F (200 degrees C), and continue baking 30 minutes, or until exterior of chicken is golden brown, meat is no longer pink, and juices run clear. Allow to cool about 15 minutes before serving.",
			"rating": "4.10256433486938",
			"cook_time": 50,
			"ready_in_time": 85,
			"id": 20114,
			"prep_time": 20,
			"nutrition": [
				"Calories: 641 kcal 32 %",
				"Fat: 47.1 g 73 %",
				"Carbs: 11g 4 %",
				"Protein: 43.3 g 87 %",
				"Cholesterol: 192 mg 64 %",
				"Sodium: 344 mg 14 %"
			],
			"comment": "People are always raving about chicken and rosemary, when I think chicken and fresh thyme is superior. This is so easy it's criminal, and the results are fabulous. I sometimes add four or five bulbs of green garlic if I find it at the farmers' market.",
			"cal": 641,
			"total_time": 155,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/211414.jpg",
			"ingredients": [
				"2 lemons ",
				" 2 (2.5 pound) whole chickens ",
				" 2 large onions, peeled and quartered ",
				" 6 shallots, coarsely chopped ",
				" 8 cloves garlic, unpeeled ",
				" 3 tablespoons olive oil ",
				" salt and pepper to taste ",
				" 1/2 cup butter, softened ",
				" 8 sprigs fresh thyme "
			]
		},
		{
			"name": "Chicken Enchiladas II",
			"reviews": "3037",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a large baking dish. In a medium saucepan over medium heat, melt the butter and saute the green onion until tender (about 3 to 4 minutes). Add the garlic powder, then stir in the green chiles, cream of mushroom soup and sour cream. Mix well. Reserve 3/4 of this sauce and set aside. To the remaining 1/4 of the sauce in the saucepan, add the chicken and 1/2 cup of shredded Cheddar cheese. Stir together. Fill each flour tortilla with the chicken mixture and roll up. Place seam side down in the prepared baking dish. In a small bowl combine the reserved 3/4 of the sauce with the milk. Spoon this mixture over the rolled tortillas and top with the remaining 1/2 cup of shredded Cheddar cheese. Bake in the preheated oven for 30 to 35 minutes, or until cheese is bubbly.",
			"rating": "4.5637264251709",
			"cook_time": 30,
			"ready_in_time": 45,
			"id": 20115,
			"prep_time": 15,
			"nutrition": [
				"Calories: 619 kcal 31 %",
				"Fat: 27.1 g 42 %",
				"Carbs: 66.8g 22 %",
				"Protein: 26.1 g 52 %",
				"Cholesterol: 60 mg 20 %",
				"Sodium: 1459 mg 58 %"
			],
			"comment": "A great way to use leftover chicken. Even kids love these!",
			"cal": 619,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/663423.jpg",
			"ingredients": [
				"1 tablespoon butter ",
				" 1/2 cup chopped green onions ",
				" 1/2 teaspoon garlic powder ",
				" 1 (4 ounce) can diced green chiles ",
				" 1 (10.75 ounce) can condensed cream of mushroom soup ",
				" 1/2 cup sour cream ",
				" 1 1/2 cups cubed cooked chicken breast meat ",
				" 1 cup shredded Cheddar cheese, divided ",
				" 6 (12 inch) flour tortillas ",
				" 1/4 cup milk "
			]
		},
		{
			"name": "Chef John's Chicken Marsala",
			"reviews": "207",
			"directions": "Season chicken breasts all over with salt and pepper. Melt 1 1/2 tablespoons butter and olive oil in a skillet over medium heat. Cook chicken breasts, skin-side down, in hot butter and oil until browned, about 5 minutes. Flip and cook until breasts are almost cooked through, about 5 minutes more. Transfer chicken breasts to a plate. Melt 1 1/2 tablespoons butter in the same skillet over medium-high heat. Saute mushrooms with a pinch of salt and a pinch of pepper in hot butter until mushrooms are golden, 5 to 7 minutes. Add minced shallot; cook and stir until softened, 2 to 3 minutes. Sprinkle flour over the top and cook and stir until the bitterness of the flour cooks off, 3 to 4 minutes. Pour wine into skillet and bring to a boil; cook and stir until wine reduces and sauce thickens, 3 to 4 minutes. Add chicken stock; bring to a simmer and cook until slightly reduced, 3 to 5 minutes more. Return chicken breasts to the skillet, reduce heat to low, and cook chicken, turning once, until no longer pink in the center and the juices run clear, about 10 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Remove from heat. Move chicken to one side of the skillet and tilt the skillet so that the sauce pools at the bottom. Stir parsley and 1 teaspoon cold butter into the sauce, stirring constantly, until sauce is shiny and butter is completely melted. Transfer chicken breasts to plates and spoon mushrooms and sauce over the top.",
			"rating": "4.69348669052124",
			"cook_time": 40,
			"ready_in_time": 60,
			"id": 20116,
			"prep_time": 20,
			"nutrition": [
				"Calories: 799 kcal 40 %",
				"Fat: 39 g 60 %",
				"Carbs: 26.8g 9 %",
				"Protein: 51.1 g 102 %",
				"Cholesterol: 185 mg 62 %",
				"Sodium: 2391 mg 96 %"
			],
			"comment": "Certain dishes have a special place in my heart and this is one of them. The first real restaurant job I had in San Francisco was at a small place called Ryan's Cafe. It was run by a husband and wife team, Michael and Lenore Ryan. They were true 'foodies' before that term had even been coined. This chicken Marsala dish was the most popular dish on the menu and the first one that I was taught.",
			"cal": 799,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1167787.jpg",
			"ingredients": [
				"2 skin-on, boneless chicken breast halves ",
				" 1 teaspoon salt and ground black pepper to taste ",
				" 3 tablespoons butter, divided ",
				" 2 tablespoons olive oil ",
				" 5 white mushrooms, sliced ",
				" 1 shallot, minced ",
				" 1 tablespoon all-purpose flour ",
				" 1 cup Marsala wine ",
				" 2 cups chicken stock ",
				" 2 tablespoons chopped fresh parsley ",
				" 1 teaspoon cold butter "
			]
		},
		{
			"name": "Slow-Cooker Chicken Tortilla Soup",
			"reviews": "3596",
			"directions": "Place chicken, tomatoes, enchilada sauce, onion, green chiles, and garlic into a slow cooker. Pour in water and chicken broth, and season with cumin, chili powder, salt, pepper, and bay leaf. Stir in corn and cilantro. Cover, and cook on Low setting for 6 to 8 hours or on High setting for 3 to 4 hours. Preheat oven to 400 degrees F (200 degrees C). Lightly brush both sides of tortillas with oil. Cut tortillas into strips, then spread on a baking sheet. Bake in preheated oven until crisp, about 10 to 15 minutes. To serve, sprinkle tortilla strips over soup.",
			"rating": "4.66966962814331",
			"cook_time": 480,
			"ready_in_time": 510,
			"id": 20117,
			"prep_time": 30,
			"nutrition": [
				"Calories: 262 kcal 13 %",
				"Fat: 10.8 g 17 %",
				"Carbs: 24.7g 8 %",
				"Protein: 18 g 36 %",
				"Cholesterol: 45 mg 15 %",
				"Sodium: 893 mg 36 %"
			],
			"comment": "This tortilla soup tastes better than anything you can get at a restaurant. And it's healthy too! Don't let the long list of ingredients fool you. All you do is dump everything into the slow cooker and walk away. Garnish with grated Cheddar, avocadoes, and a splash of fresh lime juice.",
			"cal": 262,
			"total_time": 1020,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/193211.jpg",
			"ingredients": [
				"1 pound shredded, cooked chicken ",
				" 1 (15 ounce) can whole peeled tomatoes, mashed ",
				" 1 (10 ounce) can enchilada sauce ",
				" 1 medium onion, chopped ",
				" 1 (4 ounce) can chopped green chile peppers ",
				" 2 cloves garlic, minced ",
				" 2 cups water ",
				" 1 (14.5 ounce) can chicken broth ",
				" 1 teaspoon cumin ",
				" 1 teaspoon chili powder ",
				" 1 teaspoon salt ",
				" 1/4 teaspoon black pepper ",
				" 1 bay leaf ",
				" 1 (10 ounce) package frozen corn ",
				" 1 tablespoon chopped cilantro ",
				" 7 corn tortillas ",
				" vegetable oil "
			]
		},
		{
			"name": "Chicken Breasts Pierre",
			"reviews": "1545",
			"directions": "In a shallow dish or bowl, combine flour, 1/2 teaspoon salt and ground black pepper. Coat chicken breasts with flour mixture. Melt butter in a large skillet over medium heat, and brown chicken on all sides. Remove from skillet, and drain on paper towels. In the same skillet, combine the tomatoes, water, brown sugar, vinegar and Worcestershire sauce. Season with salt, chili powder, mustard, celery seed, garlic and hot pepper sauce. Bring to a boil; reduce heat, and return chicken to skillet. Cover, and simmer for 35 to 40 minutes, or until chicken is tender, no longer pink and juices run clear.",
			"rating": "4.55428028106689",
			"cook_time": 40,
			"ready_in_time": 70,
			"id": 20118,
			"prep_time": 30,
			"nutrition": [
				"Calories: 247 kcal 12 %",
				"Fat: 7.8 g 12 %",
				"Carbs: 14.8g 5 %",
				"Protein: 28.8 g 58 %",
				"Cholesterol: 84 mg 28 %",
				"Sodium: 915 mg 37 %"
			],
			"comment": "One of my husband's favorites. I've been making this for over fifteen years, and he's not sick of it yet! Serve with pan sauces, crusty French bread and a tossed green salad.",
			"cal": 247,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1056183.jpg",
			"ingredients": [
				"6 skinless, boneless chicken breast halves ",
				" 1/4 cup all-purpose flour ",
				" 1/2 teaspoon salt ",
				" 1 pinch ground black pepper ",
				" 3 tablespoons butter ",
				" 1 (14.5 ounce) can stewed tomatoes, with liquid ",
				" 1/2 cup water ",
				" 2 tablespoons brown sugar ",
				" 2 tablespoons distilled white vinegar ",
				" 2 tablespoons Worcestershire sauce ",
				" 1 teaspoon salt ",
				" 2 teaspoons chili powder ",
				" 1 teaspoon mustard powder ",
				" 1/2 teaspoon celery seed ",
				" 1 clove garlic, minced ",
				" 1/8 teaspoon hot pepper sauce "
			]
		},
		{
			"name": "Tender Italian Baked Chicken",
			"reviews": "593",
			"directions": "Preheat oven to 425 degrees F (220 degrees C). In a bowl, mix the mayonnaise, Parmesan cheese, and garlic powder. Place bread crumbs in a separate bowl. Dip chicken into the mayonnaise mixture, then into the bread crumbs to coat. Arrange coated chicken on a baking sheet. Bake 20 minutes in the preheated oven, or until chicken juices run clear and coating is golden brown.",
			"rating": "4.50063037872314",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 20119,
			"prep_time": 10,
			"nutrition": [
				"Calories: 554 kcal 28 %",
				"Fat: 39.6 g 61 %",
				"Carbs: 17.1g 6 %",
				"Protein: 31.8 g 64 %",
				"Cholesterol: 92 mg 31 %",
				"Sodium: 768 mg 31 %"
			],
			"comment": "Flavorful and moist baked chicken.",
			"cal": 554,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/938675.jpg",
			"ingredients": [
				"3/4 cup mayonnaise ",
				" 1/2 cup grated Parmesan cheese ",
				" 3/4 teaspoon garlic powder ",
				" 3/4 cup Italian seasoned bread crumbs ",
				" 4 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Rosemary Ranch Chicken Kabobs",
			"reviews": "2737",
			"directions": "In a medium bowl, stir together the olive oil, ranch dressing, Worcestershire sauce, rosemary, salt, lemon juice, white vinegar, pepper, and sugar. Let stand for 5 minutes. Place chicken in the bowl, and stir to coat with the marinade. Cover and refrigerate for 30 minutes. Preheat the grill for medium-high heat. Thread chicken onto skewers and discard marinade. Lightly oil the grill grate. Grill skewers for 8 to 12 minutes, or until the chicken is no longer pink in the center, and the juices run clear.",
			"rating": "4.69921064376831",
			"cook_time": 10,
			"ready_in_time": 60,
			"id": 20120,
			"prep_time": 50,
			"nutrition": [
				"Calories: 378 kcal 19 %",
				"Fat: 30.7 g 47 %",
				"Carbs: 4.8g 2 %",
				"Protein: 19.9 g 40 %",
				"Cholesterol: 59 mg 20 %",
				"Sodium: 1097 mg 44 %"
			],
			"comment": "This rosemary ranch chicken recipe is so delicious, tender, and juicy the chicken will melt in your mouth. Even the most picky eater will be begging for the last piece.",
			"cal": 378,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/642001.jpg",
			"ingredients": [
				"1/2 cup olive oil ",
				" 1/2 cup ranch dressing ",
				" 3 tablespoons Worcestershire sauce ",
				" 1 tablespoon minced fresh rosemary ",
				" 2 teaspoons salt ",
				" 1 teaspoon lemon juice ",
				" 1 teaspoon white vinegar ",
				" 1/4 teaspoon ground black pepper, or to taste ",
				" 1 tablespoon white sugar, or to taste (optional) ",
				" 5 skinless, boneless chicken breast halves - cut into 1 inch cubes "
			]
		},
		{
			"name": "Salsa Chicken",
			"reviews": "2939",
			"directions": "Preheat oven to 375 degrees F (190 degrees C) Place chicken breasts in a lightly greased 9x13 inch baking dish. Sprinkle taco seasoning on both sides of chicken breasts, and pour salsa over all. Bake at 375 degrees F (190 degrees C) for 25 to 35 minutes, or until chicken is tender and juicy and its juices run clear. Sprinkle chicken evenly with cheese, and continue baking for an additional 3 to 5 minutes, or until cheese is melted and bubbly. Top with sour cream if desired, and serve.",
			"rating": "4.62419462203979",
			"cook_time": 40,
			"ready_in_time": 45,
			"id": 20121,
			"prep_time": 5,
			"nutrition": [
				"Calories: 287 kcal 14 %",
				"Fat: 12.4 g 19 %",
				"Carbs: 6.8g 2 %",
				"Protein: 35.5 g 71 %",
				"Cholesterol: 101 mg 34 %",
				"Sodium: 863 mg 35 %"
			],
			"comment": "Someone gave me this recipe a few years back and it's become a household favorite. You can use mild, medium or hot salsa depending on your taste. I usually serve it with Spanish rice and Mexican-style canned corn. Very easy and quick!",
			"cal": 287,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/117563.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves ",
				" 4 teaspoons taco seasoning mix ",
				" 1 cup salsa ",
				" 1 cup shredded Cheddar cheese ",
				" 2 tablespoons sour cream (optional) "
			]
		},
		{
			"name": "Slow Cooker Chicken Taco Soup",
			"reviews": "4641",
			"directions": "Place the onion, chili beans, black beans, corn, tomato sauce, beer, and diced tomatoes in a slow cooker. Add taco seasoning, and stir to blend. Lay chicken breasts on top of the mixture, pressing down slightly until just covered by the other ingredients. Set slow cooker for low heat, cover, and cook for 5 hours. Remove chicken breasts from the soup, and allow to cool long enough to be handled. Stir the shredded chicken back into the soup, and continue cooking for 2 hours. Serve topped with shredded Cheddar cheese, a dollop of sour cream, and crushed tortilla chips, if desired.",
			"rating": "4.67293548583984",
			"cook_time": 420,
			"ready_in_time": 435,
			"id": 20122,
			"prep_time": 15,
			"nutrition": [
				"Calories: 434 kcal 22 %",
				"Fat: 17.7 g 27 %",
				"Carbs: 42.3g 14 %",
				"Protein: 27.2 g 54 %",
				"Cholesterol: 68 mg 23 %",
				"Sodium: 1597 mg 64 %"
			],
			"comment": "You can call this soup or chili, but either way it is wonderful! This recipe is also very adaptable to your personal taste. I recommend using Bill Echols' Taco Seasoning from this website. Serve topped with shredded Cheddar cheese, a dollop of sour cream, and crushed tortilla chips, if you like. I hope you enjoy!",
			"cal": 434,
			"total_time": 870,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/322598.jpg",
			"ingredients": [
				"1 onion, chopped ",
				" 1 (16 ounce) can chili beans ",
				" 1 (15 ounce) can black beans ",
				" 1 (15 ounce) can whole kernel corn, drained ",
				" 1 (8 ounce) can tomato sauce ",
				" 1 (12 fluid ounce) can or bottle beer ",
				" 2 (10 ounce) cans diced tomatoes with green chilies, undrained ",
				" 1 (1.25 ounce) package taco seasoning ",
				" 3 whole skinless, boneless chicken breasts ",
				" 1 (8 ounce) package shredded Cheddar cheese (optional) ",
				" sour cream (optional) ",
				" crushed tortilla chips (optional) "
			]
		},
		{
			"name": "Chicken Piccata with Artichoke Hearts",
			"reviews": "258",
			"directions": "Mix together the flour, garlic powder, salt, pepper, and Italian seasoning on a plate. One by one, dredge the chicken pieces lightly in the prepared flour mixture. Heat the olive oil in a large skillet over medium-high heat. Cook the chicken pieces for 2 minutes per side, or until nicely browned. Remove from the skillet and set aside. Using the same skillet, cook and stir the garlic and onion until translucent, about 5 minutes. Pour the white wine into the skillet, turn the heat to high, and cook until the wine reduces by half, 4 to 5 minutes. Add the chicken broth, lemon juice, artichoke hearts, reserved artichoke liquid, and browned chicken to the skillet. Reduce the heat to medium and cook until the sauce thickens, about 20 minutes. Stir in the capers and butter.",
			"rating": "4.60632181167603",
			"cook_time": 35,
			"ready_in_time": 50,
			"id": 20123,
			"prep_time": 15,
			"nutrition": [
				"Calories: 424 kcal 21 %",
				"Fat: 15.8 g 24 %",
				"Carbs: 34g 11 %",
				"Protein: 30.7 g 61 %",
				"Cholesterol: 82 mg 27 %",
				"Sodium: 1528 mg 61 %"
			],
			"comment": "After eating chicken piccata in many restaurants and finding many that were 'greasy,' I came up with this recipe through much trial and error. It has wonderful flavor and is even better the next day! I like to serve it over angel hair pasta or linguine.",
			"cal": 424,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/950457.jpg",
			"ingredients": [
				"3/4 cup all-purpose flour ",
				" 1/8 teaspoon garlic powder ",
				" 1/4 teaspoon salt ",
				" 1/8 teaspoon black pepper ",
				" 1/2 teaspoon Italian seasoning ",
				" 4 skinless, boneless chicken breast halves, pounded 1/2 inch thick and cut into thirds ",
				" 2 tablespoons olive oil ",
				" 1 clove garlic, minced ",
				" 1 onion, minced ",
				" 1/2 cup white wine ",
				" 1 (14.5 ounce) can chicken broth ",
				" 2 tablespoons lemon juice ",
				" 1 (13.75 ounce) can artichoke hearts, drained and chopped, liquid reserved ",
				" 1/4 cup capers, with liquid ",
				" 2 tablespoons butter "
			]
		},
		{
			"name": "Healthy Mexican Chicken Bake",
			"reviews": "70",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Heat vegetable oil in a large skillet over medium heat. Season one side of chicken breasts with half the cumin, half the garlic powder, salt, and black pepper; arrange chicken breasts with seasoned sides down in the hot oil. Fry until chicken is lightly browned on the bottom, 4 to 5 minutes. Season the top of each chicken breast with the remaining cumin, remaining garlic powder, salt, and black pepper; flip chicken and cook until other side is lightly browned, 4 to 5 minutes. If the skillet gets dry, pour in just enough juice from the salsa to keep it from burning. Transfer chicken breasts to a 9x9-inch baking dish; sprinkle with Mexican cheese blend. Loosen all the drippings from the skillet with a little more juice from the salsa and pour on top of chicken breasts. Spoon salsa over cheese layer. Bake chicken breasts until no longer pink in the center and the juices run clear, 20 to 25 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
			"rating": "4.66972494125366",
			"cook_time": 30,
			"ready_in_time": 45,
			"id": 20124,
			"prep_time": 15,
			"nutrition": [
				"Calories: 321 kcal 16 %",
				"Fat: 18.9 g 29 %",
				"Carbs: 5.7g 2 %",
				"Protein: 32 g 64 %",
				"Cholesterol: 94 mg 31 %",
				"Sodium: 704 mg 28 %"
			],
			"comment": "A high-protein, low-calorie meal that leaves you FULL. It's so flavorful. Goes great with cornbread and/or a side of refried beans. You can use whatever Mexican spices you want. We love cumin!",
			"cal": 321,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3134893.jpg",
			"ingredients": [
				"2 tablespoons vegetable oil ",
				" 4 boneless, skinless chicken breasts ",
				" 1 teaspoon ground cumin ",
				" 1 teaspoon garlic powder ",
				" salt and ground black pepper to taste ",
				" 4 ounces shredded Mexican cheese blend ",
				" 1 cup salsa "
			]
		},
		{
			"name": "Zesty Slow Cooker Chicken Barbecue",
			"reviews": "3831",
			"directions": "Place chicken in a slow cooker. In a bowl, mix the barbecue sauce, Italian salad dressing, brown sugar, and Worcestershire sauce. Pour over the chicken. Cover, and cook 3 to 4 hours on High or 6 to 8 hours on Low.",
			"rating": "4.56809902191162",
			"cook_time": 240,
			"ready_in_time": 250,
			"id": 20125,
			"prep_time": 10,
			"nutrition": [
				"Calories: 300 kcal 15 %",
				"Fat: 8.1 g 12 %",
				"Carbs: 32.4g 10 %",
				"Protein: 23 g 46 %",
				"Cholesterol: 61 mg 20 %",
				"Sodium: 1058 mg 42 %"
			],
			"comment": "Use your slow cooker to prepare this great twist on basic barbecue chicken. Throw the chicken breasts in frozen, and serve with baked potatoes.",
			"cal": 300,
			"total_time": 500,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/879977.jpg",
			"ingredients": [
				"6 frozen skinless, boneless chicken breast halves ",
				" 1 (12 ounce) bottle barbeque sauce ",
				" 1/2 cup Italian salad dressing ",
				" 1/4 cup brown sugar ",
				" 2 tablespoons Worcestershire sauce "
			]
		},
		{
			"name": "Slow Cooker Belgian Chicken Booyah",
			"reviews": "33",
			"directions": "Mix chicken, potatoes, beef, corn, carrots, green beans, chicken broth, beef broth, diced tomatoes, onion, celery, bell pepper, cabbage, salt, basil, oregano, celery salt, black pepper, and vegetable base in a slow cooker. Cook on Low for 6 hours.",
			"rating": "3.83783793449402",
			"cook_time": 360,
			"ready_in_time": 385,
			"id": 20126,
			"prep_time": 25,
			"nutrition": [
				"Calories: 256 kcal 13 %",
				"Fat: 10.8 g 17 %",
				"Carbs: 18.6g 6 %",
				"Protein: 21.3 g 43 %",
				"Cholesterol: 63 mg 21 %",
				"Sodium: 2144 mg 86 %"
			],
			"comment": "This is a booyah recipe that is adapted from originally a 50 gallon recipe cooked in large 55 gallon cast-iron kettles with a wood fire, most often at church picnics in northeastern Wisconsin.",
			"cal": 256,
			"total_time": 770,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2186700.jpg",
			"ingredients": [
				"4 pounds skinless, boneless chicken thighs, cut into 1-inch pieces ",
				" 2 pounds red potatoes, cut in 1-inch pieces ",
				" 1 pound beef stew meat, cut into bite-size pieces (optional) ",
				" 1 (16 ounce) package frozen whole kernel corn ",
				" 1 (16 ounce) package frozen cut carrots ",
				" 1 (15 ounce) can cut green beans, drained ",
				" 1 (14.5 ounce) can chicken broth ",
				" 1 (14.5 ounce) can beef broth ",
				" 1 (14.5 ounce) can petite diced tomatoes ",
				" 8 ounces diced onion ",
				" 8 ounces diced celery ",
				" 8 ounces diced green bell pepper ",
				" 8 ounces cabbage, shredded ",
				" 1/4 cup salt ",
				" 2 tablespoons dried basil ",
				" 2 tablespoons dried oregano ",
				" 2 tablespoons celery salt ",
				" 1 tablespoon ground black pepper ",
				" 1 0.42 oz packet concentrated vegetable base (such as Swanson® Vegetable Flavor Boost®) "
			]
		},
		{
			"name": "Chef John's Salt Roasted Chicken",
			"reviews": "201",
			"directions": "Preheat oven to 450 degrees F (230 degrees C). Dry the outside of chicken with paper towels. Tuck the wing tips underneath the chicken and place into a large oven-safe skillet. Use scissors to snip off the tail, if desired. Generously sprinkle kosher salt into the cavity and over the back and sides of chicken. Tie chicken legs together with kitchen twine. Sprinkle salt generously over the breasts, coating them thoroughly. Wipe excess salt out of skillet with paper towels. Bake chicken in the preheated oven until an instant-read meat thermometer inserted into a thigh, not touching bone, reads 160 degrees C (70 degrees C), 50 to 60 minutes. Remove from skillet to a serving platter and let rest 5 to 10 minutes. Blot about 90 percent of the chicken fat from the skillet with a paper towel held with tongs, leaving the browned bits of food in the skillet. Place skillet over medium-high heat and add thyme leaves. Cook and stir until thyme is wilted, 1 to 2 minutes. Pour lemon juice, chicken broth, and water into skillet, stirring until the browned bits dissolve and the sauce has reduced by about half, 1 to 2 minutes. Reduce heat to low, add cold butter, and stir until butter has begun to melt. Add any accumulated juices from the chicken to sauce and continue to stir until butter is incorporated and sauce is slightly thickened, about 1 minute. Remove from heat and season with salt, black pepper, and cayenne pepper to taste. Spoon sauce over chicken to serve.",
			"rating": "4.66666650772095",
			"cook_time": 55,
			"ready_in_time": 75,
			"id": 20127,
			"prep_time": 15,
			"nutrition": [
				"Calories: 554 kcal 28 %",
				"Fat: 35.7 g 55 %",
				"Carbs: 1.2g < 1 %",
				"Protein: 53.7 g 107 %",
				"Cholesterol: 185 mg 62 %",
				"Sodium: 4604 mg 184 %"
			],
			"comment": "This is one of those rare recipes where the name is the same as the ingredient list. You're going to be so shocked at how flavorful, juicy, and amazing this roast chicken comes out.",
			"cal": 554,
			"total_time": 145,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3715188.jpg",
			"ingredients": [
				"1 (3 1/2) pound whole chicken at room temperature ",
				" 3 tablespoons kosher salt, or as needed ",
				" 1 tablespoon chopped fresh thyme ",
				" 1 lemon, juiced ",
				" 1/3 cup chicken broth ",
				" 1 tablespoon water, or as needed (optional) ",
				" 2 tablespoons cold butter, cut into four pieces ",
				" salt and freshly ground black pepper to taste ",
				" 1 pinch cayenne pepper, or to taste "
			]
		},
		{
			"name": "Buffalo Chicken Dip",
			"reviews": "3274",
			"directions": "Heat chicken and hot sauce in a skillet over medium heat, until heated through. Stir in cream cheese and ranch dressing. Cook, stirring until well blended and warm. Mix in half of the shredded cheese, and transfer the mixture to a slow cooker. Sprinkle the remaining cheese over the top, cover, and cook on Low setting until hot and bubbly. Serve with celery sticks and crackers.",
			"rating": "4.70403099060059",
			"cook_time": 40,
			"ready_in_time": 45,
			"id": 20128,
			"prep_time": 5,
			"nutrition": [
				"Calories: 284 kcal 14 %",
				"Fat: 22.6 g 35 %",
				"Carbs: 8.6g 3 %",
				"Protein: 11.1 g 22 %",
				"Cholesterol: 54 mg 18 %",
				"Sodium: 552 mg 22 %"
			],
			"comment": "This tangy, creamy dip tastes just like Buffalo chicken wings. It's best served hot with crackers and celery sticks. Everyone loves the results!",
			"cal": 284,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3095600.jpg",
			"ingredients": [
				"2 (10 ounce) cans chunk chicken, drained ",
				" 2 (8 ounce) packages cream cheese, softened ",
				" 1 cup Ranch dressing ",
				" 3/4 cup pepper sauce (such as Frank's Red Hot®) ",
				" 1 1/2 cups shredded Cheddar cheese ",
				" 1 bunch celery, cleaned and cut into 4 inch pieces ",
				" 1 (8 ounce) box chicken-flavored crackers "
			]
		},
		{
			"name": "Roast Sticky Chicken-Rotisserie Style",
			"reviews": "3133",
			"directions": "In a small bowl, mix together salt, paprika, onion powder, thyme, white pepper, black pepper, cayenne pepper, and garlic powder. Remove and discard giblets from chicken. Rinse chicken cavity, and pat dry with paper towel. Rub each chicken inside and out with spice mixture. Place 1 onion into the cavity of each chicken. Place chickens in a resealable bag or double wrap with plastic wrap. Refrigerate overnight, or at least 4 to 6 hours. Preheat oven to 250 degrees F (120 degrees C). Place chickens in a roasting pan. Bake uncovered for 5 hours, to a minimum internal temperature of 180 degrees F (85 degrees C). Let the chickens stand for 10 minutes before carving.",
			"rating": "4.69669914245605",
			"cook_time": 300,
			"ready_in_time": 550,
			"id": 20129,
			"prep_time": 10,
			"nutrition": [
				"Calories: 586 kcal 29 %",
				"Fat: 34.3 g 53 %",
				"Carbs: 3.7g 1 %",
				"Protein: 61.7 g 123 %",
				"Cholesterol: 194 mg 65 %",
				"Sodium: 1351 mg 54 %"
			],
			"comment": "Ever wish you could get that restaurant-style rotisserie chicken at home? Well, with minimal preparation and about 5 hours' cooking time (great for the weekends!) you can! I don't bother to baste the bird, though some like to for the first hour. The pan juices always caramelize at the bottom, and the chicken will turn golden brown...fall-off-the-bone good!",
			"cal": 586,
			"total_time": 860,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/46458.jpg",
			"ingredients": [
				"4 teaspoons salt ",
				" 2 teaspoons paprika ",
				" 1 teaspoon onion powder ",
				" 1 teaspoon dried thyme ",
				" 1 teaspoon white pepper ",
				" 1/2 teaspoon cayenne pepper ",
				" 1/2 teaspoon black pepper ",
				" 1/2 teaspoon garlic powder ",
				" 2 onions, quartered ",
				" 2 (4 pound) whole chickens "
			]
		},
		{
			"name": "Chicken Breasts with Balsamic Vinegar and Garlic",
			"reviews": "2068",
			"directions": "Season the chicken with salt and pepper. Rinse the mushrooms and pat dry. Season the flour with salt and pepper and dredge the chicken breasts in the flour mixture. Heat oil in a skillet over medium high heat and saute the chicken until it is nicely browned on one side (about 3 minutes). Add the garlic. Turn the chicken breasts and scatter the mushrooms over them. Continue frying, shaking the skillet and stirring the mushrooms. Cook for about 3 minutes, then add the vinegar, broth, bay leaf and thyme. Cover tightly and simmer over medium low heat for 10 minutes, turning occasionally. Transfer the chicken to a warm serving platter and cover with foil. Set aside. Continue simmering the sauce, uncovered, over medium high heat for about 7 minutes. Swirl in the butter or margarine and discard the bay leaf. Pour this mushroom sauce mixture over the chicken and serve.",
			"rating": "4.42934608459473",
			"cook_time": 25,
			"ready_in_time": 30,
			"id": 20130,
			"prep_time": 5,
			"nutrition": [
				"Calories: 268 kcal 13 %",
				"Fat: 11.6 g 18 %",
				"Carbs: 9.9g 3 %",
				"Protein: 30.9 g 62 %",
				"Cholesterol: 77 mg 26 %",
				"Sodium: 286 mg 11 %"
			],
			"comment": "This is a quick, easy and impressive gourmet dish. Goes great with roasted new potatoes.",
			"cal": 268,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/335668.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breasts ",
				" salt and pepper to taste ",
				" 3/4 pound fresh mushrooms, sliced ",
				" 2 tablespoons all-purpose flour ",
				" 2 tablespoons olive oil ",
				" 6 cloves garlic ",
				" 1/4 cup balsamic vinegar ",
				" 3/4 cup chicken broth ",
				" 1 bay leaf ",
				" 1/4 teaspoon dried thyme ",
				" 1 tablespoon butter "
			]
		},
		{
			"name": "Famous Butter Chicken",
			"reviews": "2249",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Place eggs and cracker crumbs in two separate shallow bowls. Mix cracker crumbs with garlic salt and pepper. Dip chicken in the eggs, then dredge in the crumb mixture to coat. Arrange coated chicken in a 9x13 inch baking dish. Place pieces of butter around the chicken. Bake in the preheated oven for 40 minutes, or until chicken is no longer pink and juices run clear.",
			"rating": "4.566481590271",
			"cook_time": 40,
			"ready_in_time": 55,
			"id": 20131,
			"prep_time": 15,
			"nutrition": [
				"Calories: 448 kcal 22 %",
				"Fat: 31.2 g 48 %",
				"Carbs: 9.3g 3 %",
				"Protein: 31.6 g 63 %",
				"Cholesterol: 222 mg 74 %",
				"Sodium: 639 mg 26 %"
			],
			"comment": "Chicken breasts are dipped in beaten eggs and cracker crumbs, then baked with butter. These chicken breast are really tender and moist. Excellent flavor! I never have leftovers.",
			"cal": 448,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/296379.jpg",
			"ingredients": [
				"2 eggs, beaten ",
				" 1 cup crushed buttery round cracker crumbs ",
				" 1/2 teaspoon garlic salt ",
				" ground black pepper to taste ",
				" 4 skinless, boneless chicken breast halves ",
				" 1/2 cup butter, cut into pieces "
			]
		},
		{
			"name": "Aussie Chicken",
			"reviews": "2047",
			"directions": "Rub the chicken breasts with the seasoning salt, cover and refrigerate for 30 minutes. Preheat oven to 350 degrees F (175 degrees C). Place bacon in a large, deep skillet. Cook over medium high heat until crisp. Set aside. In a medium bowl, combine the mustard, honey, corn syrup, mayonnaise and dried onion flakes. Remove half of sauce, cover and refrigerate to serve later. Heat oil in a large skillet over medium heat. Place the breasts in the skillet and saute for 3 to 5 minutes per side, or until browned. Remove from skillet and place the breasts into a 9x13 inch baking dish. Apply the honey mustard sauce to each breast, then layer each breast with mushrooms and bacon. Sprinkle top with shredded cheese. Bake in preheated oven for 15 minutes, or until cheese is melted and chicken juices run clear. Garnish with parsley and serve with the reserved honey mustard sauce.",
			"rating": "4.61182355880737",
			"cook_time": 25,
			"ready_in_time": 80,
			"id": 20132,
			"prep_time": 25,
			"nutrition": [
				"Calories: 813 kcal 41 %",
				"Fat: 46.1 g 71 %",
				"Carbs: 57.1g 18 %",
				"Protein: 47.2 g 94 %",
				"Cholesterol: 153 mg 51 %",
				"Sodium: 1807 mg 72 %"
			],
			"comment": "This recipe is very similar to a chicken dish served at a local well-known restaurant. A friend of mine was kind enough to share it. It includes chicken breasts topped with mushrooms, bacon and cheese cooked in a honey-mustard sauce.",
			"cal": 813,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/708833.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ",
				" 2 teaspoons seasoning salt ",
				" 6 slices bacon, cut in half ",
				" 1/2 cup prepared yellow mustard ",
				" 1/2 cup honey ",
				" 1/4 cup light corn syrup ",
				" 1/4 cup mayonnaise ",
				" 1 tablespoon dried onion flakes ",
				" 1 tablespoon vegetable oil ",
				" 1 cup sliced fresh mushrooms ",
				" 2 cups shredded Colby-Monterey Jack cheese ",
				" 2 tablespoons chopped fresh parsley "
			]
		},
		{
			"name": "Yummy Honey Chicken Kabobs",
			"reviews": "1823",
			"directions": "In a large bowl, whisk together oil, honey, soy sauce, and pepper. Before adding chicken, reserve a small amount of marinade to brush onto kabobs while cooking. Place the chicken, garlic, onions and peppers in the bowl, and marinate in the refrigerator at least 2 hours (the longer the better). Preheat the grill for high heat. Drain marinade from the chicken and vegetables, and discard marinade. Thread chicken and vegetables alternately onto the skewers. Lightly oil the grill grate. Place the skewers on the grill. Cook for 12 to 15 minutes, until chicken juices run clear. Turn and brush with reserved marinade frequently.",
			"rating": "4.68674278259277",
			"cook_time": 15,
			"ready_in_time": 150,
			"id": 20133,
			"prep_time": 15,
			"nutrition": [
				"Calories: 178 kcal 9 %",
				"Fat: 6.6 g 10 %",
				"Carbs: 12.4g 4 %",
				"Protein: 17.4 g 35 %",
				"Cholesterol: 45 mg 15 %",
				"Sodium: 442 mg 18 %"
			],
			"comment": "Honey chicken kabobs with veggies. You can marinate overnight and make these kabobs for an outdoor barbecue as a tasty alternative to the usual barbecue fare! Fresh mushrooms and cherry tomatoes can also be used. (This can also be done in the broiler.)",
			"cal": 178,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1017234.jpg",
			"ingredients": [
				"1/4 cup vegetable oil ",
				" 1/3 cup honey ",
				" 1/3 cup soy sauce ",
				" 1/4 teaspoon ground black pepper ",
				" 8 skinless, boneless chicken breast halves - cut into 1 inch cubes ",
				" 2 cloves garlic ",
				" 5 small onions, cut into 2 inch pieces ",
				" 2 red bell peppers, cut into 2 inch pieces ",
				" skewers "
			]
		},
		{
			"name": "Angela's Awesome Enchiladas",
			"reviews": "1757",
			"directions": "Place the chicken in a large pot and add water to cover. Bring to a boil over high heat, then reduce the heat to medium-low, cover, and simmer until the chicken pieces are no longer pink, about 10 minutes. Shred chicken by placing two forks back to back and pulling meat apart. Set the shredded chicken aside. Meanwhile, combine the cream of chicken soup, sour cream, and chili powder in a saucepan. Bring to a simmer over low heat, stirring occasionally, then turn off the heat and cover to keep warm. Heat the butter in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Add the shredded chicken, chopped green chilies, taco seasoning, half of the bunch of chopped green onion, and water. Allow to simmer for 10 minutes. Stir in the lime juice, onion powder, and garlic powder; simmer for an additional 10 minutes. Preheat an oven to 350 degrees F (175 degrees C). Stir 1 cup of the soup mixture into the skillet with the chicken mixture. Spread the remaining soup mixture on the bottom of a 9x13 inch baking dish. Fill each tortilla with chicken mixture. Sprinkle Cheddar cheese over the chicken filling before folding the tortillas, reserving half of the shredded cheese for topping the enchiladas. Fold tortillas over the filling and place seam-side down in the prepared pan. Pour enchilada sauce evenly over the enchiladas. Cover with the remaining 1 1/2 cups of Cheddar cheese. Sprinkle the reserved chopped green onions and the sliced olives on top of the cheese. Bake in the preheated oven until filling is heated through and the cheese is melted and bubbling, about 25 minutes.",
			"rating": "4.71995210647583",
			"cook_time": 60,
			"ready_in_time": 105,
			"id": 20134,
			"prep_time": 45,
			"nutrition": [
				"Calories: 709 kcal 35 %",
				"Fat: 36.3 g 56 %",
				"Carbs: 52.5g 17 %",
				"Protein: 42.2 g 84 %",
				"Cholesterol: 126 mg 42 %",
				"Sodium: 1764 mg 71 %"
			],
			"comment": "The secret is in the seasonings! I whipped these up on my own using stuff I had on hand. Shredding the chicken is the most time-consuming step, but it's worth it in the end. Give these babies a try! Serve with sour cream and a side of Spanish rice.",
			"cal": 709,
			"total_time": 210,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/683438.jpg",
			"ingredients": [
				"2 pounds skinless, boneless chicken breast meat - cut into chunks ",
				" 1 (10.75 ounce) can condensed cream of chicken soup ",
				" 1 1/4 cups sour cream ",
				" 1/4 teaspoon chili powder ",
				" 1 tablespoon butter ",
				" 1 small onion, chopped ",
				" 1 (4 ounce) can chopped green chilies, drained ",
				" 1 (1.25 ounce) package mild taco seasoning mix ",
				" 1 bunch green onions, chopped, divided ",
				" 1 cup water ",
				" 1 teaspoon lime juice ",
				" 1/2 teaspoon onion powder ",
				" 1/2 teaspoon garlic powder ",
				" 5 (12 inch) flour tortillas ",
				" 3 cups Cheddar cheese, shredded, divided ",
				" 1 (10 ounce) can enchilada sauce ",
				" 1 (6 ounce) can sliced black olives "
			]
		},
		{
			"name": "Chicken Tikka Masala",
			"reviews": "2026",
			"directions": "In a large bowl, combine yogurt, lemon juice, 2 teaspoons cumin, cinnamon, cayenne, black pepper, ginger, and 4 teaspoons salt. Stir in chicken, cover, and refrigerate for 1 hour. Preheat a grill for high heat. Lightly oil the grill grate. Thread chicken onto skewers, and discard marinade. Grill until juices run clear, about 5 minutes on each side. Melt butter in a large heavy skillet over medium heat. Saute garlic and jalapeno for 1 minute. Season with 2 teaspoons cumin, paprika, and 3 teaspoons salt. Stir in tomato sauce and cream. Simmer on low heat until sauce thickens, about 20 minutes. Add grilled chicken, and simmer for 10 minutes. Transfer to a serving platter, and garnish with fresh cilantro.",
			"rating": "4.38589859008789",
			"cook_time": 50,
			"ready_in_time": 140,
			"id": 20135,
			"prep_time": 30,
			"nutrition": [
				"Calories: 404 kcal 20 %",
				"Fat: 28.9 g 44 %",
				"Carbs: 13.3g 4 %",
				"Protein: 24.6 g 49 %",
				"Cholesterol: 143 mg 48 %",
				"Sodium: 4499 mg 180 %"
			],
			"comment": "This is an easy recipe for Chicken Tikka Masala - Chicken marinated in yogurt and spices and then served in a tomato cream sauce. Serve with rice or warm pita bread.",
			"cal": 404,
			"total_time": 220,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/39905.jpg",
			"ingredients": [
				"1 cup yogurt ",
				" 1 tablespoon lemon juice ",
				" 2 teaspoons ground cumin ",
				" 1 teaspoon ground cinnamon ",
				" 2 teaspoons cayenne pepper ",
				" 2 teaspoons freshly ground black pepper ",
				" 1 tablespoon minced fresh ginger ",
				" 4 teaspoons salt, or to taste ",
				" 3 boneless skinless chicken breasts, cut into bite-size pieces ",
				" 4 long skewers ",
				" 1 tablespoon butter ",
				" 1 clove garlic, minced ",
				" 1 jalapeno pepper, finely chopped ",
				" 2 teaspoons ground cumin ",
				" 2 teaspoons paprika ",
				" 1 tablespoon salt, or to taste ",
				" 1 (8 ounce) can tomato sauce ",
				" 1 cup heavy cream ",
				" 1/4 cup chopped fresh cilantro "
			]
		},
		{
			"name": "Quick and Easy Chicken Noodle Soup",
			"reviews": "1801",
			"directions": "In a large pot over medium heat, melt butter. Cook onion and celery in butter until just tender, 5 minutes. Pour in chicken and vegetable broths and stir in chicken, noodles, carrots, basil, oregano, salt and pepper. Bring to a boil, then reduce heat and simmer 20 minutes before serving.",
			"rating": "4.70436811447144",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 20136,
			"prep_time": 10,
			"nutrition": [
				"Calories: 161 kcal 8 %",
				"Fat: 6.1 g 9 %",
				"Carbs: 12.1g 4 %",
				"Protein: 13.4 g 27 %",
				"Cholesterol: 46 mg 15 %",
				"Sodium: 1357 mg 54 %"
			],
			"comment": "When you don't have time to make your soup totally from scratch, this is a very easy, very good substitute.",
			"cal": 161,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1261155.jpg",
			"ingredients": [
				"1 tablespoon butter ",
				" 1/2 cup chopped onion ",
				" 1/2 cup chopped celery ",
				" 4 (14.5 ounce) cans chicken broth ",
				" 1 (14.5 ounce) can vegetable broth ",
				" 1/2 pound chopped cooked chicken breast ",
				" 1 1/2 cups egg noodles ",
				" 1 cup sliced carrots ",
				" 1/2 teaspoon dried basil ",
				" 1/2 teaspoon dried oregano ",
				" salt and pepper to taste "
			]
		},
		{
			"name": "Baked Honey Mustard Chicken",
			"reviews": "1759",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Sprinkle chicken breasts with salt and pepper to taste, and place in a lightly greased 9x13 inch baking dish. In a small bowl, combine the honey, mustard, basil, paprika, and parsley. Mix well. Pour 1/2 of this mixture over the chicken, and brush to cover. Bake in the preheated oven for 30 minutes. Turn chicken pieces over and brush with the remaining 1/2 of the honey mustard mixture. Bake for an additional 10 to 15 minutes, or until chicken is no longer pink and juices run clear. Let cool 10 minutes before serving.",
			"rating": "4.21302700042725",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 20137,
			"prep_time": 15,
			"nutrition": [
				"Calories: 232 kcal 12 %",
				"Fat: 3.7 g 6 %",
				"Carbs: 24.8g 8 %",
				"Protein: 25.6 g 51 %",
				"Cholesterol: 67 mg 22 %",
				"Sodium: 296 mg 12 %"
			],
			"comment": "Quick and easy to prepare, and the kids love it too!",
			"cal": 232,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3264007.jpg",
			"ingredients": [
				"6 skinless, boneless chicken breast halves ",
				" salt and pepper to taste ",
				" 1/2 cup honey ",
				" 1/2 cup prepared mustard ",
				" 1 teaspoon dried basil ",
				" 1 teaspoon paprika ",
				" 1/2 teaspoon dried parsley "
			]
		},
		{
			"name": "Lime Chicken Soft Tacos",
			"reviews": "1678",
			"directions": "Saute chicken in a medium saucepan over medium high heat for about 20 minutes. Add vinegar, lime juice, sugar, salt, pepper, green onion, garlic and oregano. Simmer for an extra 10 minutes. Heat an iron skillet over medium heat. Place a tortilla in the pan, warm, and turn over to heat the other side. Repeat with remaining tortillas. Serve lime chicken mixture in warm tortillas topped with tomato, lettuce, cheese and salsa.",
			"rating": "4.4313645362854",
			"cook_time": 30,
			"ready_in_time": 50,
			"id": 20138,
			"prep_time": 20,
			"nutrition": [
				"Calories: 204 kcal 10 %",
				"Fat: 6.8 g 10 %",
				"Carbs: 18.9g 6 %",
				"Protein: 16.2 g 32 %",
				"Cholesterol: 37 mg 12 %",
				"Sodium: 433 mg 17 %"
			],
			"comment": "I was given this recipe by my mom when I went away to college, and it has become all of my friends' favorite!",
			"cal": 204,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/642313.jpg",
			"ingredients": [
				"1 1/2 pounds skinless, boneless chicken breast meat - cubed ",
				" 1/8 cup red wine vinegar ",
				" 1/2 lime, juiced ",
				" 1 teaspoon white sugar ",
				" 1/2 teaspoon salt ",
				" 1/2 teaspoon ground black pepper ",
				" 2 green onions, chopped ",
				" 2 cloves garlic, minced ",
				" 1 teaspoon dried oregano ",
				" 10 (6 inch) flour tortillas ",
				" 1 tomato, diced ",
				" 1/4 cup shredded lettuce ",
				" 1/4 cup shredded Monterey Jack cheese ",
				" 1/4 cup salsa "
			]
		},
		{
			"name": "Anniversary Chicken I",
			"reviews": "2148",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). In a large skillet, heat oil over medium-high heat. Add chicken breasts, and saute 4 to 5 minutes each side, until lightly browned. Place browned chicken breasts in a 9x13 inch baking dish. Brush with teriyaki sauce, then spoon on salad dressing. Sprinkle with cheese, green onions and bacon bits. Bake for 25 to 35 minutes, or until chicken is no longer pink and juices run clear. Garnish with parsley and serve.",
			"rating": "4.40355491638184",
			"cook_time": 35,
			"ready_in_time": 65,
			"id": 20139,
			"prep_time": 30,
			"nutrition": [
				"Calories: 529 kcal 26 %",
				"Fat: 26.4 g 41 %",
				"Carbs: 6.7g 2 %",
				"Protein: 62.8 g 126 %",
				"Cholesterol: 167 mg 56 %",
				"Sodium: 894 mg 36 %"
			],
			"comment": "I made this chicken for 100 people at my in-laws' 50th wedding anniversary party. Boy, was it a hit!",
			"cal": 529,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/460386.jpg",
			"ingredients": [
				"2 tablespoons vegetable oil ",
				" 6 skinless, boneless chicken breast halves ",
				" 1/2 cup teriyaki basting sauce ",
				" 1/2 cup Ranch-style salad dressing ",
				" 1 cup shredded Cheddar cheese ",
				" 3 green onions, chopped ",
				" 1/2 (3 ounce) can bacon bits ",
				" 1 tablespoon chopped fresh parsley, for garnish "
			]
		},
		{
			"name": "Baked Garlic Parmesan Chicken",
			"reviews": "1795",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. In a bowl, blend the olive oil and garlic. In a separate bowl, mix the bread crumbs, Parmesan cheese, basil, and pepper. Dip each chicken breast in the oil mixture, then in the bread crumb mixture. Arrange the coated chicken breasts in the prepared baking dish, and top with any remaining bread crumb mixture. Bake 30 minutes in the preheated oven, or until chicken is no longer pink and juices run clear.",
			"rating": "4.39358472824097",
			"cook_time": 30,
			"ready_in_time": 45,
			"id": 20140,
			"prep_time": 15,
			"nutrition": [
				"Calories: 281 kcal 14 %",
				"Fat: 10.8 g 17 %",
				"Carbs: 13.7g 4 %",
				"Protein: 30.4 g 61 %",
				"Cholesterol: 75 mg 25 %",
				"Sodium: 326 mg 13 %"
			],
			"comment": "A wonderful baked chicken recipe that's quick and easy! Using just a few handy ingredients, create a delicious main dish, that also makes great leftovers - if there are any! Serve with a salad and pasta or rice for a quick, scrumptious dinner.",
			"cal": 281,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/618489.jpg",
			"ingredients": [
				"2 tablespoons olive oil ",
				" 1 clove garlic, minced ",
				" 1 cup dry bread crumbs ",
				" 2/3 cup grated Parmesan cheese ",
				" 1 teaspoon dried basil leaves ",
				" 1/4 teaspoon ground black pepper ",
				" 6 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Creamy Chicken and Wild Rice Soup",
			"reviews": "1753",
			"directions": "In a large pot over medium heat, combine broth, water and chicken. Bring just to boiling, then stir in rice, reserving seasoning packet. Cover and remove from heat. In a small bowl, combine salt, pepper and flour. In a medium saucepan over medium heat, melt butter. Stir in contents of seasoning packet until mixture is bubbly. Reduce heat to low, then stir in flour mixture by tablespoons, to form a roux. Whisk in cream, a little at a time, until fully incorporated and smooth. Cook until thickened, 5 minutes. Stir cream mixture into broth and rice. Cook over medium heat until heated through, 10 to 15 minutes.",
			"rating": "4.76516723632813",
			"cook_time": 20,
			"ready_in_time": 25,
			"id": 20141,
			"prep_time": 5,
			"nutrition": [
				"Calories: 462 kcal 23 %",
				"Fat: 36.5 g 56 %",
				"Carbs: 22.6g 7 %",
				"Protein: 12 g 24 %",
				"Cholesterol: 135 mg 45 %",
				"Sodium: 997 mg 40 %"
			],
			"comment": "A supremely filling, hearty soup. I serve this on cold rainy days with a loaf of homemade bread. Hint: this is perfect for leftover rotisserie chicken or chicken you've pulled from the bone after making homemade chicken stock! This soup makes great leftovers, but you might want to thin it slightly with skim milk or water when reheating.",
			"cal": 462,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/355161.jpg",
			"ingredients": [
				"4 cups chicken broth ",
				" 2 cups water ",
				" 2 cooked, boneless chicken breast halves, shredded ",
				" 1 (4.5 ounce) package quick cooking long grain and wild rice with seasoning packet ",
				" 1/2 teaspoon salt ",
				" 1/2 teaspoon ground black pepper ",
				" 3/4 cup all-purpose flour ",
				" 1/2 cup butter ",
				" 2 cups heavy cream "
			]
		},
		{
			"name": "Chicken Enchiladas I",
			"reviews": "1850",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). In a medium, non-stick skillet over medium heat, cook chicken until no longer pink and juices run clear. Drain excess fat. Cube the chicken and return it to the skillet. Add the onion, sour cream, Cheddar cheese, parsley, oregano and ground black pepper. Heat until cheese melts. Stir in salt, tomato sauce, water, chili powder, green pepper and garlic. Roll even amounts of the mixture in the tortillas. Arrange in a 9x13 inch baking dish. Cover with taco sauce and 3/4 cup Cheddar cheese. Bake uncovered in the preheated oven 20 minutes. Cool 10 minutes before serving.",
			"rating": "4.486496925354",
			"cook_time": 30,
			"ready_in_time": 90,
			"id": 20142,
			"prep_time": 30,
			"nutrition": [
				"Calories: 498 kcal 25 %",
				"Fat: 15.9 g 25 %",
				"Carbs: 49.7g 16 %",
				"Protein: 26.7 g 53 %",
				"Cholesterol: 72 mg 24 %",
				"Sodium: 1227 mg 49 %"
			],
			"comment": "This is a quick and easy recipe. Good for quick suppers.",
			"cal": 498,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/306964.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves ",
				" 1 onion, chopped ",
				" 1/2 pint sour cream ",
				" 1 cup shredded Cheddar cheese ",
				" 1 tablespoon dried parsley ",
				" 1/2 teaspoon dried oregano ",
				" 1/2 teaspoon ground black pepper ",
				" 1/2 teaspoon salt (optional) ",
				" 1 (15 ounce) can tomato sauce ",
				" 1/2 cup water ",
				" 1 tablespoon chili powder ",
				" 1/3 cup chopped green bell pepper ",
				" 1 clove garlic, minced ",
				" 8 (10 inch) flour tortillas ",
				" 1 (12 ounce) jar taco sauce ",
				" 3/4 cup shredded Cheddar cheese "
			]
		},
		{
			"name": "Honey Mustard Grilled Chicken",
			"reviews": "1644",
			"directions": "Preheat the grill for medium heat. In a shallow bowl, mix the mustard, honey, mayonnaise, and steak sauce. Set aside a small amount of the honey mustard sauce for basting, and dip the chicken into the remaining sauce to coat. Lightly oil the grill grate. Grill chicken over indirect heat for 18 to 20 minutes, turning occasionally, or until juices run clear. Baste occasionally with the reserved sauce during the last 10 minutes. Watch carefully to prevent burning!",
			"rating": "4.5361123085022",
			"cook_time": 20,
			"ready_in_time": 35,
			"id": 20143,
			"prep_time": 15,
			"nutrition": [
				"Calories: 266 kcal 13 %",
				"Fat: 8.3 g 13 %",
				"Carbs: 22g 7 %",
				"Protein: 24.7 g 49 %",
				"Cholesterol: 70 mg 23 %",
				"Sodium: 618 mg 25 %"
			],
			"comment": "'If ye have faith as a grain of mustard seed', ye shall make and enjoy this simple, tangy, delicious grilled chicken dish!",
			"cal": 266,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/438013.jpg",
			"ingredients": [
				"1/3 cup Dijon mustard ",
				" 1/4 cup honey ",
				" 2 tablespoons mayonnaise ",
				" 1 teaspoon steak sauce ",
				" 4 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Juicy Roasted Chicken",
			"reviews": "2059",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Place chicken in a roasting pan, and season generously inside and out with salt and pepper. Sprinkle inside and out with onion powder. Place 3 tablespoons margarine in the chicken cavity. Arrange dollops of the remaining margarine around the chicken's exterior. Cut the celery into 3 or 4 pieces, and place in the chicken cavity. Bake uncovered 1 hour and 15 minutes in the preheated oven, to a minimum internal temperature of 180 degrees F (82 degrees C). Remove from heat, and baste with melted margarine and drippings. Cover with aluminum foil, and allow to rest about 30 minutes before serving.",
			"rating": "4.71908044815063",
			"cook_time": 75,
			"ready_in_time": 100,
			"id": 20144,
			"prep_time": 10,
			"nutrition": [
				"Calories: 423 kcal 21 %",
				"Fat: 32.1 g 49 %",
				"Carbs: 1.2g < 1 %",
				"Protein: 30.9 g 62 %",
				"Cholesterol: 97 mg 32 %",
				"Sodium: 662 mg 26 %"
			],
			"comment": "My grandmother's recipe for roasted chicken. We are German and she used to do it this way all the time. I never have had a chicken this juicy before; this little trick works and makes the people eating it go silent. It's funny. We nibble on the celery after.",
			"cal": 423,
			"total_time": 185,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/926051.jpg",
			"ingredients": [
				"1 (3 pound) whole chicken, giblets removed ",
				" salt and black pepper to taste ",
				" 1 tablespoon onion powder, or to taste ",
				" 1/2 cup margarine, divided ",
				" 1 stalk celery, leaves removed "
			]
		},
		{
			"name": "Cajun Chicken Pasta",
			"reviews": "1777",
			"directions": "Bring a large pot of lightly salted water to a boil. Add linguini pasta, and cook for 8 to 10 minutes, or until al dente; drain. Meanwhile, place chicken and Cajun seasoning in a bowl, and toss to coat. In a large skillet over medium heat, saute chicken in butter until no longer pink and juices run clear, about 5 to 7 minutes. Add green and red bell peppers, sliced mushrooms and green onions; cook for 2 to 3 minutes. Reduce heat, and stir in heavy cream. Season the sauce with basil, lemon pepper, salt, garlic powder and ground black pepper, and heat through. In a large bowl, toss linguini with sauce. Sprinkle with grated Parmesan cheese.",
			"rating": "4.67443656921387",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 20145,
			"prep_time": 15,
			"nutrition": [
				"Calories: 1109 kcal 55 %",
				"Fat: 82.2 g 126 %",
				"Carbs: 53.7g 17 %",
				"Protein: 42.7 g 85 %",
				"Cholesterol: 348 mg 116 %",
				"Sodium: 1134 mg 45 %"
			],
			"comment": "Try this when you are feeling daring and want to mix things up a bit! A Southern inspired recipe that is sure to add a little fun to your dinner table. Try serving it with corn bread.",
			"cal": 1109,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/966179.jpg",
			"ingredients": [
				"4 ounces linguine pasta ",
				" 2 boneless, skinless chicken breast halves, sliced into thin strips ",
				" 2 teaspoons Cajun seasoning ",
				" 2 tablespoons butter ",
				" 1 green bell pepper, chopped ",
				" 1/2 red bell pepper, chopped ",
				" 4 fresh mushrooms, sliced ",
				" 1 green onion, minced ",
				" 1 1/2 cups heavy cream ",
				" 1/4 teaspoon dried basil ",
				" 1/4 teaspoon lemon pepper ",
				" 1/4 teaspoon salt ",
				" 1/8 teaspoon garlic powder ",
				" 1/8 teaspoon ground black pepper ",
				" 2 tablespoons grated Parmesan cheese "
			]
		},
		{
			"name": "Chicken Florentine Casserole",
			"reviews": "1824",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Place the chicken breast halves on a baking sheet; bake 20 to 30 minutes, until no longer pink and juices run clear. Remove from heat, and set aside. Increase the oven temperature to 400 degrees F (200 degrees C). Melt the butter in a medium saucepan over medium heat. Stirring constantly, mix in the garlic, lemon juice, cream of mushroom soup, Italian seasoning, half-and-half, and Parmesan cheese. Arrange the spinach over the bottom of a 9x9 inch baking dish. Cover the spinach with the mushrooms. Pour half the mixture from the saucepan over the mushrooms. Arrange chicken breasts in the dish, and cover with the remaining sauce mixture. Sprinkle with bacon bits, and top with mozzarella cheese. Bake 20 to 25 minutes in the 400 degrees F (200 degrees C) oven, until bubbly and lightly browned.",
			"rating": "4.42065095901489",
			"cook_time": 25,
			"ready_in_time": 50,
			"id": 20146,
			"prep_time": 25,
			"nutrition": [
				"Calories: 647 kcal 32 %",
				"Fat: 38 g 58 %",
				"Carbs: 17.6g 6 %",
				"Protein: 61.6 g 123 %",
				"Cholesterol: 168 mg 56 %",
				"Sodium: 1806 mg 72 %"
			],
			"comment": "Chicken Florentine casserole, which can also be adapted with either fish or shrimp, lies on a bed of spinach leaves and mushrooms, has a creamy white sauce mixed with garlic, Parmesan cheese, and Italian seasonings, and is topped with baked mozzarella.",
			"cal": 647,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/814302.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves ",
				" 1/4 cup butter ",
				" 3 teaspoons minced garlic ",
				" 1 tablespoon lemon juice ",
				" 1 (10.75 ounce) can condensed cream of mushroom soup ",
				" 1 tablespoon Italian seasoning ",
				" 1/2 cup half-and-half ",
				" 1/2 cup grated Parmesan cheese ",
				" 2 (13.5 ounce) cans spinach, drained ",
				" 4 ounces fresh mushrooms, sliced ",
				" 2/3 cup bacon bits ",
				" 2 cups shredded mozzarella cheese "
			]
		},
		{
			"name": "Artichoke Chicken",
			"reviews": "1943",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). In a medium bowl, mix together the artichoke hearts, Parmesan cheese, mayonnaise, and garlic pepper. Place chicken in a greased baking dish, and cover evenly with artichoke mixture. Bake, uncovered, for 30 minutes in the preheated oven, or until chicken is no longer pink in the center and juices run clear.",
			"rating": "4.40753984451294",
			"cook_time": 30,
			"ready_in_time": 40,
			"id": 20147,
			"prep_time": 10,
			"nutrition": [
				"Calories: 548 kcal 27 %",
				"Fat: 39.9 g 61 %",
				"Carbs: 13.4g 4 %",
				"Protein: 34.4 g 69 %",
				"Cholesterol: 96 mg 32 %",
				"Sodium: 1225 mg 49 %"
			],
			"comment": "This is the most flavorful chicken you will ever have in your life! It is melt in your mouth to die for!",
			"cal": 548,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1127678.jpg",
			"ingredients": [
				"1 (15 ounce) can artichoke hearts, drained and chopped ",
				" 3/4 cup grated Parmesan cheese ",
				" 3/4 cup mayonnaise ",
				" 1 pinch garlic pepper ",
				" 4 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Spicy Garlic Lime Chicken",
			"reviews": "1934",
			"directions": "In a small bowl, mix together salt, black pepper, cayenne, paprika, 1/4 teaspoon garlic powder, onion powder, thyme and parsley. Sprinkle spice mixture generously on both sides of chicken breasts. Heat butter and olive oil in a large heavy skillet over medium heat. Saute chicken until golden brown, about 6 minutes on each side. Sprinkle with 2 teaspoons garlic powder and lime juice. Cook 5 minutes, stirring frequently to coat evenly with sauce.",
			"rating": "4.56118154525757",
			"cook_time": 20,
			"ready_in_time": 25,
			"id": 20148,
			"prep_time": 5,
			"nutrition": [
				"Calories: 220 kcal 11 %",
				"Fat: 10.7 g 16 %",
				"Carbs: 2.4g < 1 %",
				"Protein: 27.7 g 55 %",
				"Cholesterol: 84 mg 28 %",
				"Sodium: 555 mg 22 %"
			],
			"comment": "A delightful chicken dish with a little spicy kick. Serve with rice and your favorite vegetable.",
			"cal": 220,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3120204.jpg",
			"ingredients": [
				"3/4 teaspoon salt ",
				" 1/4 teaspoon black pepper ",
				" 1/4 teaspoon cayenne pepper ",
				" 1/8 teaspoon paprika ",
				" 1/4 teaspoon garlic powder ",
				" 1/8 teaspoon onion powder ",
				" 1/4 teaspoon dried thyme ",
				" 1/4 teaspoon dried parsley ",
				" 4 boneless, skinless chicken breast halves ",
				" 2 tablespoons butter ",
				" 1 tablespoon olive oil ",
				" 2 teaspoons garlic powder ",
				" 3 tablespoons lime juice "
			]
		},
		{
			"name": "Garlic Cheddar Chicken",
			"reviews": "1933",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Melt the butter in a saucepan over low heat, and cook the garlic until tender, about 5 minutes. In a shallow bowl, mix the bread crumbs, Parmesan cheese, Cheddar cheese, parsley, oregano, pepper, and salt. Dip each chicken breast in the garlic butter to coat, then press into the bread crumb mixture. Arrange the coated chicken breasts in a 9x13 inch baking dish. Drizzle with any remaining butter and top with any remaining bread crumb mixture. Bake 30 minutes in the preheated oven, or until chicken is no longer pink and juices run clear.",
			"rating": "4.60240983963013",
			"cook_time": 40,
			"ready_in_time": 55,
			"id": 20149,
			"prep_time": 15,
			"nutrition": [
				"Calories: 400 kcal 20 %",
				"Fat: 24.9 g 38 %",
				"Carbs: 8.4g 3 %",
				"Protein: 34.5 g 69 %",
				"Cholesterol: 129 mg 43 %",
				"Sodium: 488 mg 20 %"
			],
			"comment": "Chicken breasts dipped in garlic butter and Cheddar bread crumbs. NEVER have any leftovers!",
			"cal": 400,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/26754.jpg",
			"ingredients": [
				"1/2 cup butter ",
				" 4 cloves garlic, minced ",
				" 3/4 cup dry bread crumbs ",
				" 1/2 cup freshly grated Parmesan cheese ",
				" 1 1/2 cups shredded Cheddar cheese ",
				" 1/4 teaspoon dried parsley ",
				" 1/4 teaspoon dried oregano ",
				" 1/4 teaspoon ground black pepper ",
				" 1/8 teaspoon salt ",
				" 8 skinless, boneless chicken breast halves - pounded thin "
			]
		},
		{
			"name": "Chicken Breasts Pierre",
			"reviews": "1545",
			"directions": "In a shallow dish or bowl, combine flour, 1/2 teaspoon salt and ground black pepper. Coat chicken breasts with flour mixture. Melt butter in a large skillet over medium heat, and brown chicken on all sides. Remove from skillet, and drain on paper towels. In the same skillet, combine the tomatoes, water, brown sugar, vinegar and Worcestershire sauce. Season with salt, chili powder, mustard, celery seed, garlic and hot pepper sauce. Bring to a boil; reduce heat, and return chicken to skillet. Cover, and simmer for 35 to 40 minutes, or until chicken is tender, no longer pink and juices run clear.",
			"rating": "4.55428028106689",
			"cook_time": 40,
			"ready_in_time": 70,
			"id": 20150,
			"prep_time": 30,
			"nutrition": [
				"Calories: 247 kcal 12 %",
				"Fat: 7.8 g 12 %",
				"Carbs: 14.8g 5 %",
				"Protein: 28.8 g 58 %",
				"Cholesterol: 84 mg 28 %",
				"Sodium: 915 mg 37 %"
			],
			"comment": "One of my husband's favorites. I've been making this for over fifteen years, and he's not sick of it yet! Serve with pan sauces, crusty French bread and a tossed green salad.",
			"cal": 247,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1056183.jpg",
			"ingredients": [
				"6 skinless, boneless chicken breast halves ",
				" 1/4 cup all-purpose flour ",
				" 1/2 teaspoon salt ",
				" 1 pinch ground black pepper ",
				" 3 tablespoons butter ",
				" 1 (14.5 ounce) can stewed tomatoes, with liquid ",
				" 1/2 cup water ",
				" 2 tablespoons brown sugar ",
				" 2 tablespoons distilled white vinegar ",
				" 2 tablespoons Worcestershire sauce ",
				" 1 teaspoon salt ",
				" 2 teaspoons chili powder ",
				" 1 teaspoon mustard powder ",
				" 1/2 teaspoon celery seed ",
				" 1 clove garlic, minced ",
				" 1/8 teaspoon hot pepper sauce "
			]
		},
		{
			"name": "Caramelized Baked Chicken",
			"reviews": "1684",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Place chicken in a 9x13 inch baking dish. Mix together the oil, soy sauce, ketchup, honey, garlic, salt and pepper. Pour over the chicken. Bake in preheated oven for one hour, or until sauce is caramelized.",
			"rating": "4.36785554885864",
			"cook_time": 60,
			"ready_in_time": 75,
			"id": 20151,
			"prep_time": 15,
			"nutrition": [
				"Calories: 393 kcal 20 %",
				"Fat: 15.6 g 24 %",
				"Carbs: 49.6g 16 %",
				"Protein: 16.8 g 34 %",
				"Cholesterol: 48 mg 16 %",
				"Sodium: 1307 mg 52 %"
			],
			"comment": "Roast chicken pieces with sticky, sweet and tangy coating.",
			"cal": 393,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/432846.jpg",
			"ingredients": [
				"3 pounds chicken wings ",
				" 2 tablespoons olive oil ",
				" 1/2 cup soy sauce ",
				" 2 tablespoons ketchup ",
				" 1 cup honey ",
				" 1 clove garlic, minced ",
				" salt and pepper to taste "
			]
		},
		{
			"name": "Cha Cha's White Chicken Chili",
			"reviews": "1677",
			"directions": "Heat the oil in a large saucepan over medium-low heat. Slowly cook and stir the onion until tender. Mix in the garlic, jalapeno, green chile peppers, cumin, oregano and cayenne. Continue to cook and stir the mixture until tender, about 3 minutes. Mix in the chicken broth, chicken and white beans. Simmer 15 minutes, stirring occasionally. Remove the mixture from heat. Slowly stir in the cheese until melted. Serve warm.",
			"rating": "4.6701979637146",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 20152,
			"prep_time": 10,
			"nutrition": [
				"Calories: 684 kcal 34 %",
				"Fat: 16.8 g 26 %",
				"Carbs: 74.9g 24 %",
				"Protein: 59.1 g 118 %",
				"Cholesterol: 102 mg 34 %",
				"Sodium: 1896 mg 76 %"
			],
			"comment": "Delicious white bean chili. Cha Cha says: 'It's kinda spicy, so watch out!' Substitute mild green chiles for the jalapenos if you're scared! Use more chicken and cheese as desired.",
			"cal": 684,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/631578.jpg",
			"ingredients": [
				"1 tablespoon vegetable oil ",
				" 1 onion, chopped ",
				" 3 cloves garlic, crushed ",
				" 1 (4 ounce) can diced jalapeno peppers ",
				" 1 (4 ounce) can chopped green chile peppers ",
				" 2 teaspoons ground cumin ",
				" 1 teaspoon dried oregano ",
				" 1 teaspoon ground cayenne pepper ",
				" 2 (14.5 ounce) cans chicken broth ",
				" 3 cups chopped cooked chicken breast ",
				" 3 (15 ounce) cans white beans ",
				" 1 cup shredded Monterey Jack cheese "
			]
		},
		{
			"name": "Slow Cooker Buffalo Chicken Sandwiches",
			"reviews": "1618",
			"directions": "Place the chicken breasts into a slow cooker, and pour in 3/4 of the wing sauce and the ranch dressing mix. Cover, and cook on Low for 6 to 7 hours. Once the chicken has cooked, add the butter, and shred the meat finely with two forks. Pile the meat onto the hoagie rolls, and splash with the remaining buffalo wing sauce to serve.",
			"rating": "4.34289455413818",
			"cook_time": 420,
			"ready_in_time": 435,
			"id": 20153,
			"prep_time": 15,
			"nutrition": [
				"Calories: 578 kcal 29 %",
				"Fat: 14 g 21 %",
				"Carbs: 80.6g 26 %",
				"Protein: 31.3 g 63 %",
				"Cholesterol: 54 mg 18 %",
				"Sodium: 2902 mg 116 %"
			],
			"comment": "This is a spicy, hearty sandwich that will please those who love buffalo chicken wings. This recipe is perfect for those days spent watching football. I like to top these with blue cheese or ranch dressing.",
			"cal": 578,
			"total_time": 870,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/494608.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves ",
				" 1 (17.5 fluid ounce) bottle buffalo wing sauce, divided ",
				" 1/2 (1 ounce) package dry ranch salad dressing mix ",
				" 2 tablespoons butter ",
				" 6 hoagie rolls, split lengthwise "
			]
		},
		{
			"name": "Easy Garlic Broiled Chicken",
			"reviews": "1377",
			"directions": "Preheat the oven broiler. Lightly grease a baking pan. In a microwave safe bowl, mix the butter, garlic, soy sauce, pepper, and parsley. Cook 2 minutes on High in the microwave, or until butter is melted. Arrange chicken on the baking pan, and coat with the butter mixture, reserving some of the mixture for basting. Broil chicken 20 minutes in the preheated oven, until juices run clear, turning occasionally and basting with remaining butter mixture. Sprinkle with parsley to serve.",
			"rating": "4.51815700531006",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 20154,
			"prep_time": 10,
			"nutrition": [
				"Calories: 303 kcal 15 %",
				"Fat: 25.1 g 39 %",
				"Carbs: 2.3g < 1 %",
				"Protein: 16.8 g 34 %",
				"Cholesterol: 99 mg 33 %",
				"Sodium: 615 mg 25 %"
			],
			"comment": "This very easy dish works with any cut of chicken, skin on or off...even with whole split chickens. My family loves this and it takes no time at all. Don't omit the parsley.",
			"cal": 303,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/830908.jpg",
			"ingredients": [
				"1/2 cup butter ",
				" 3 tablespoons minced garlic ",
				" 3 tablespoons soy sauce ",
				" 1/4 teaspoon black pepper ",
				" 1 tablespoon dried parsley ",
				" 6 boneless chicken thighs, with skin ",
				" dried parsley, to taste "
			]
		},
		{
			"name": "Baked Slow Cooker Chicken",
			"reviews": "1342",
			"directions": "Wad three pieces of aluminum foil into 3 to 4 inch balls, and place them in the bottom of the slow cooker. Rinse the chicken, inside and out, under cold running water. Pat dry with paper towels. Season the chicken with the salt, pepper and paprika, and place in the slow cooker on top of the crumpled aluminum foil. Set the slow cooker to High for 1 hour, then turn down to Low for about 8 to 10 hours, or until the chicken is no longer pink and the juices run clear.",
			"rating": "4.2518105506897",
			"cook_time": 600,
			"ready_in_time": 620,
			"id": 20155,
			"prep_time": 20,
			"nutrition": [
				"Calories: 408 kcal 20 %",
				"Fat: 28.5 g 44 %",
				"Carbs: 0.2g < 1 %",
				"Protein: 35.2 g 70 %",
				"Cholesterol: 142 mg 47 %",
				"Sodium: 133 mg 5 %"
			],
			"comment": "Baked chicken in a slow cooker for busy people! Put the chicken on in the morning, and have golden brown baked chicken for dinner.",
			"cal": 408,
			"total_time": 1240,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/276313.jpg",
			"ingredients": [
				"1 (2 to 3 pound) whole chicken ",
				" salt and pepper to taste ",
				" 1 teaspoon paprika "
			]
		},
		{
			"name": "Colleen's Slow Cooker Jambalaya",
			"reviews": "1587",
			"directions": "In a slow cooker, mix the chicken, sausage, tomatoes with juice, onion, green bell pepper, celery, and broth. Season with oregano, parsley, Cajun seasoning, cayenne pepper, and thyme. Cover, and cook 7 to 8 hours on Low, or 3 to 4 hours on High. Stir in the shrimp during the last 30 minutes of cook time.",
			"rating": "4.4199366569519",
			"cook_time": 480,
			"ready_in_time": 500,
			"id": 20156,
			"prep_time": 20,
			"nutrition": [
				"Calories: 235 kcal 12 %",
				"Fat: 13.6 g 21 %",
				"Carbs: 6.1g 2 %",
				"Protein: 20.2 g 40 %",
				"Cholesterol: 99 mg 33 %",
				"Sodium: 688 mg 28 %"
			],
			"comment": "This recipe came about from a lot of experimenting over the years. My family and friends like this version the best. Serve over cooked rice.",
			"cal": 235,
			"total_time": 1000,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/258513.jpg",
			"ingredients": [
				"1 pound skinless, boneless chicken breast halves - cut into 1 inch cubes ",
				" 1 pound andouille sausage, sliced ",
				" 1 (28 ounce) can diced tomatoes with juice ",
				" 1 large onion, chopped ",
				" 1 large green bell pepper, chopped ",
				" 1 cup chopped celery ",
				" 1 cup chicken broth ",
				" 2 teaspoons dried oregano ",
				" 2 teaspoons dried parsley ",
				" 2 teaspoons Cajun seasoning ",
				" 1 teaspoon cayenne pepper ",
				" 1/2 teaspoon dried thyme ",
				" 1 pound frozen cooked shrimp without tails "
			]
		},
		{
			"name": "Six Can Chicken Tortilla Soup",
			"reviews": "1556",
			"directions": "Open the cans of corn, chicken broth, chunk chicken, black beans, and diced tomatoes with green chilies. Pour everything into a large saucepan or stock pot. Simmer over medium heat until chicken is heated through.",
			"rating": "4.5342812538147",
			"cook_time": 15,
			"ready_in_time": 20,
			"id": 20157,
			"prep_time": 5,
			"nutrition": [
				"Calories: 214 kcal 11 %",
				"Fat: 4.9 g 8 %",
				"Carbs: 27.2g 9 %",
				"Protein: 17.2 g 34 %",
				"Cholesterol: 32 mg 11 %",
				"Sodium: 1482 mg 59 %"
			],
			"comment": "Delicious and EASY zesty soup recipe that uses only 6 canned ingredients! Serve over tortilla chips, and top with shredded Cheddar cheese. Throw away the cans and no one will know that it is not from scratch!",
			"cal": 214,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/931547.jpg",
			"ingredients": [
				"1 (15 ounce) can whole kernel corn, drained ",
				" 2 (14.5 ounce) cans chicken broth ",
				" 1 (10 ounce) can chunk chicken ",
				" 1 (15 ounce) can black beans ",
				" 1 (10 ounce) can diced tomatoes with green chile peppers, drained "
			]
		},
		{
			"name": "Chicken Cordon Bleu I",
			"reviews": "1577",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Coat a 7x11 inch baking dish with nonstick cooking spray. Pound chicken breasts to 1/4 inch thickness. Sprinkle each piece of chicken on both sides with salt and pepper. Place 1 cheese slice and 1 ham slice on top of each breast. Roll up each breast, and secure with a toothpick. Place in baking dish, and sprinkle chicken evenly with bread crumbs. Bake for 30 to 35 minutes, or until chicken is no longer pink. Remove from oven, and place 1/2 cheese slice on top of each breast. Return to oven for 3 to 5 minutes, or until cheese has melted. Remove toothpicks, and serve immediately.",
			"rating": "4.61531686782837",
			"cook_time": 35,
			"ready_in_time": 45,
			"id": 20158,
			"prep_time": 10,
			"nutrition": [
				"Calories: 419 kcal 21 %",
				"Fat: 19.4 g 30 %",
				"Carbs: 12.6g 4 %",
				"Protein: 46.1 g 92 %",
				"Cholesterol: 124 mg 41 %",
				"Sodium: 932 mg 37 %"
			],
			"comment": "This entree is easy and delicious! It's one of my husband's favorites! Try to use the largest chicken breasts you can find so you'll be able to roll them easier.",
			"cal": 419,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/594900.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves ",
				" 1/4 teaspoon salt ",
				" 1/8 teaspoon ground black pepper ",
				" 6 slices Swiss cheese ",
				" 4 slices cooked ham ",
				" 1/2 cup seasoned bread crumbs "
			]
		},
		{
			"name": "Chicken Milano",
			"reviews": "1571",
			"directions": "In a large saucepan over low heat, melt butter; add garlic and cook for 30 seconds. Add the tomatoes and 3/4 cup of the chicken broth; increase to medium heat and bring to a boil. Reduce heat and simmer, uncovered, for about 10 minutes or until the tomatoes are tender. Add the cream and bring to a boil; stirring. Simmer over medium heat until the sauce is thick enough to coat the back of a spoon. Sprinkle the chicken with salt and pepper on both sides. In a large skillet over medium heat, warm oil and saute chicken. Press on chicken occasionally with a slotted spatula. Cook for about 4 minutes per side or until the meat feels springy and is no longer pink inside. Transfer to a board; cover and keep warm. Discard the fat from the skillet. In the same skillet, over medium heat, bring 1/4 cup chicken broth to a boil; stirring the pan juices. Reduce slightly and add to the cream sauce; stir in basil and adjust seasonings to taste. Meanwhile, bring a large pot of lightly salted water to a boil. Add fettuccine and cook for 8 to 10 minutes or until al dente; drain, transfer to a bowl and toss with 3 to 4 tablespoons of the sauce. Cut each chicken breast into 2 to 3 diagonal slices. Reheat the sauce gently if needed. Transfer the pasta to serving plates; top with chicken and coat with the cream sauce; serve.",
			"rating": "4.62380123138428",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 20159,
			"prep_time": 10,
			"nutrition": [
				"Calories: 641 kcal 32 %",
				"Fat: 34.8 g 54 %",
				"Carbs: 47g 15 %",
				"Protein: 36.3 g 73 %",
				"Cholesterol: 156 mg 52 %",
				"Sodium: 501 mg 20 %"
			],
			"comment": "A delicious pasta and chicken dish with garlic, sun-dried tomatoes and fresh basil. Use the dry packaged sun-dried tomatoes instead of the tomatoes packed in olive oil. The sauce can be kept, covered, for one day in the refrigerator; heat again over low heat. Try it with some crusty bread if desired.",
			"cal": 641,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3741.jpg",
			"ingredients": [
				"1 tablespoon butter ",
				" 2 cloves garlic, minced ",
				" 1/2 cup sun-dried tomatoes, chopped ",
				" 1 cup chicken broth, divided ",
				" 1 cup heavy cream ",
				" 1 pound skinless, boneless chicken breast halves ",
				" salt and pepper to taste ",
				" 2 tablespoons vegetable oil ",
				" 2 tablespoons chopped fresh basil ",
				" 8 ounces dry fettuccini pasta "
			]
		},
		{
			"name": "Chicken Noodle Casserole I",
			"reviews": "1441",
			"directions": "Poach chicken in a large pot of simmering water. Cook until no longer pink in center, about 12 minutes. Remove from pot and set aside. Bring chicken cooking water to a boil and cook pasta in it. Drain. Cut chicken into small pieces, and mix with noodles. In a separate bowl, mix together mushroom soup, chicken soup, and sour cream. Season with salt and pepper. Gently stir together cream soup mixture with the chicken mixture. Place in a 2 quart baking dish. Melt butter in a small saucepan, and remove from heat. Stir in crumbled crackers. Top casserole with the buttery crackers. Bake at 350 degrees F (175 degrees C) for about 30 minutes, until heated through and browned on top.",
			"rating": "4.39989709854126",
			"cook_time": 30,
			"ready_in_time": 60,
			"id": 20160,
			"prep_time": 30,
			"nutrition": [
				"Calories: 542 kcal 27 %",
				"Fat: 34.2 g 53 %",
				"Carbs: 35.5g 11 %",
				"Protein: 23.3 g 47 %",
				"Cholesterol: 133 mg 44 %",
				"Sodium: 895 mg 36 %"
			],
			"comment": "Creamy chicken and noodle casserole topped with crushed crackers. Wonderful as leftovers topped with melted cheese!",
			"cal": 542,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/547762.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves ",
				" 6 ounces egg noodles ",
				" 1 (10.75 ounce) can condensed cream of mushroom soup ",
				" 1 (10.75 ounce) can condensed cream of chicken soup ",
				" 1 cup sour cream ",
				" salt to taste ",
				" ground black pepper to taste ",
				" 1 cup crumbled buttery round crackers ",
				" 1/2 cup butter "
			]
		},
		{
			"name": "Chicken Fried Chicken",
			"reviews": "1739",
			"directions": "Place crackers in a large resealable plastic bag; seal bag and crush crackers with a rolling pin until they are coarse crumbs. Add the flour, potato flakes, seasoned salt, and pepper and mix well. Beat egg in a shallow dish or bowl. One by one, dredge chicken pieces in egg, then place in bag with crumb mixture. Seal bag and shake to coat. Heat oil in a deep-fryer or large saucepan to 350 degrees F (175 degrees C). Fry chicken, turning frequently, until golden brown and juices run clear, 15 to 20 minutes.",
			"rating": "4.63825178146362",
			"cook_time": 20,
			"ready_in_time": 45,
			"id": 20162,
			"prep_time": 25,
			"nutrition": [
				"Calories: 887 kcal 44 %",
				"Fat: 79.6 g 123 %",
				"Carbs: 14.2g 5 %",
				"Protein: 29.2 g 58 %",
				"Cholesterol: 103 mg 34 %",
				"Sodium: 389 mg 16 %"
			],
			"comment": "A fun chicken recipe the kids can help prepare. They love crushing the crackers. It does not matter if the measurements aren't perfect, just wing it!",
			"cal": 887,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/262014.jpg",
			"ingredients": [
				"30 saltine crackers ",
				" 2 tablespoons all-purpose flour ",
				" 2 tablespoons dry potato flakes ",
				" 1 teaspoon seasoned salt ",
				" 1/2 teaspoon ground black pepper ",
				" 1 egg ",
				" 6 skinless, boneless chicken breast halves ",
				" 2 cups vegetable oil for frying "
			]
		},
		{
			"name": "Catherine's Spicy Chicken Soup",
			"reviews": "1561",
			"directions": "In a large pot over medium heat, combine water, chicken, salt, pepper, garlic powder, parsley, onion powder and bouillon cubes. Bring to a boil, then reduce heat and simmer 1 hour, or until chicken juices run clear. Remove chicken, reserve broth. Shred chicken. In a large pot over medium heat, cook onion and garlic in olive oil until slightly browned. Stir in salsa, diced tomatoes, whole tomatoes, tomato soup, chili powder, corn, chili beans, sour cream, shredded chicken and 5 cups broth. Simmer 30 minutes.",
			"rating": "4.75",
			"cook_time": 30,
			"ready_in_time": 45,
			"id": 20163,
			"prep_time": 15,
			"nutrition": [
				"Calories: 473 kcal 24 %",
				"Fat: 15.3 g 24 %",
				"Carbs: 50.3g 16 %",
				"Protein: 39.6 g 79 %",
				"Cholesterol: 82 mg 27 %",
				"Sodium: 2436 mg 97 %"
			],
			"comment": "This is a great recipe that you can fix to your taste! The longer it simmers the better. Top with crushed tortilla chips and shredded cheese. Enjoy!",
			"cal": 473,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/698391.jpg",
			"ingredients": [
				"2 quarts water ",
				" 8 skinless, boneless chicken breast halves ",
				" 1/2 teaspoon salt ",
				" 1 teaspoon ground black pepper ",
				" 1 teaspoon garlic powder ",
				" 2 tablespoons dried parsley ",
				" 1 tablespoon onion powder ",
				" 5 cubes chicken bouillon ",
				" 3 tablespoons olive oil ",
				" 1 onion, chopped ",
				" 3 cloves garlic, chopped ",
				" 1 (16 ounce) jar chunky salsa ",
				" 2 (14.5 ounce) cans peeled and diced tomatoes ",
				" 1 (14.5 ounce) can whole peeled tomatoes ",
				" 1 (10.75 ounce) can condensed tomato soup ",
				" 3 tablespoons chili powder ",
				" 1 (15 ounce) can whole kernel corn, drained ",
				" 2 (16 ounce) cans chili beans, undrained ",
				" 1 (8 ounce) container sour cream "
			]
		},
		{
			"name": "Chinese Chicken Fried Rice II",
			"reviews": "1186",
			"directions": "In a small bowl, beat egg with water. Melt butter in a large skillet over medium low heat. Add egg and leave flat for 1 to 2 minutes. Remove from skillet and cut into shreds. Heat oil in same skillet; add onion and saute until soft. Then add rice, soy sauce, pepper and chicken. Stir fry together for about 5 minutes, then stir in egg. Serve hot.",
			"rating": "4.38619089126587",
			"cook_time": 10,
			"ready_in_time": 15,
			"id": 20164,
			"prep_time": 5,
			"nutrition": [
				"Calories: 255 kcal 13 %",
				"Fat: 10.2 g 16 %",
				"Carbs: 25.9g 8 %",
				"Protein: 14.1 g 28 %",
				"Cholesterol: 83 mg 28 %",
				"Sodium: 516 mg 21 %"
			],
			"comment": "Chicken, rice, soy sauce and shredded egg stir fried together. This is a very simple recipe. It is easy, but tasty! Note: Never use rice that you have just cooked.",
			"cal": 255,
			"total_time": 30,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/855246.jpg",
			"ingredients": [
				"1 egg ",
				" 1 tablespoon water ",
				" 1 tablespoon butter ",
				" 1 tablespoon vegetable oil ",
				" 1 onion, chopped ",
				" 2 cups cooked white rice, cold ",
				" 2 tablespoons soy sauce ",
				" 1 teaspoon ground black pepper ",
				" 1 cup cooked, chopped chicken meat "
			]
		},
		{
			"name": "Unbelievable Chicken",
			"reviews": "1500",
			"directions": "In a large glass bowl, mix the cider vinegar, mustard, garlic, lime juice, lemon juice, brown sugar, salt, and pepper. Whisk in the olive oil. Place chicken in the mixture. Cover, and marinate 8 hours, or overnight. Preheat an outdoor grill for high heat. Lightly oil the grill grate. Place chicken on the prepared grill, and cook 6 to 8 minutes per side, until juices run clear. Discard marinade.",
			"rating": "4.4839015007019",
			"cook_time": 20,
			"ready_in_time": 540,
			"id": 20165,
			"prep_time": 15,
			"nutrition": [
				"Calories: 337 kcal 17 %",
				"Fat: 16.4 g 25 %",
				"Carbs: 22.4g 7 %",
				"Protein: 24.8 g 50 %",
				"Cholesterol: 67 mg 22 %",
				"Sodium: 736 mg 29 %"
			],
			"comment": "This unusual combination of common ingredients is fabulous! Everyone who tastes it asks me to share the recipe. You will love it and the many compliments you get--I promise!",
			"cal": 337,
			"total_time": 575,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/259036.jpg",
			"ingredients": [
				"1/4 cup cider vinegar ",
				" 3 tablespoons prepared coarse-ground mustard ",
				" 3 cloves garlic, peeled and minced ",
				" 1 lime, juiced ",
				" 1/2 lemon, juiced ",
				" 1/2 cup brown sugar ",
				" 1 1/2 teaspoons salt ",
				" ground black pepper to taste ",
				" 6 tablespoons olive oil ",
				" 6 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Honey Baked Chicken II",
			"reviews": "1621",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Place chicken pieces in a shallow baking pan, skin side up. Combine the melted butter or margarine, honey, mustard, salt and curry powder and pour the mixture over the chicken. Bake in the preheated oven for 1 1/4 hours (75 minutes), basting every 15 minutes with pan drippings, until the chicken is nicely browned and tender and the juices run clear.",
			"rating": "4.51409101486206",
			"cook_time": 75,
			"ready_in_time": 90,
			"id": 20166,
			"prep_time": 15,
			"nutrition": [
				"Calories: 514 kcal 26 %",
				"Fat: 32.9 g 51 %",
				"Carbs: 24g 8 %",
				"Protein: 31.3 g 63 %",
				"Cholesterol: 138 mg 46 %",
				"Sodium: 709 mg 28 %"
			],
			"comment": "Baked chicken with a sweet and spicy glaze.",
			"cal": 514,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/426534.jpg",
			"ingredients": [
				"1 (3 pound) whole chicken, cut into pieces ",
				" 1/2 cup butter, melted ",
				" 1/2 cup honey ",
				" 1/4 cup prepared mustard ",
				" 1 teaspoon salt ",
				" 1 teaspoon curry powder "
			]
		},
		{
			"name": "Tomato Chicken Parmesan",
			"reviews": "1356",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Pour beaten eggs into a shallow dish or bowl. In another shallow dish or bowl, mix together the grated Parmesan cheese and bread crumbs. Dip chicken breasts into beaten egg, then into bread crumb mixture to coat. In a large skillet, heat oil over medium high heat. Add coated chicken and saute for about 8 to 10 minutes each side, or until chicken is cooked through and juices run clear. Pour tomato sauce into a lightly greased 9x13 inch baking dish. Add chicken, then place a slice of Monterey Jack cheese over each breast, and bake in the preheated oven for 20 minutes or until cheese is completely melted.",
			"rating": "4.64060211181641",
			"cook_time": 30,
			"ready_in_time": 45,
			"id": 20167,
			"prep_time": 15,
			"nutrition": [
				"Calories: 513 kcal 26 %",
				"Fat: 22.5 g 35 %",
				"Carbs: 31.2g 10 %",
				"Protein: 44.3 g 89 %",
				"Cholesterol: 168 mg 56 %",
				"Sodium: 1249 mg 50 %"
			],
			"comment": "A delicious Italian breaded chicken smothered with cheese and tomato-based pasta sauce!",
			"cal": 513,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/460712.jpg",
			"ingredients": [
				"2 eggs, beaten ",
				" 1 cup grated Parmesan cheese ",
				" 7 ounces seasoned bread crumbs ",
				" 6 skinless, boneless chicken breast halves ",
				" 1 tablespoon vegetable oil ",
				" 12 ounces pasta sauce ",
				" 6 slices Monterey Jack cheese "
			]
		},
		{
			"name": "White Cheese Chicken Lasagna",
			"reviews": "1540",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Bring a large pot of lightly salted water to a boil. Cook lasagna noodles in boiling water for 8 to 10 minutes. Drain, and rinse with cold water. Melt the butter in a large saucepan over medium heat. Cook the onion and garlic in the butter until tender, stirring frequently. Stir in the flour and salt, and simmer until bubbly. Mix in the broth and milk, and boil, stirring constantly, for 1 minute. Stir in 2 cups mozzarella cheese and 1/4 cup Parmesan cheese. Season with the basil, oregano, and ground black pepper. Remove from heat, and set aside. Spread 1/3 of the sauce mixture in the bottom of a 9x13 inch baking dish. Layer with 1/3 of the noodles, the ricotta, and the chicken. Arrange 1/3 of the noodles over the chicken, and layer with 1/3 of the sauce mixture, spinach, and the remaining 2 cups mozzarella cheese and 1/2 cup Parmesan cheese. Arrange remaining noodles over cheese, and spread remaining sauce evenly over noodles. Sprinkle with parsley and 1/4 cup Parmesan cheese. Bake 35 to 40 minutes in the preheated oven.",
			"rating": "4.38491106033325",
			"cook_time": 50,
			"ready_in_time": 75,
			"id": 20168,
			"prep_time": 25,
			"nutrition": [
				"Calories: 428 kcal 21 %",
				"Fat: 24 g 37 %",
				"Carbs: 25.1g 8 %",
				"Protein: 28.6 g 57 %",
				"Cholesterol: 91 mg 30 %",
				"Sodium: 882 mg 35 %"
			],
			"comment": "A chicken and spinach lasagna with a creamy white cheese sauce. Great for any kind of pot luck. My kids love it.",
			"cal": 428,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/735349.jpg",
			"ingredients": [
				"9 lasagna noodles ",
				" 1/2 cup butter ",
				" 1 onion, chopped ",
				" 1 clove garlic, minced ",
				" 1/2 cup all-purpose flour ",
				" 1 teaspoon salt ",
				" 2 cups chicken broth ",
				" 1 1/2 cups milk ",
				" 4 cups shredded mozzarella cheese, divided ",
				" 1 cup grated Parmesan cheese, divided ",
				" 1 teaspoon dried basil ",
				" 1 teaspoon dried oregano ",
				" 1/2 teaspoon ground black pepper ",
				" 2 cups ricotta cheese ",
				" 2 cups cubed, cooked chicken meat ",
				" 2 (10 ounce) packages frozen chopped spinach, thawed and drained ",
				" 1 tablespoon chopped fresh parsley ",
				" 1/4 cup grated Parmesan cheese for topping "
			]
		},
		{
			"name": "Cajun Chicken Pasta",
			"reviews": "1384",
			"directions": "Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Place the chicken and the Cajun seasoning in a plastic bag. Shake to coat. In a large skillet over medium heat, saute the chicken in butter or margarine until almost tender (5 to 7 minutes). Add the red bell pepper, green bell pepper, mushrooms and green onion. Saute and stir for 2 to 3 minutes. Reduce heat. Add the cream, basil, lemon pepper, salt, garlic powder and ground black pepper. Heat through. Add the cooked linguine, toss and heat through. Sprinkle with grated Parmesan cheese and serve.",
			"rating": "4.70121002197266",
			"cook_time": 20,
			"ready_in_time": 40,
			"id": 20169,
			"prep_time": 20,
			"nutrition": [
				"Calories: 935 kcal 47 %",
				"Fat: 61.7 g 95 %",
				"Carbs: 54g 17 %",
				"Protein: 43.7 g 87 %",
				"Cholesterol: 271 mg 90 %",
				"Sodium: 1189 mg 48 %"
			],
			"comment": "Cajun cooking is a combination of French and Southern cuisine. It is robust, country style cookery - and so is this dish! Laissez le bon temp roulez and bon appetit!",
			"cal": 935,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/244889.jpg",
			"ingredients": [
				"4 ounces linguine pasta ",
				" 2 skinless, boneless chicken breast halves ",
				" 2 teaspoons Cajun seasoning ",
				" 2 tablespoons butter ",
				" 1 red bell pepper, sliced ",
				" 1 green bell pepper, sliced ",
				" 4 fresh mushrooms, sliced ",
				" 1 green onion, chopped ",
				" 1 cup heavy cream ",
				" 1/4 teaspoon dried basil ",
				" 1/4 teaspoon lemon pepper ",
				" 1/4 teaspoon salt ",
				" 1/8 teaspoon garlic powder ",
				" 1/8 teaspoon ground black pepper ",
				" 1/4 cup grated Parmesan cheese "
			]
		},
		{
			"name": "Greek Chicken Pasta",
			"reviews": "900",
			"directions": "Bring a large pot of lightly salted water to a boil. Cook pasta in boiling water until tender yet firm to the bit, 8 to 10 minutes; drain. Heat olive oil in a large skillet over medium-high heat. Add onion and garlic; saute until fragrant, about 2 minutes. Stir in the chicken and cook, stirring occasionally, until chicken is no longer pink in the center and the juices run clear, about 5 to 6 minutes. Reduce heat to medium-low; add artichoke hearts, tomato, feta cheese, parsley, lemon juice, oregano, and cooked pasta. Cook and stir until heated through, about 2 to 3 minutes. Remove from heat, season with salt and pepper, and garnish with lemon wedges.",
			"rating": "4.34275341033936",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 20170,
			"prep_time": 15,
			"nutrition": [
				"Calories: 488 kcal 24 %",
				"Fat: 11.4 g 18 %",
				"Carbs: 70g 23 %",
				"Protein: 32.6 g 65 %",
				"Cholesterol: 55 mg 18 %",
				"Sodium: 444 mg 18 %"
			],
			"comment": "This pasta dish incorporates some of the flavors of Greece. It makes a wonderfully complete and satisfying meal. For extra flavor, toss in a few kalamata olives. Use whatever pasta you have or prefer.",
			"cal": 488,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/220541.jpg",
			"ingredients": [
				"1 (16 ounce) package linguine pasta ",
				" 1/2 cup chopped red onion ",
				" 1 tablespoon olive oil ",
				" 2 cloves garlic, crushed ",
				" 1 pound skinless, boneless chicken breast meat - cut into bite-size pieces ",
				" 1 (14 ounce) can marinated artichoke hearts, drained and chopped ",
				" 1 large tomato, chopped ",
				" 1/2 cup crumbled feta cheese ",
				" 3 tablespoons chopped fresh parsley ",
				" 2 tablespoons lemon juice ",
				" 2 teaspoons dried oregano ",
				" salt and pepper to taste ",
				" 2 lemons, wedged, for garnish "
			]
		},
		{
			"name": "A Good Easy Garlic Chicken",
			"reviews": "1084",
			"directions": "Melt butter in a large skillet over medium high heat. Add chicken and sprinkle with garlic powder, seasoning salt and onion powder. Saute about 10 to 15 minutes on each side, or until chicken is cooked through and juices run clear.",
			"rating": "4.33942079544067",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 20171,
			"prep_time": 10,
			"nutrition": [
				"Calories: 214 kcal 11 %",
				"Fat: 10.1 g 16 %",
				"Carbs: 1.7g < 1 %",
				"Protein: 27.6 g 55 %",
				"Cholesterol: 91 mg 30 %",
				"Sodium: 368 mg 15 %"
			],
			"comment": "Sprinkle chicken breasts with garlic powder, onion powder and seasoning salt - then sautee and enjoy. Couldn't be easier! Great recipe for quick and easy meal, even for the pickiest eater!",
			"cal": 214,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/605723.jpg",
			"ingredients": [
				"3 tablespoons butter ",
				" 4 skinless, boneless chicken breast halves ",
				" 2 teaspoons garlic powder ",
				" 1 teaspoon seasoning salt ",
				" 1 teaspoon onion powder "
			]
		},
		{
			"name": "Chicken Tortilla Soup I",
			"reviews": "1195",
			"directions": "In a medium stock pot, heat oil over medium heat. Saute onion and garlic in oil until soft. Stir in chili powder, oregano, tomatoes, broth, and water. Bring to a boil, and simmer for 5 to 10 minutes. Stir in corn, hominy, chiles, beans, cilantro, and chicken. Simmer for 10 minutes. Ladle soup into individual serving bowls, and top with crushed tortilla chips, avocado slices, cheese, and chopped green onion.",
			"rating": "4.69562530517578",
			"cook_time": 20,
			"ready_in_time": 40,
			"id": 20172,
			"prep_time": 20,
			"nutrition": [
				"Calories: 377 kcal 19 %",
				"Fat: 19.1 g 29 %",
				"Carbs: 30.9g 10 %",
				"Protein: 23.1 g 46 %",
				"Cholesterol: 46 mg 15 %",
				"Sodium: 943 mg 38 %"
			],
			"comment": "This soup is quick to make, flavorful, and filling! Serve with warm corn bread or tortillas. This also freezes well. Garnish with chopped fresh avocado, Monterey Jack cheese, crushed tortilla chips, or green onion!",
			"cal": 377,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/23537.jpg",
			"ingredients": [
				"1 onion, chopped ",
				" 3 cloves garlic, minced ",
				" 1 tablespoon olive oil ",
				" 2 teaspoons chili powder ",
				" 1 teaspoon dried oregano ",
				" 1 (28 ounce) can crushed tomatoes ",
				" 1 (10.5 ounce) can condensed chicken broth ",
				" 1 1/4 cups water ",
				" 1 cup whole corn kernels, cooked ",
				" 1 cup white hominy ",
				" 1 (4 ounce) can chopped green chile peppers ",
				" 1 (15 ounce) can black beans, rinsed and drained ",
				" 1/4 cup chopped fresh cilantro ",
				" 2 boneless chicken breast halves, cooked and cut into bite-sized pieces ",
				" crushed tortilla chips ",
				" sliced avocado ",
				" shredded Monterey Jack cheese ",
				" chopped green onions "
			]
		},
		{
			"name": "Pesto Chicken Florentine",
			"reviews": "1089",
			"directions": "Heat oil in a large skillet over medium high heat. Add garlic, saute for 1 minute; then add chicken and cook for 7 to 8 minutes on each side. When chicken is close to being cooked through (no longer pink inside), add spinach and saute all together for 3 to 4 minutes. Meanwhile, prepare Alfredo sauce according to package directions. When finished, stir in 2 tablespoons pesto; set aside. In a large pot of salted boiling water, cook pasta for 8 to 10 minutes or until al dente. Rinse under cold water and drain. Add chicken/spinach mixture to pasta, then stir in pesto/Alfredo sauce. Mix well, top with cheese and serve.",
			"rating": "4.54852342605591",
			"cook_time": 35,
			"ready_in_time": 55,
			"id": 20173,
			"prep_time": 20,
			"nutrition": [
				"Calories: 572 kcal 29 %",
				"Fat: 19.3 g 30 %",
				"Carbs: 57.3g 18 %",
				"Protein: 41.9 g 84 %",
				"Cholesterol: 84 mg 28 %",
				"Sodium: 1707 mg 68 %"
			],
			"comment": "Extremely rich combination of chicken, spinach and creamy pesto sauce. Serve with crunchy bread and romaine salad--it's the best!",
			"cal": 572,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1061696.jpg",
			"ingredients": [
				"2 tablespoons olive oil ",
				" 2 cloves garlic, finely chopped ",
				" 4 skinless, boneless chicken breast halves - cut into strips ",
				" 2 cups fresh spinach leaves ",
				" 1 (4.5 ounce) package dry Alfredo sauce mix ",
				" 2 tablespoons pesto ",
				" 1 (8 ounce) package dry penne pasta ",
				" 1 tablespoon grated Romano cheese "
			]
		},
		{
			"name": "Broccoli Chicken Divan",
			"reviews": "1018",
			"directions": "Preheat oven to 450 degrees F (230 degrees C). Place the broccoli in a saucepan with enough water to cover. Bring to a boil, and cook 5 minutes, or until tender. Drain. Place the cooked broccoli in a 9 inch pie plate. Top with the chicken. In a bowl, mix the soup and milk, and pour over the chicken. Sprinkle with Cheddar cheese. Mix the melted butter with the bread crumbs, and sprinkle over the cheese. Bake in the preheated oven for 15 minutes, or until bubbly and lightly brown.",
			"rating": "4.29867553710938",
			"cook_time": 20,
			"ready_in_time": 40,
			"id": 20174,
			"prep_time": 20,
			"nutrition": [
				"Calories: 186 kcal 9 %",
				"Fat: 8.5 g 13 %",
				"Carbs: 12.2g 4 %",
				"Protein: 15.5 g 31 %",
				"Cholesterol: 44 mg 15 %",
				"Sodium: 440 mg 18 %"
			],
			"comment": "A quick and easy chicken and broccoli dish that all will love!",
			"cal": 186,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2204020.jpg",
			"ingredients": [
				"1 pound chopped fresh broccoli ",
				" 1 1/2 cups cubed, cooked chicken meat ",
				" 1 (10.75 ounce) can condensed cream of broccoli soup ",
				" 1/3 cup milk ",
				" 1/2 cup shredded Cheddar cheese ",
				" 1 tablespoon butter, melted ",
				" 2 tablespoons dried bread crumbs "
			]
		},
		{
			"name": "Asian Orange Chicken",
			"reviews": "1266",
			"directions": "Pour 1 1/2 cups water, orange juice, lemon juice, rice vinegar, and soy sauce into a saucepan and set over medium-high heat. Stir in the orange zest, brown sugar, ginger, garlic, chopped onion, and red pepper flakes. Bring to a boil. Remove from heat, and cool 10 to 15 minutes. Place the chicken pieces into a resealable plastic bag. When contents of saucepan have cooled, pour 1 cup of sauce into bag. Reserve the remaining sauce. Seal the bag, and refrigerate at least 2 hours. In another resealable plastic bag, mix the flour, salt, and pepper. Add the marinated chicken pieces, seal the bag, and shake to coat. Heat the olive oil in a large skillet over medium heat. Place chicken into the skillet, and brown on both sides. Drain on a plate lined with paper towels, and cover with aluminum foil. Wipe out the skillet, and add the sauce. Bring to a boil over medium-high heat. Mix together the cornstarch and 2 tablespoons water; stir into the sauce. Reduce heat to medium low, add the chicken pieces, and simmer, about 5 minutes, stirring occasionally.",
			"rating": "4.45454549789429",
			"cook_time": 40,
			"ready_in_time": 200,
			"id": 20175,
			"prep_time": 40,
			"nutrition": [
				"Calories: 445 kcal 22 %",
				"Fat: 11.2 g 17 %",
				"Carbs: 68.7g 22 %",
				"Protein: 17.8 g 36 %",
				"Cholesterol: 34 mg 11 %",
				"Sodium: 763 mg 31 %"
			],
			"comment": "A delicious citrus chicken recipe with flavors reminiscent of the orange chicken from a popular restaurant in the mall.",
			"cal": 445,
			"total_time": 280,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1207689.jpg",
			"ingredients": [
				"Sauce: ",
				" 1 1/2 cups water ",
				" 2 tablespoons orange juice ",
				" 1/4 cup lemon juice ",
				" 1/3 cup rice vinegar ",
				" 2 1/2 tablespoons soy sauce ",
				" 1 tablespoon grated orange zest ",
				" 1 cup packed brown sugar ",
				" 1/2 teaspoon minced fresh ginger root ",
				" 1/2 teaspoon minced garlic ",
				" 2 tablespoons chopped green onion ",
				" 1/4 teaspoon red pepper flakes ",
				" 3 tablespoons cornstarch ",
				" 2 tablespoons water ",
				" Chicken: ",
				" 2 boneless, skinless chicken breasts, cut into 1/2 inch pieces ",
				" 1 cup all-purpose flour ",
				" 1/4 teaspoon salt ",
				" 1/4 teaspoon pepper ",
				" 3 tablespoons olive oil "
			]
		},
		{
			"name": "Baked Chicken Nuggets",
			"reviews": "1098",
			"directions": "Preheat oven to 400 degrees F (200 degrees C). Cut chicken breasts into 1 1/2-inch sized pieces. In a medium bowl, mix together the bread crumbs, cheese, salt, thyme and basil. Mix well. Put melted butter in a bowl or dish for dipping. Dip chicken pieces into the melted butter first, then coat with the breadcrumb mixture. Place the well-coated chicken pieces on a lightly greased cookie sheet in a single layer, and bake in the preheated oven for 20 minutes.",
			"rating": "4.47777795791626",
			"cook_time": 20,
			"ready_in_time": 40,
			"id": 20176,
			"prep_time": 20,
			"nutrition": [
				"Calories: 308 kcal 15 %",
				"Fat: 19.1 g 29 %",
				"Carbs: 14.6g 5 %",
				"Protein: 19.3 g 39 %",
				"Cholesterol: 81 mg 27 %",
				"Sodium: 989 mg 40 %"
			],
			"comment": "A real kid-pleaser! Adults will enjoy this recipe for a tasty appetizer, too! Serve warm with your favorite dipping sauces if desired.",
			"cal": 308,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2152306.jpg",
			"ingredients": [
				"3 skinless, boneless chicken breasts ",
				" 1 cup Italian seasoned bread crumbs ",
				" 1/2 cup grated Parmesan cheese ",
				" 1 teaspoon salt ",
				" 1 teaspoon dried thyme ",
				" 1 tablespoon dried basil ",
				" 1/2 cup butter, melted "
			]
		},
		{
			"name": "Chicken Parmigiana",
			"reviews": "1028",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a medium baking sheet. Pour egg into a small shallow bowl. Place bread crumbs in a separate shallow bowl. Dip chicken into egg, then into the bread crumbs. Place coated chicken on the prepared baking sheet and bake in the preheated oven for 40 minutes, or until no longer pink and juices run clear. Pour 1/2 of the spaghetti sauce into a 7x11 inch baking dish. Place chicken over sauce, and cover with remaining sauce. Sprinkle mozzarella and Parmesan cheeses on top and return to the preheated oven for 20 minutes.",
			"rating": "4.57535123825073",
			"cook_time": 60,
			"ready_in_time": 90,
			"id": 20177,
			"prep_time": 30,
			"nutrition": [
				"Calories: 528 kcal 26 %",
				"Fat: 18.3 g 28 %",
				"Carbs: 44.9g 14 %",
				"Protein: 43.5 g 87 %",
				"Cholesterol: 184 mg 61 %",
				"Sodium: 1309 mg 52 %"
			],
			"comment": "This is a very nice dinner for two. Serve it with your favorite pasta and tossed greens.",
			"cal": 528,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/10037.jpg",
			"ingredients": [
				"1 egg, beaten ",
				" 2 ounces dry bread crumbs ",
				" 2 skinless, boneless chicken breast halves ",
				" 3/4 (16 ounce) jar spaghetti sauce ",
				" 2 ounces shredded mozzarella cheese ",
				" 1/4 cup grated Parmesan cheese "
			]
		},
		{
			"name": "Southwestern Egg Rolls",
			"reviews": "1104",
			"directions": "Rub 1 tablespoon vegetable oil over chicken breast. In a medium saucepan over medium heat, cook chicken approximately 5 minutes per side, until meat is no longer pink and juices run clear. Remove from heat and set aside. Heat remaining 1 tablespoon vegetable oil in a medium saucepan over medium heat. Stir in green onion and red pepper. Cook and stir 5 minutes, until tender. Dice chicken and mix into the pan with onion and red pepper. Mix in corn, black beans, spinach, jalapeno peppers, parsley, cumin, chili powder, salt and cayenne pepper. Cook and stir 5 minutes, until well blended and tender. Remove from heat and stir in Monterey Jack cheese so that it melts. Wrap tortillas with a clean, lightly moist cloth. Microwave on high approximately 1 minute, or until hot and pliable. Spoon even amounts of the mixture into each tortilla. Fold ends of tortillas, then roll tightly around mixture. Secure with toothpicks. Arrange in a medium dish, cover with plastic, and place in the freezer. Freeze at least 4 hours. In a large, deep skillet, heat oil for deep frying to 375 degrees F (190 degrees C). Deep fry frozen, stuffed tortillas 10 minutes each, or until dark golden brown. Drain on paper towels before serving.",
			"rating": "4.83333349227905",
			"cook_time": 12,
			"ready_in_time": 272,
			"id": 20178,
			"prep_time": 20,
			"nutrition": [
				"Calories: 419 kcal 21 %",
				"Fat: 31.2 g 48 %",
				"Carbs: 21.8g 7 %",
				"Protein: 13.6 g 27 %",
				"Cholesterol: 29 mg 10 %",
				"Sodium: 575 mg 23 %"
			],
			"comment": "These aren't traditional egg rolls! Small flour tortillas are stuffed with an exciting blend of Southwestern-style ingredients, then deep fried until golden brown.",
			"cal": 419,
			"total_time": 304,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1119294.jpg",
			"ingredients": [
				"2 tablespoons vegetable oil ",
				" 1 skinless, boneless chicken breast half ",
				" 2 tablespoons minced green onion ",
				" 2 tablespoons minced red bell pepper ",
				" 1/3 cup frozen corn kernels ",
				" 1/4 cup black beans, rinsed and drained ",
				" 2 tablespoons frozen chopped spinach, thawed and drained ",
				" 2 tablespoons diced jalapeno peppers ",
				" 1/2 tablespoon minced fresh parsley ",
				" 1/2 teaspoon ground cumin ",
				" 1/2 teaspoon chili powder ",
				" 1/3 teaspoon salt ",
				" 1 pinch ground cayenne pepper ",
				" 3/4 cup shredded Monterey Jack cheese ",
				" 5 (6 inch) flour tortillas ",
				" 1 quart oil for deep frying "
			]
		},
		{
			"name": "Cottage Cheese Chicken Enchiladas",
			"reviews": "1058",
			"directions": "To Make Meat Mixture: Heat oil in medium skillet over medium high heat. Add chicken, onion and green chile peppers and saute until browned, then add taco seasoning and prepare meat mixture according to package directions. To Make Cheese Mixture: In a medium bowl mix sour cream with cottage cheese and season with salt and pepper; stir until well blended. Preheat oven to 350 degrees F (175 degrees C). To Assemble Enchiladas: Heat tortillas until soft. In each tortilla place a spoonful of meat mixture, a spoonful of cheese mixture and a bit of shredded cheese. Roll tortillas and place in a lightly greased 9x13 inch baking dish. Top with any remaining meat and cheese mixture, enchilada sauce and remaining shredded cheese. Bake at 350 degrees F (175 degrees C) for 30 minutes or until cheese is melted and bubbly.",
			"rating": "4.5910062789917",
			"cook_time": 30,
			"ready_in_time": 60,
			"id": 20179,
			"prep_time": 30,
			"nutrition": [
				"Calories: 548 kcal 27 %",
				"Fat: 31.2 g 48 %",
				"Carbs: 34.4g 11 %",
				"Protein: 33.2 g 66 %",
				"Cholesterol: 98 mg 33 %",
				"Sodium: 1685 mg 67 %"
			],
			"comment": "Ever tried chicken enchiladas made with cottage cheese? Now's your chance! This takes some prep time, but it is well worth it. You can make it 1 day ahead, and serve the next day.",
			"cal": 548,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/610703.jpg",
			"ingredients": [
				"1 tablespoon vegetable oil ",
				" 2 skinless, boneless chicken breast halves - boiled and shredded ",
				" 1/2 cup chopped onion ",
				" 1 (7 ounce) can chopped green chile peppers ",
				" 1 (1 ounce) package taco seasoning mix ",
				" 1/2 cup sour cream ",
				" 2 cups cottage cheese ",
				" 1 teaspoon salt ",
				" 1 pinch ground black pepper ",
				" 12 (6 inch) corn tortillas ",
				" 2 cups shredded Monterey Jack cheese ",
				" 1 (10 ounce) can red enchilada sauce "
			]
		},
		{
			"name": "Spinach Stuffed Chicken Breasts",
			"reviews": "1123",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). In a medium bowl, mix mayonnaise, spinach, feta cheese, and garlic until well blended. Set aside. Carefully butterfly chicken breasts, making sure not to cut all the way through. Spoon spinach mixture into chicken breasts. Wrap each with a piece of bacon, and secure with a toothpick. Place in shallow baking dish. Cover. Bake in the preheated oven for 1 hour, or until chicken is no longer pink in the center and the juices run clear. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
			"rating": "4.50033140182495",
			"cook_time": 60,
			"ready_in_time": 85,
			"id": 20180,
			"prep_time": 25,
			"nutrition": [
				"Calories: 449 kcal 22 %",
				"Fat: 32.8 g 50 %",
				"Carbs: 5.2g 2 %",
				"Protein: 33.4 g 67 %",
				"Cholesterol: 104 mg 35 %",
				"Sodium: 685 mg 27 %"
			],
			"comment": "Spinach and cheese stuffed into boneless, skinless chicken breasts. Serve with rice, noodles, or a great Greek salad!",
			"cal": 449,
			"total_time": 170,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/404016.jpg",
			"ingredients": [
				"1/2 cup mayonnaise ",
				" 1 (10 ounce) package frozen chopped spinach, thawed and drained ",
				" 1/2 cup crumbled feta cheese ",
				" 2 cloves garlic, chopped ",
				" 4 skinless, boneless chicken breasts ",
				" 4 slices bacon "
			]
		},
		{
			"name": "Penne with Chicken and Asparagus",
			"reviews": "919",
			"directions": "Bring a large pot of lightly salted water to boil. Add pasta, and cook until al dente, about 8 to 10 minutes. Drain, and set aside. Warm 3 tablespoons olive oil in a large skillet over medium-high heat. Stir in chicken, and season with salt, pepper, and garlic powder. Cook until chicken is cooked through and browned, about 5 minutes. Remove chicken to paper towels. Pour chicken broth into the skillet. Then stir in asparagus, garlic, and a pinch more garlic powder, salt, and pepper. Cover, and steam until the asparagus is just tender, about 5 to 10 minutes. Return chicken to the skillet, and warm through. Stir chicken mixture into pasta, and mix well. Let sit about 5 minutes. Drizzle with 2 tablespoons olive oil, stir again, then sprinkle with Parmesan cheese.",
			"rating": "4.32868671417236",
			"cook_time": 20,
			"ready_in_time": 35,
			"id": 20181,
			"prep_time": 15,
			"nutrition": [
				"Calories: 332 kcal 17 %",
				"Fat: 10.9 g 17 %",
				"Carbs: 43.3g 14 %",
				"Protein: 16.7 g 33 %",
				"Cholesterol: 20 mg 7 %",
				"Sodium: 69 mg 3 %"
			],
			"comment": "A light but super-tasty pasta dish, with fresh asparagus cooked in broth with sauteed garlic and seasoned chicken.",
			"cal": 332,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/226134.jpg",
			"ingredients": [
				"1 (16 ounce) package dried penne pasta ",
				" 5 tablespoons olive oil, divided ",
				" 2 skinless, boneless chicken breast halves - cut into cubes ",
				" salt and pepper to taste ",
				" garlic powder to taste ",
				" 1/2 cup low-sodium chicken broth ",
				" 1 bunch slender asparagus spears, trimmed, cut on diagonal into 1-inch pieces ",
				" 1 clove garlic, thinly sliced ",
				" 1/4 cup Parmesan cheese "
			]
		},
		{
			"name": "Chicken Parmesan",
			"reviews": "1125",
			"directions": "Preheat an oven to 450 degrees F (230 degrees C). Place chicken breasts between two sheets of heavy plastic (resealable freezer bags work well) on a solid, level surface. Firmly pound chicken with the smooth side of a meat mallet to a thickness of 1/2-inch. Season chicken thoroughly with salt and pepper. Beat eggs in a shallow bowl and set aside. Mix bread crumbs and 1/2 cup Parmesan in a separate bowl, set aside. Place flour in a sifter or strainer; sprinkle over chicken breasts, evenly coating both sides. Dip flour coated chicken breast in beaten eggs. Transfer breast to breadcrumb mixture, pressing the crumbs into both sides. Repeat for each breast. Set aside breaded chicken breasts for about 15 minutes. Heat 1 cup olive oil in a large skillet on medium-high heat until it begins to shimmer. Cook chicken until golden, about 2 minutes on each side. The chicken will finish cooking in the oven. Place chicken in a baking dish and top each breast with about 1/3 cup of tomato sauce. Layer each chicken breast with equal amounts of mozzarella cheese, fresh basil, and provolone cheese. Sprinkle 1 to 2 tablespoons of Parmesan cheese on top and drizzle with 1 tablespoon olive oil. Bake in the preheated oven until cheese is browned and bubbly, and chicken breasts are no longer pink in the center, 15 to 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
			"rating": "4.81436729431152",
			"cook_time": 20,
			"ready_in_time": 60,
			"id": 20182,
			"prep_time": 25,
			"nutrition": [
				"Calories: 676 kcal 34 %",
				"Fat: 27.5 g 42 %",
				"Carbs: 81g 26 %",
				"Protein: 50.6 g 101 %",
				"Cholesterol: 187 mg 62 %",
				"Sodium: 1236 mg 49 %"
			],
			"comment": "My version of chicken parmesan is a little different than what they do in the restaurants, with less sauce and a crispier crust.",
			"cal": 676,
			"total_time": 105,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1445049.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves ",
				" salt and freshly ground black pepper to taste ",
				" 2 eggs ",
				" 4 cups panko bread crumbs ",
				" 1/2 cup grated Parmesan cheese ",
				" 2 tablespoons all-purpose flour, or more if needed ",
				" 1 cup olive oil for frying ",
				" 1/2 cup prepared tomato sauce ",
				" 1/4 cup fresh mozzarella, cut into small cubes ",
				" 1/4 cup chopped fresh basil ",
				" 1/2 cup grated provolone cheese ",
				" 1/4 cup grated Parmesan cheese ",
				" 1 tablespoon olive oil "
			]
		},
		{
			"name": "Grandma's Chicken Noodle Soup",
			"reviews": "1074",
			"directions": "Bring a large pot of lightly salted water to a boil. Add egg noodles and oil, and boil for 8 minutes, or until tender. Drain, and rinse under cool running water. In a large saucepan or Dutch oven, combine broth, salt, and poultry seasoning. Bring to a boil. Stir in celery and onion. Reduce heat, cover, and simmer 15 minutes. In a small bowl, mix cornstarch and water together until cornstarch is completely dissolved. Gradually add to soup, stirring constantly. Stir in noodles and chicken, and heat through.",
			"rating": "4.55757141113281",
			"cook_time": 25,
			"ready_in_time": 45,
			"id": 20184,
			"prep_time": 20,
			"nutrition": [
				"Calories: 147 kcal 7 %",
				"Fat: 3.6 g 5 %",
				"Carbs: 11.4g 4 %",
				"Protein: 15.7 g 31 %",
				"Cholesterol: 33 mg 11 %",
				"Sodium: 1664 mg 67 %"
			],
			"comment": "This is a recipe that was given to me by my grandmother. It is a very savory and tasty soup and I believe that all will like it. If you would like to add even more flavor, try using smoked chicken!!",
			"cal": 147,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/894017.jpg",
			"ingredients": [
				"2 1/2 cups wide egg noodles ",
				" 1 teaspoon vegetable oil ",
				" 12 cups chicken broth ",
				" 1 1/2 tablespoons salt ",
				" 1 teaspoon poultry seasoning ",
				" 1 cup chopped celery ",
				" 1 cup chopped onion ",
				" 1/3 cup cornstarch ",
				" 1/4 cup water ",
				" 3 cups diced, cooked chicken meat "
			]
		},
		{
			"name": "Chicken Breasts in Caper Cream Sauce",
			"reviews": "1258",
			"directions": "Season chicken breasts with lemon pepper, salt, dill weed, and garlic powder. Melt butter in a large skillet over medium heat. Place breasts in skillet, and increase heat to medium-high. Turn chicken frequently, until brown, about 5 minutes. Reduce heat to medium, and cook 5 to 7 minutes, until breasts are cooked through. Remove chicken to a warm serving platter, and cover with foil. Return skillet to stove, and increase heat to high. Whisk in whipping cream, whisking continuously until reduced to sauce consistency, about 3 minutes. Remove from heat. Stir in capers. Pour sauce over chicken, and serve.",
			"rating": "4.62439298629761",
			"cook_time": 15,
			"ready_in_time": 20,
			"id": 20185,
			"prep_time": 5,
			"nutrition": [
				"Calories: 313 kcal 16 %",
				"Fat: 21.2 g 33 %",
				"Carbs: 1.8g < 1 %",
				"Protein: 28.2 g 56 %",
				"Cholesterol: 132 mg 44 %",
				"Sodium: 974 mg 39 %"
			],
			"comment": "My husband (who is not a cook) developed this recipe when looking through what we had in the fridge. We love capers and my VERY picky 8-year old always asks for 'Daddy's chickie.'",
			"cal": 313,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/7178.jpg",
			"ingredients": [
				"4 boneless, skinless chicken breast halves ",
				" 1 teaspoon lemon pepper ",
				" 1 teaspoon salt ",
				" 1 teaspoon dried dill weed ",
				" 1 teaspoon garlic powder ",
				" 3 tablespoons butter ",
				" 1/2 cup whipping cream ",
				" 2 tablespoons capers, drained and rinsed "
			]
		},
		{
			"name": "Chicken With Mushrooms",
			"reviews": "1079",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Place half of the mushrooms in a 9x13 inch pan. Dip chicken into beaten eggs, then roll in bread crumbs. In skillet, melt butter over medium heat. Brown both sides of chicken in skillet. Place chicken on top of mushrooms, arrange remaining mushrooms on chicken, and top with mozzarella cheese. Add chicken broth to pan. Bake in preheated oven for 30 to 35 minutes, or until chicken is no longer pink and juices run clear.",
			"rating": "4.45690727233887",
			"cook_time": 30,
			"ready_in_time": 45,
			"id": 20186,
			"prep_time": 15,
			"nutrition": [
				"Calories: 454 kcal 23 %",
				"Fat: 19.8 g 30 %",
				"Carbs: 23.8g 8 %",
				"Protein: 44.1 g 88 %",
				"Cholesterol: 204 mg 68 %",
				"Sodium: 1108 mg 44 %"
			],
			"comment": "This is one of the best ways that I have ever prepared chicken. This recipe has been requested many times after I have served it. Serve chicken over hot cooked rice or noodles.",
			"cal": 454,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/934634.jpg",
			"ingredients": [
				"3 cups sliced mushrooms ",
				" 4 skinless, boneless chicken breast halves ",
				" 2 eggs, beaten ",
				" 1 cup seasoned bread crumbs ",
				" 2 tablespoons butter ",
				" 6 ounces mozzarella cheese, sliced ",
				" 3/4 cup chicken broth "
			]
		},
		{
			"name": "Cheddar Baked Chicken",
			"reviews": "1115",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Coat a medium baking dish with 1/4 cup melted butter. In a bowl, mix the flour, salt, pepper, and garlic powder. In a separate bowl, beat together the egg and milk. In a third bowl, mix the cheese, bread crumbs, cereal. Dredge chicken pieces in the flour mixture, dip in the egg mixture, then press in the breadcrumb mixture to coat. Arrange in the prepared baking dish. Drizzle 2 tablespoons butter evenly over chicken. Bake 35 minutes in the preheated oven, or until coating is golden brown and chicken juices run clear.",
			"rating": "4.60171747207642",
			"cook_time": 40,
			"ready_in_time": 50,
			"id": 20187,
			"prep_time": 10,
			"nutrition": [
				"Calories: 368 kcal 18 %",
				"Fat: 22.1 g 34 %",
				"Carbs: 19.9g 6 %",
				"Protein: 22.2 g 44 %",
				"Cholesterol: 120 mg 40 %",
				"Sodium: 866 mg 35 %"
			],
			"comment": "This recipe is very quick and easy to prepare. The flavors blend to make it rather tasty. It is great with plain white rice and your favorite vegetable. Why not give it a try?",
			"cal": 368,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/696093.jpg",
			"ingredients": [
				"1/4 cup butter, melted ",
				" 1/2 cup all-purpose flour ",
				" 1 teaspoon salt ",
				" 1 teaspoon ground black pepper ",
				" 1 teaspoon garlic powder ",
				" 1 egg ",
				" 1 tablespoon milk ",
				" 1 cup shredded Cheddar cheese ",
				" 1/2 cup Italian seasoned bread crumbs ",
				" 1 cup crispy rice cereal ",
				" 3 skinless, boneless chicken breast halves - cut in half ",
				" 2 tablespoons butter, melted "
			]
		},
		{
			"name": "Chicken Fettuccini Alfredo",
			"reviews": "1222",
			"directions": "In a large skillet over medium heat combine chicken, 2 tablespoons butter, 2 cloves garlic, and Italian seasoning. Cook until chicken is no longer pink inside. Remove from skillet and set aside. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain. Meanwhile, melt 4 tablespoons butter in the skillet. Saute onion, 2 cloves garlic, and mushrooms until onions are transparent. Stir in flour, salt and pepper; cook 2 minutes. Slowly add milk and half-and-half, stirring until smooth and creamy. Stir in Parmesan and Colby-Monterey Jack cheeses; stir until cheese is melted. Stir in chicken mixture, tomatoes and sour cream. Serve over cooked fettuccini.",
			"rating": "4.52099370956421",
			"cook_time": 30,
			"ready_in_time": 60,
			"id": 20188,
			"prep_time": 30,
			"nutrition": [
				"Calories: 673 kcal 34 %",
				"Fat: 30.8 g 47 %",
				"Carbs: 57g 18 %",
				"Protein: 43.3 g 87 %",
				"Cholesterol: 133 mg 44 %",
				"Sodium: 1386 mg 55 %"
			],
			"comment": "This is a family favorite. A creamy, cheesy Alfredo dish, great with a salad and garlic bread.",
			"cal": 673,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1113400.jpg",
			"ingredients": [
				"6 skinless, boneless chicken breast halves - cut into cubes ",
				" 6 tablespoons butter, divided ",
				" 4 cloves garlic, minced, divided ",
				" 1 tablespoon Italian seasoning ",
				" 1 pound fettuccini pasta ",
				" 1 onion, diced ",
				" 1 (8 ounce) package sliced mushrooms ",
				" 1/3 cup all-purpose flour ",
				" 1 tablespoon salt ",
				" 3/4 teaspoon ground white pepper ",
				" 3 cups milk ",
				" 1 cup half-and-half ",
				" 3/4 cup grated Parmesan cheese ",
				" 8 ounces shredded Colby-Monterey Jack cheese ",
				" 3 roma (plum) tomatoes, diced ",
				" 1/2 cup sour cream "
			]
		},
		{
			"name": "Salsa Chicken Rice Casserole",
			"reviews": "1059",
			"directions": "Place rice and water in a saucepan, and bring to a boil. Reduce heat to low, cover, and simmer for 20 minutes. Meanwhile, place chicken breast halves into a large saucepan, and fill the pan with water. Bring to a boil, and cook for 20 minutes, or until done. Remove chicken from water. When cool enough to handle, cut meat into bite-size pieces. Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 9x13 inch baking dish. In a medium bowl, combine Monterey Jack and Cheddar cheeses. In a separate bowl, mix together cream of chicken soup, cream of mushroom soup, onion, and salsa. Layer 1/2 of the rice, 1/2 of the chicken, 1/2 of the soup and salsa mixture, and 1/2 of the cheese mixture in prepared dish. Repeat layers, ending with cheese. Bake in preheated oven for about 40 minutes, or until bubbly.",
			"rating": "4.33763599395752",
			"cook_time": 60,
			"ready_in_time": 80,
			"id": 20189,
			"prep_time": 20,
			"nutrition": [
				"Calories: 477 kcal 24 %",
				"Fat: 23.9 g 37 %",
				"Carbs: 34.8g 11 %",
				"Protein: 30 g 60 %",
				"Cholesterol: 88 mg 29 %",
				"Sodium: 1143 mg 46 %"
			],
			"comment": "Layers of rice, chicken breast, a creamy soup and salsa mixture and two kinds of cheese add up to a simply yummy salsa casserole! This recipe is a family favorite because it's delicious and easily made with ingredients found in the pantry.",
			"cal": 477,
			"total_time": 160,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/684861.jpg",
			"ingredients": [
				"1 1/3 cups uncooked white rice ",
				" 2 2/3 cups water ",
				" 4 skinless, boneless chicken breast halves ",
				" 2 cups shredded Monterey Jack cheese ",
				" 2 cups shredded Cheddar cheese ",
				" 1 (10.75 ounce) can condensed cream of chicken soup ",
				" 1 (10.75 ounce) can condensed cream of mushroom soup ",
				" 1 onion, chopped ",
				" 1 1/2 cups mild salsa "
			]
		},
		{
			"name": "Key West Chicken",
			"reviews": "901",
			"directions": "In a shallow container, blend soy sauce, honey, vegetable oil, lime juice, and garlic. Place chicken breast halves into the mixture, and turn to coat. Cover, and marinate in the refrigerator at least 30 minutes. Preheat an outdoor grill for high heat. Lightly oil the grill grate. Discard marinade, and grill chicken 6 to 8 minutes on each side, until juices run clear.",
			"rating": "4.30316734313965",
			"cook_time": 15,
			"ready_in_time": 60,
			"id": 20190,
			"prep_time": 15,
			"nutrition": [
				"Calories: 184 kcal 9 %",
				"Fat: 6.2 g 10 %",
				"Carbs: 5.6g 2 %",
				"Protein: 25.3 g 51 %",
				"Cholesterol: 67 mg 22 %",
				"Sodium: 735 mg 29 %"
			],
			"comment": "This recipe from the Florida Keys has been given to almost everyone I know. It is the best marinade for chicken, and it only takes 30 minutes from prep till you can grill! It's a great blend of flavors with honey, soy sauce, and lime juice. If you have time, try marinating overnight for the fullest flavor.",
			"cal": 184,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/694150.jpg",
			"ingredients": [
				"3 tablespoons soy sauce ",
				" 1 tablespoon honey ",
				" 1 tablespoon vegetable oil ",
				" 1 teaspoon lime juice ",
				" 1 teaspoon chopped garlic ",
				" 4 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Kung Pao Chicken",
			"reviews": "817",
			"directions": "To Make Marinade: Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil and 1 tablespoon cornstarch/water mixture and mix together. Place chicken pieces in a glass dish or bowl and add marinade. Toss to coat. Cover dish and place in refrigerator for about 30 minutes. To Make Sauce: In a small bowl combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil, 1 tablespoon cornstarch/water mixture, chili paste, vinegar and sugar. Mix together and add green onion, garlic, water chestnuts and peanuts. In a medium skillet, heat sauce slowly until aromatic. Meanwhile, remove chicken from marinade and saute in a large skillet until meat is white and juices run clear. When sauce is aromatic, add sauteed chicken to it and let simmer together until sauce thickens.",
			"rating": "4.28345823287964",
			"cook_time": 30,
			"ready_in_time": 90,
			"id": 20191,
			"prep_time": 30,
			"nutrition": [
				"Calories: 437 kcal 22 %",
				"Fat: 23.3 g 36 %",
				"Carbs: 25.3g 8 %",
				"Protein: 34.4 g 69 %",
				"Cholesterol: 66 mg 22 %",
				"Sodium: 596 mg 24 %"
			],
			"comment": "Spicy chicken with peanuts, similar to what is served in Chinese restaurants. It is easy to make, and you can be as sloppy with the measurements as you want. They reduce to a nice, thick sauce. Substitute cashews for peanuts, or bamboo shoots for the water chestnuts. You can't go wrong! Enjoy!",
			"cal": 437,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/290890.jpg",
			"ingredients": [
				"1 pound skinless, boneless chicken breast halves - cut into chunks ",
				" 2 tablespoons white wine ",
				" 2 tablespoons soy sauce ",
				" 2 tablespoons sesame oil, divided ",
				" 2 tablespoons cornstarch, dissolved in 2 tablespoons water ",
				" 1 ounce hot chile paste ",
				" 1 teaspoon distilled white vinegar ",
				" 2 teaspoons brown sugar ",
				" 4 green onions, chopped ",
				" 1 tablespoon chopped garlic ",
				" 1 (8 ounce) can water chestnuts ",
				" 4 ounces chopped peanuts "
			]
		},
		{
			"name": "Basil Chicken over Angel Hair",
			"reviews": "764",
			"directions": "In a large pot of salted boiling water, cook angel hair pasta until it is al dente, about 8 to 10 minutes. Drain, and set aside. In a large skillet, heat oil over medium-high heat. Saute the onions and garlic. Stir in the tomatoes, chicken, basil, salt and hot pepper sauce. Reduce heat to medium, and cover skillet. Simmer for about 5 minutes, stirring frequently, until mixture is hot and tomatoes are soft. Toss sauce with hot cooked angel hair pasta to coat. Serve with Parmesan cheese.",
			"rating": "4.32027244567871",
			"cook_time": 20,
			"ready_in_time": 35,
			"id": 20192,
			"prep_time": 15,
			"nutrition": [
				"Calories: 362 kcal 18 %",
				"Fat: 10.8 g 17 %",
				"Carbs: 37.8g 12 %",
				"Protein: 28.4 g 57 %",
				"Cholesterol: 57 mg 19 %",
				"Sodium: 536 mg 21 %"
			],
			"comment": "A tasty chicken and pasta dish.",
			"cal": 362,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/39411.jpg",
			"ingredients": [
				"1 (8 ounce) package angel hair pasta ",
				" 2 teaspoons olive oil ",
				" 1/2 cup finely chopped onion ",
				" 1 clove garlic, chopped ",
				" 2 1/2 cups chopped tomatoes ",
				" 2 cups boneless chicken breast halves, cooked and cubed ",
				" 1/4 cup chopped fresh basil ",
				" 1/2 teaspoon salt ",
				" 1/8 teaspoon hot pepper sauce ",
				" 1/4 cup Parmesan cheese "
			]
		},
		{
			"name": "Sesame Pasta Chicken Salad",
			"reviews": "924",
			"directions": "Heat a skillet over medium-high heat. Add sesame seeds, and cook stirring frequently until lightly toasted. Remove from heat, and set aside. Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until al dente. Drain pasta, and rinse under cold water until cool. Transfer to a large bowl. In a jar with a tight-fitting lid, combine vegetable oil, soy sauce, vinegar, sesame oil, sugar, sesame seeds, ginger, and pepper. Shake well. Pour sesame dressing over pasta, and toss to coat evenly. Gently mix in chicken, cilantro, and green onions.",
			"rating": "4.44816589355469",
			"cook_time": 10,
			"ready_in_time": 30,
			"id": 20193,
			"prep_time": 20,
			"nutrition": [
				"Calories: 349 kcal 17 %",
				"Fat: 15.2 g 23 %",
				"Carbs: 38.3g 12 %",
				"Protein: 15.9 g 32 %",
				"Cholesterol: 24 mg 8 %",
				"Sodium: 308 mg 12 %"
			],
			"comment": "A refreshing light pasta salad with a delicious Asian flair. Great for a summer cookout or picnic. Tastes great right away, and even better if you can allow it to marinate for a while.",
			"cal": 349,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/92940.jpg",
			"ingredients": [
				"1/4 cup sesame seeds ",
				" 1 (16 ounce) package bow tie pasta ",
				" 1/2 cup vegetable oil ",
				" 1/3 cup light soy sauce ",
				" 1/3 cup rice vinegar ",
				" 1 teaspoon sesame oil ",
				" 3 tablespoons white sugar ",
				" 1/2 teaspoon ground ginger ",
				" 1/4 teaspoon ground black pepper ",
				" 3 cups shredded, cooked chicken breast meat ",
				" 1/3 cup chopped fresh cilantro ",
				" 1/3 cup chopped green onion "
			]
		},
		{
			"name": "Crispy Rosemary Chicken and Fries",
			"reviews": "852",
			"directions": "Preheat the oven to 375 degrees F (190 degrees C). Place chicken and potatoes into a large bowl. Pour olive oil over them, and stir to coat. Scatter the chicken and potato pieces in a large baking dish, or cookie sheet with sides. Sprinkle with rosemary, oregano, garlic powder, salt and pepper. Bake for 1 hour in the preheated oven, uncovered. Baste during the last 15 minutes for extra crispness.",
			"rating": "4.39866542816162",
			"cook_time": 60,
			"ready_in_time": 75,
			"id": 20194,
			"prep_time": 15,
			"nutrition": [
				"Calories: 497 kcal 25 %",
				"Fat: 31.9 g 49 %",
				"Carbs: 27.6g 9 %",
				"Protein: 24.4 g 49 %",
				"Cholesterol: 78 mg 26 %",
				"Sodium: 81 mg 3 %"
			],
			"comment": "This is a one pan meal that's in the oven in 15 minutes. Rosemary, garlic, and oregano create a mouth watering aroma. If using dried herbs in place of fresh, use 1/3 the amount. Potatoes are crispy like french fries, just serve with ketchup. Kids just love this!",
			"cal": 497,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/483274.jpg",
			"ingredients": [
				"8 chicken thighs ",
				" 6 small red potatoes, quartered ",
				" 1/2 cup extra-virgin olive oil, or as needed ",
				" 1 tablespoon chopped fresh rosemary ",
				" 1 1/2 teaspoons chopped fresh oregano ",
				" 1 1/2 teaspoons garlic powder ",
				" salt and pepper to taste "
			]
		},
		{
			"name": "Honey-Garlic Slow Cooker Chicken Thighs",
			"reviews": "1055",
			"directions": "Lay chicken thighs into the bottom of a 4-quart slow cooker. Whisk soy sauce, ketchup, honey, garlic, and basil together in a bowl; pour over the chicken. Cook on Low for 6 hours.",
			"rating": "3.86529684066772",
			"cook_time": 360,
			"ready_in_time": 370,
			"id": 20195,
			"prep_time": 10,
			"nutrition": [
				"Calories: 325 kcal 16 %",
				"Fat: 11.9 g 18 %",
				"Carbs: 34.2g 11 %",
				"Protein: 21.9 g 44 %",
				"Cholesterol: 71 mg 24 %",
				"Sodium: 2204 mg 88 %"
			],
			"comment": "I have used it often. It's easy and uses pantry staples. Always a hit with adults and kids. Serve with basmati rice or quinoa and steamed or roasted vegetables.",
			"cal": 325,
			"total_time": 740,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1411947.jpg",
			"ingredients": [
				"4 skinless, boneless chicken thighs ",
				" 1/2 cup soy sauce ",
				" 1/2 cup ketchup ",
				" 1/3 cup honey ",
				" 3 cloves garlic, minced ",
				" 1 teaspoon dried basil "
			]
		},
		{
			"name": "Chicken Makhani (Indian Butter Chicken)",
			"reviews": "841",
			"directions": "Heat 1 tablespoon oil in a large saucepan over medium high heat. Saute shallot and onion until soft and translucent. Stir in butter, lemon juice, ginger-garlic paste, 1 teaspoon garam masala, chili powder, cumin and bay leaf. Cook, stirring, for 1 minute. Add tomato sauce, and cook for 2 minutes, stirring frequently. Stir in half-and-half and yogurt. Reduce heat to low, and simmer for 10 minutes, stirring frequently. Season with salt pepper. Remove from heat and set aside. Heat 1 tablespoon oil in a large heavy skillet over medium heat. Cook chicken until lightly browned, about 10 minutes. Reduce heat, and season with 1 teaspoon garam masala and cayenne. Stir in a few spoonfuls of sauce, and simmer until liquid has reduced, and chicken is no longer pink. Stir cooked chicken into sauce. Mix together cornstarch and water, then stir into the sauce. Cook for 5 to 10 minutes, or until thickened.",
			"rating": "4.49310350418091",
			"cook_time": 25,
			"ready_in_time": 35,
			"id": 20196,
			"prep_time": 10,
			"nutrition": [
				"Calories: 408 kcal 20 %",
				"Fat: 27.8 g 43 %",
				"Carbs: 15.6g 5 %",
				"Protein: 23.4 g 47 %",
				"Cholesterol: 107 mg 36 %",
				"Sodium: 523 mg 21 %"
			],
			"comment": "Chicken Makhani is one of my favorite Indian dishes. It is a full flavored dish that complements the chicken well. It can be made as mild or spicy as you wish by adjusting the cayenne. Serve with basmati rice and naan bread.",
			"cal": 408,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/63121.jpg",
			"ingredients": [
				"1 tablespoon peanut oil ",
				" 1 shallot, finely chopped ",
				" 1/4 white onion, chopped ",
				" 2 tablespoons butter ",
				" 2 teaspoons lemon juice ",
				" 1 tablespoon ginger garlic paste ",
				" 1 teaspoon garam masala ",
				" 1 teaspoon chili powder ",
				" 1 teaspoon ground cumin ",
				" 1 bay leaf ",
				" 1/4 cup plain yogurt ",
				" 1 cup half-and-half ",
				" 1 cup tomato puree ",
				" 1/4 teaspoon cayenne pepper, or to taste ",
				" 1 pinch salt ",
				" 1 pinch black pepper ",
				" 1 tablespoon peanut oil ",
				" 1 pound boneless, skinless chicken thighs, cut into bite-size pieces ",
				" 1 teaspoon garam masala ",
				" 1 pinch cayenne pepper ",
				" 1 tablespoon cornstarch ",
				" 1/4 cup water "
			]
		},
		{
			"name": "Pollo Fajitas",
			"reviews": "810",
			"directions": "In a medium bowl, combine Worcestershire sauce, vinegar, soy sauce, chili powder, garlic and hot pepper sauce. Place chicken in sauce, and turn once to coat. Marinate for 30 minutes at room temperature, or cover and refrigerate for several hours. Heat oil in a large skillet over high heat. Add chicken strips to the pan, and saute for 5 minutes. Add the onion and green pepper, and saute another 3 minutes. Remove from heat, and sprinkle with lemon juice.",
			"rating": "4.43894100189209",
			"cook_time": 10,
			"ready_in_time": 55,
			"id": 20197,
			"prep_time": 15,
			"nutrition": [
				"Calories: 210 kcal 10 %",
				"Fat: 8.3 g 13 %",
				"Carbs: 5.7g 2 %",
				"Protein: 27.6 g 55 %",
				"Cholesterol: 113 mg 38 %",
				"Sodium: 344 mg 14 %"
			],
			"comment": "Chicken thighs are used in this recipe, but boneless, skinless breasts could be used instead. Be careful not to overcook, as the result could be rather dry chicken. Serve with warm flour tortillas, salsa and sour cream.",
			"cal": 210,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/834770.jpg",
			"ingredients": [
				"1 tablespoon Worcestershire sauce ",
				" 1 tablespoon cider vinegar ",
				" 1 tablespoon soy sauce ",
				" 1 teaspoon chili powder ",
				" 1 clove garlic, minced ",
				" 1 dash hot pepper sauce ",
				" 1 1/2 pounds boneless, skinless chicken thighs, cut into strips ",
				" 1 tablespoon vegetable oil ",
				" 1 onion, thinly sliced ",
				" 1 green bell pepper, sliced ",
				" 1/2 lemon, juiced "
			]
		},
		{
			"name": "Slow Cooker Lemon Garlic Chicken II",
			"reviews": "942",
			"directions": "In a bowl, mix the oregano, salt, and pepper. Rub the mixture into chicken. Melt the butter in a skillet over medium heat. Brown chicken in butter for 3 to 5 minutes on each side. Place chicken in a slow cooker. In the same skillet, mix the water, lemon juice, garlic, and bouillon. Bring the mixture to boil. Pour over the chicken in the slow cooker. Cover, and cook on High for 3 hours, or Low for 6 hours. Add the parsley to the slow cooker 15 to 30 minutes before the end of the cook time.",
			"rating": "4.14657211303711",
			"cook_time": 195,
			"ready_in_time": 210,
			"id": 20198,
			"prep_time": 15,
			"nutrition": [
				"Calories: 192 kcal 10 %",
				"Fat: 7 g 11 %",
				"Carbs: 1.3g < 1 %",
				"Protein: 29.6 g 59 %",
				"Cholesterol: 88 mg 29 %",
				"Sodium: 348 mg 14 %"
			],
			"comment": "Seasoned, browned chicken breasts slow cooked with lemon juice, garlic, and chicken bouillon. A wonderful 'fix and forget' recipe that is easy and pleases just about everyone. Great served with rice or pasta, or even alone.",
			"cal": 192,
			"total_time": 420,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/444473.jpg",
			"ingredients": [
				"1 teaspoon dried oregano ",
				" 1/2 teaspoon salt ",
				" 1/4 teaspoon ground black pepper ",
				" 2 pounds skinless, boneless chicken breast halves ",
				" 2 tablespoons butter ",
				" 1/4 cup water ",
				" 3 tablespoons fresh lemon juice ",
				" 2 cloves garlic, minced ",
				" 1 teaspoon chicken bouillon granules ",
				" 1 teaspoon chopped fresh parsley "
			]
		},
		{
			"name": "Garlic-Lemon Double Stuffed Chicken",
			"reviews": "824",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Lightly coat a large, shallow baking dish with oil. Butterfly each breast by slicing in half horizontally through the center, cutting almost but not completely through. Place one slice each of Cheddar and cream cheese in the center of each breast. Close again as if placing between the pages of a book. Set aside. Pour milk into a shallow bowl. In a separate bowl, combine breadcrumbs and Romano cheese. Carefully dip each breast first in milk, then in breadcrumb mixture, patting lightly to firmly coat. Place breasts side by side in a single layer in pre-oiled baking dish, tucking edges under to seal. Melt butter in a small saucepan over medium heat. Stir in lemon juice and garlic, and drizzle evenly over chicken. Season breasts with garlic salt and paprika, if using. Bake in preheated oven for 30 minutes, or until no longer pink in center and juices run clear.",
			"rating": "4.60619068145752",
			"cook_time": 30,
			"ready_in_time": 50,
			"id": 20199,
			"prep_time": 20,
			"nutrition": [
				"Calories: 642 kcal 32 %",
				"Fat: 44.7 g 69 %",
				"Carbs: 19g 6 %",
				"Protein: 40.4 g 81 %",
				"Cholesterol: 184 mg 61 %",
				"Sodium: 1049 mg 42 %"
			],
			"comment": "Not your everyday chicken dish! Stuffed with Cheddar and cream cheeses, then drenched with a garlic-lemon-butter sauce, your friends and family will be begging you to make this recipe - believe me, I know!",
			"cal": 642,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/193160.jpg",
			"ingredients": [
				"oil, for greasing pan ",
				" 8 boneless, skinless chicken breast halves ",
				" 1 (8 ounce) package cream cheese, cut into 1/2 inch slices ",
				" 1 (8 ounce) package Cheddar cheese, cut into 1/2 inch slices ",
				" 1 cup milk ",
				" 1 1/2 cups Italian seasoned bread crumbs ",
				" 1/2 cup grated Romano cheese ",
				" 1 tablespoon minced garlic ",
				" 3/4 cup butter, melted ",
				" 2 tablespoons lemon juice ",
				" 1/2 teaspoon garlic salt, or to taste ",
				" 1/2 teaspoon paprika (optional) "
			]
		},
		{
			"name": "Mulligatawny Soup I",
			"reviews": "953",
			"directions": "Saute onions, celery, carrot, and butter in a large soup pot. Add flour and curry, and cook 5 more minutes. Add chicken stock, mix well, and bring to a boil. Simmer about 1/2 hour. Add apple, rice, chicken, salt, pepper, and thyme. Simmer 15-20 minutes, or until rice is done. When serving, add hot cream.",
			"rating": "4.78980398178101",
			"cook_time": 60,
			"ready_in_time": 80,
			"id": 20200,
			"prep_time": 20,
			"nutrition": [
				"Calories: 223 kcal 11 %",
				"Fat: 15.8 g 24 %",
				"Carbs: 13.5g 4 %",
				"Protein: 6.9 g 14 %",
				"Cholesterol: 62 mg 21 %",
				"Sodium: 734 mg 29 %"
			],
			"comment": "The name Mulligatawny means 'pepper water', and curry is the particular ingredient that gives this incredible soup such a delicious flavor...so I'm told. This old recipe was given to me long ago.",
			"cal": 223,
			"total_time": 160,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1096121.jpg",
			"ingredients": [
				"1/2 cup chopped onion ",
				" 2 stalks celery, chopped ",
				" 1 carrot, diced ",
				" 1/4 cup butter ",
				" 1 1/2 tablespoons all-purpose flour ",
				" 1 1/2 teaspoons curry powder ",
				" 4 cups chicken broth ",
				" 1/2 apple, cored and chopped ",
				" 1/4 cup white rice ",
				" 1 skinless, boneless chicken breast half - cut into cubes ",
				" salt to taste ",
				" ground black pepper to taste ",
				" 1 pinch dried thyme ",
				" 1/2 cup heavy cream, heated "
			]
		}
	]
}