{
	"foods": [
		{
			"name": "Red Lentil Curry",
			"reviews": "793",
			"directions": "Wash the lentils in cold water until the water runs clear. Put lentils in a pot with enough water to cover; bring to a boil, place a cover on the pot, reduce heat to medium-low, and simmer, adding water during cooking as needed to keep covered, until tender, 15 to 20 minutes. Drain. Heat vegetable oil in a large skillet over medium heat; cook and stir onions in hot oil until caramelized, about 20 minutes. Mix curry paste, curry powder, turmeric, cumin, chili powder, salt, sugar, garlic, and ginger together in a large bowl; stir into the onions. Increase heat to high and cook, stirring constantly, until fragrant, 1 to 2 minutes. Stir in the tomato puree, remove from heat and stir into the lentils.",
			"rating": "4.49689435958862",
			"cook_time": 30,
			"ready_in_time": 40,
			"id": 22701,
			"prep_time": 10,
			"nutrition": [
				"Calories: 192 kcal 10 %",
				"Fat: 2.6 g 4 %",
				"Carbs: 32.5g 10 %",
				"Protein: 12.1 g 24 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 572 mg 23 %"
			],
			"comment": "This is a rich and hearty lentil curry, great as a main meal rather than as a side dish like the more traditional Indian dhal. Don't let the ingredient list faze you, this really is an easy dish to make. This dish is great served with basmati rice.",
			"cal": 192,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/490284.jpg",
			"ingredients": [
				"2 cups red lentils ",
				" 1 large onion, diced ",
				" 1 tablespoon vegetable oil ",
				" 2 tablespoons curry paste ",
				" 1 tablespoon curry powder ",
				" 1 teaspoon ground turmeric ",
				" 1 teaspoon ground cumin ",
				" 1 teaspoon chili powder ",
				" 1 teaspoon salt ",
				" 1 teaspoon white sugar ",
				" 1 teaspoon minced garlic ",
				" 1 teaspoon minced fresh ginger ",
				" 1 (14.25 ounce) can tomato puree "
			]
		},
		{
			"name": "Chicken Tikka Masala",
			"reviews": "2026",
			"directions": "In a large bowl, combine yogurt, lemon juice, 2 teaspoons cumin, cinnamon, cayenne, black pepper, ginger, and 4 teaspoons salt. Stir in chicken, cover, and refrigerate for 1 hour. Preheat a grill for high heat. Lightly oil the grill grate. Thread chicken onto skewers, and discard marinade. Grill until juices run clear, about 5 minutes on each side. Melt butter in a large heavy skillet over medium heat. Saute garlic and jalapeno for 1 minute. Season with 2 teaspoons cumin, paprika, and 3 teaspoons salt. Stir in tomato sauce and cream. Simmer on low heat until sauce thickens, about 20 minutes. Add grilled chicken, and simmer for 10 minutes. Transfer to a serving platter, and garnish with fresh cilantro.",
			"rating": "4.38589859008789",
			"cook_time": 50,
			"ready_in_time": 140,
			"id": 22702,
			"prep_time": 30,
			"nutrition": [
				"Calories: 404 kcal 20 %",
				"Fat: 28.9 g 44 %",
				"Carbs: 13.3g 4 %",
				"Protein: 24.6 g 49 %",
				"Cholesterol: 143 mg 48 %",
				"Sodium: 4499 mg 180 %"
			],
			"comment": "This is an easy recipe for Chicken Tikka Masala - Chicken marinated in yogurt and spices and then served in a tomato cream sauce. Serve with rice or warm pita bread.",
			"cal": 404,
			"total_time": 220,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/39905.jpg",
			"ingredients": [
				"1 cup yogurt ",
				" 1 tablespoon lemon juice ",
				" 2 teaspoons ground cumin ",
				" 1 teaspoon ground cinnamon ",
				" 2 teaspoons cayenne pepper ",
				" 2 teaspoons freshly ground black pepper ",
				" 1 tablespoon minced fresh ginger ",
				" 4 teaspoons salt, or to taste ",
				" 3 boneless skinless chicken breasts, cut into bite-size pieces ",
				" 4 long skewers ",
				" 1 tablespoon butter ",
				" 1 clove garlic, minced ",
				" 1 jalapeno pepper, finely chopped ",
				" 2 teaspoons ground cumin ",
				" 2 teaspoons paprika ",
				" 1 tablespoon salt, or to taste ",
				" 1 (8 ounce) can tomato sauce ",
				" 1 cup heavy cream ",
				" 1/4 cup chopped fresh cilantro "
			]
		},
		{
			"name": "Curried Coconut Chicken",
			"reviews": "2285",
			"directions": "Season chicken pieces with salt and pepper. Heat oil and curry powder in a large skillet over medium-high heat for two minutes. Stir in onions and garlic, and cook 1 minute more. Add chicken, tossing lightly to coat with curry oil. Reduce heat to medium, and cook for 7 to 10 minutes, or until chicken is no longer pink in center and juices run clear. Pour coconut milk, tomatoes, tomato sauce, and sugar into the pan, and stir to combine. Cover and simmer, stirring occasionally, approximately 30 to 40 minutes.",
			"rating": "4.49748134613037",
			"cook_time": 50,
			"ready_in_time": 70,
			"id": 22703,
			"prep_time": 20,
			"nutrition": [
				"Calories: 375 kcal 19 %",
				"Fat: 20.9 g 32 %",
				"Carbs: 16.7g 5 %",
				"Protein: 32.2 g 64 %",
				"Cholesterol: 78 mg 26 %",
				"Sodium: 807 mg 32 %"
			],
			"comment": "Curried chicken simmered in coconut milk and tomatoes makes for a mouthwatering hint of the tropics! Goes great with rice and vegetables.",
			"cal": 375,
			"total_time": 140,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3591067.jpg",
			"ingredients": [
				"2 pounds boneless skinless chicken breasts, cut into 1/2-inch chunks ",
				" 1 teaspoon salt and pepper, or to taste ",
				" 1 1/2 tablespoons vegetable oil ",
				" 2 tablespoons curry powder ",
				" 1/2 onion, thinly sliced ",
				" 2 cloves garlic, crushed ",
				" 1 (14 ounce) can coconut milk ",
				" 1 (14.5 ounce) can stewed, diced tomatoes ",
				" 1 (8 ounce) can tomato sauce ",
				" 3 tablespoons sugar "
			]
		},
		{
			"name": "Broccoli with Garlic Butter and Cashews",
			"reviews": "1389",
			"directions": "Place the broccoli into a large pot with about 1 inch of water in the bottom. Bring to a boil, and cook for 7 minutes, or until tender but still crisp. Drain, and arrange broccoli on a serving platter. While the broccoli is cooking, melt the butter in a small skillet over medium heat. Mix in the brown sugar, soy sauce, vinegar, pepper and garlic. Bring to a boil, then remove from the heat. Mix in the cashews, and pour the sauce over the broccoli. Serve immediately.",
			"rating": "4.57950019836426",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 22704,
			"prep_time": 10,
			"nutrition": [
				"Calories: 187 kcal 9 %",
				"Fat: 14.2 g 22 %",
				"Carbs: 13.2g 4 %",
				"Protein: 5.1 g 10 %",
				"Cholesterol: 27 mg 9 %",
				"Sodium: 611 mg 24 %"
			],
			"comment": "A new recipe a neighbor gave us. What a hit with my family. Just the right mixture of garlic and cashews with our favorite side dish, broccoli. And, so very easy to make!! If in a pinch, you could probably use frozen broccoli too, but I haven't tried.",
			"cal": 187,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/814892.jpg",
			"ingredients": [
				"1 1/2 pounds fresh broccoli, cut into bite size pieces ",
				" 1/3 cup butter ",
				" 1 tablespoon brown sugar ",
				" 3 tablespoons soy sauce ",
				" 2 teaspoons white vinegar ",
				" 1/4 teaspoon ground black pepper ",
				" 2 cloves garlic, minced ",
				" 1/3 cup chopped salted cashews "
			]
		},
		{
			"name": "Kung Pao Chicken",
			"reviews": "817",
			"directions": "To Make Marinade: Combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil and 1 tablespoon cornstarch/water mixture and mix together. Place chicken pieces in a glass dish or bowl and add marinade. Toss to coat. Cover dish and place in refrigerator for about 30 minutes. To Make Sauce: In a small bowl combine 1 tablespoon wine, 1 tablespoon soy sauce, 1 tablespoon oil, 1 tablespoon cornstarch/water mixture, chili paste, vinegar and sugar. Mix together and add green onion, garlic, water chestnuts and peanuts. In a medium skillet, heat sauce slowly until aromatic. Meanwhile, remove chicken from marinade and saute in a large skillet until meat is white and juices run clear. When sauce is aromatic, add sauteed chicken to it and let simmer together until sauce thickens.",
			"rating": "4.28345823287964",
			"cook_time": 30,
			"ready_in_time": 90,
			"id": 22705,
			"prep_time": 30,
			"nutrition": [
				"Calories: 437 kcal 22 %",
				"Fat: 23.3 g 36 %",
				"Carbs: 25.3g 8 %",
				"Protein: 34.4 g 69 %",
				"Cholesterol: 66 mg 22 %",
				"Sodium: 596 mg 24 %"
			],
			"comment": "Spicy chicken with peanuts, similar to what is served in Chinese restaurants. It is easy to make, and you can be as sloppy with the measurements as you want. They reduce to a nice, thick sauce. Substitute cashews for peanuts, or bamboo shoots for the water chestnuts. You can't go wrong! Enjoy!",
			"cal": 437,
			"total_time": 150,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/290890.jpg",
			"ingredients": [
				"1 pound skinless, boneless chicken breast halves - cut into chunks ",
				" 2 tablespoons white wine ",
				" 2 tablespoons soy sauce ",
				" 2 tablespoons sesame oil, divided ",
				" 2 tablespoons cornstarch, dissolved in 2 tablespoons water ",
				" 1 ounce hot chile paste ",
				" 1 teaspoon distilled white vinegar ",
				" 2 teaspoons brown sugar ",
				" 4 green onions, chopped ",
				" 1 tablespoon chopped garlic ",
				" 1 (8 ounce) can water chestnuts ",
				" 4 ounces chopped peanuts "
			]
		},
		{
			"name": "Szechwan Shrimp",
			"reviews": "1954",
			"directions": "In a bowl, stir together water, ketchup, soy sauce, cornstarch, honey, crushed red pepper, and ground ginger. Set aside. Heat oil in a large skillet over medium-high heat. Stir in green onions and garlic; cook 30 seconds. Stir in shrimp, and toss to coat with oil. Stir in sauce. Cook and stir until sauce is bubbly and thickened.",
			"rating": "4.4175181388855",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 22706,
			"prep_time": 10,
			"nutrition": [
				"Calories: 142 kcal 7 %",
				"Fat: 4.4 g 7 %",
				"Carbs: 6.7g 2 %",
				"Protein: 18.3 g 37 %",
				"Cholesterol: 164 mg 55 %",
				"Sodium: 500 mg 20 %"
			],
			"comment": "Don't let some of the ingredients fool you--this spicy shrimp makes a simple, impressive dish, which I usually make for company. For more or less heat, adjust amount of red pepper. Serve over hot steamed rice.",
			"cal": 142,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1052895.jpg",
			"ingredients": [
				"4 tablespoons water ",
				" 2 tablespoons ketchup ",
				" 1 tablespoon soy sauce ",
				" 2 teaspoons cornstarch ",
				" 1 teaspoon honey ",
				" 1/2 teaspoon crushed red pepper ",
				" 1/4 teaspoon ground ginger ",
				" 1 tablespoon vegetable oil ",
				" 1/4 cup sliced green onions ",
				" 4 cloves garlic, minced ",
				" 12 ounces cooked shrimp, tails removed "
			]
		},
		{
			"name": "Chinese Chicken Fried Rice II",
			"reviews": "1186",
			"directions": "In a small bowl, beat egg with water. Melt butter in a large skillet over medium low heat. Add egg and leave flat for 1 to 2 minutes. Remove from skillet and cut into shreds. Heat oil in same skillet; add onion and saute until soft. Then add rice, soy sauce, pepper and chicken. Stir fry together for about 5 minutes, then stir in egg. Serve hot.",
			"rating": "4.38619089126587",
			"cook_time": 10,
			"ready_in_time": 15,
			"id": 22707,
			"prep_time": 5,
			"nutrition": [
				"Calories: 255 kcal 13 %",
				"Fat: 10.2 g 16 %",
				"Carbs: 25.9g 8 %",
				"Protein: 14.1 g 28 %",
				"Cholesterol: 83 mg 28 %",
				"Sodium: 516 mg 21 %"
			],
			"comment": "Chicken, rice, soy sauce and shredded egg stir fried together. This is a very simple recipe. It is easy, but tasty! Note: Never use rice that you have just cooked.",
			"cal": 255,
			"total_time": 30,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/855246.jpg",
			"ingredients": [
				"1 egg ",
				" 1 tablespoon water ",
				" 1 tablespoon butter ",
				" 1 tablespoon vegetable oil ",
				" 1 onion, chopped ",
				" 2 cups cooked white rice, cold ",
				" 2 tablespoons soy sauce ",
				" 1 teaspoon ground black pepper ",
				" 1 cup cooked, chopped chicken meat "
			]
		},
		{
			"name": "Asian Beef with Snow Peas",
			"reviews": "814",
			"directions": "In a small bowl, combine the soy sauce, rice wine, brown sugar and cornstarch. Set aside. Heat oil in a wok or skillet over medium high heat. Stir-fry ginger and garlic for 30 seconds. Add the steak and stir-fry for 2 minutes or until evenly browned. Add the snow peas and stir-fry for an additional 3 minutes. Add the soy sauce mixture, bring to a boil, stirring constantly. Lower heat and simmer until the sauce is thick and smooth. Serve immediately.",
			"rating": "4.3052544593811",
			"cook_time": 10,
			"ready_in_time": 15,
			"id": 22708,
			"prep_time": 5,
			"nutrition": [
				"Calories: 203 kcal 10 %",
				"Fat: 10 g 15 %",
				"Carbs: 9.7g 3 %",
				"Protein: 16 g 32 %",
				"Cholesterol: 39 mg 13 %",
				"Sodium: 711 mg 28 %"
			],
			"comment": "Stir-fried beef in a light gingery sauce. Serve over steamed rice or hot egg noodles.",
			"cal": 203,
			"total_time": 30,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/971360.jpg",
			"ingredients": [
				"3 tablespoons soy sauce ",
				" 2 tablespoons rice wine ",
				" 1 tablespoon brown sugar ",
				" 1/2 teaspoon cornstarch ",
				" 1 tablespoon vegetable oil ",
				" 1 tablespoon minced fresh ginger root ",
				" 1 tablespoon minced garlic ",
				" 1 pound beef round steak, cut into thin strips ",
				" 8 ounces snow peas "
			]
		},
		{
			"name": "Sinigang na Baka",
			"reviews": "35",
			"directions": "Heat oil in medium stock pot. Saute onion and garlic until tender. Add beef to pot, and saute until browned. Pour in water. Bring to a boil, reduce heat, and simmer 20 to 30 minutes. Place tomatoes and green beans in pot, and continue to simmer for 10 minutes. Stir in bok choy, broccoli and tamarind soup mix. Simmer for an additional 10 minutes.",
			"rating": "4.5625",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 22709,
			"prep_time": 15,
			"nutrition": [
				"Calories: 304 kcal 15 %",
				"Fat: 19.7 g 30 %",
				"Carbs: 15g 5 %",
				"Protein: 17.8 g 36 %",
				"Cholesterol: 51 mg 17 %",
				"Sodium: 1405 mg 56 %"
			],
			"comment": "Simple beef, vegetable, tamarind based soup that we eat over rice! A meal in itself!",
			"cal": 304,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/176495.jpg",
			"ingredients": [
				"2 tablespoons canola oil ",
				" 1 large onion, chopped ",
				" 2 cloves garlic, chopped ",
				" 1 pound beef stew meat, cut into 1 inch cubes ",
				" 1 quart water ",
				" 2 large tomatoes, diced ",
				" 1/2 pound fresh green beans, rinsed and trimmed ",
				" 1/2 medium head bok choy, cut into 1 1/2 inch strips ",
				" 1 head fresh broccoli, cut into bite size pieces ",
				" 1 (1.41 ounce) package tamarind soup base "
			]
		},
		{
			"name": "Mulligatawny Soup I",
			"reviews": "953",
			"directions": "Saute onions, celery, carrot, and butter in a large soup pot. Add flour and curry, and cook 5 more minutes. Add chicken stock, mix well, and bring to a boil. Simmer about 1/2 hour. Add apple, rice, chicken, salt, pepper, and thyme. Simmer 15-20 minutes, or until rice is done. When serving, add hot cream.",
			"rating": "4.78980398178101",
			"cook_time": 60,
			"ready_in_time": 80,
			"id": 22710,
			"prep_time": 20,
			"nutrition": [
				"Calories: 223 kcal 11 %",
				"Fat: 15.8 g 24 %",
				"Carbs: 13.5g 4 %",
				"Protein: 6.9 g 14 %",
				"Cholesterol: 62 mg 21 %",
				"Sodium: 734 mg 29 %"
			],
			"comment": "The name Mulligatawny means 'pepper water', and curry is the particular ingredient that gives this incredible soup such a delicious flavor...so I'm told. This old recipe was given to me long ago.",
			"cal": 223,
			"total_time": 160,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1096121.jpg",
			"ingredients": [
				"1/2 cup chopped onion ",
				" 2 stalks celery, chopped ",
				" 1 carrot, diced ",
				" 1/4 cup butter ",
				" 1 1/2 tablespoons all-purpose flour ",
				" 1 1/2 teaspoons curry powder ",
				" 4 cups chicken broth ",
				" 1/2 apple, cored and chopped ",
				" 1/4 cup white rice ",
				" 1 skinless, boneless chicken breast half - cut into cubes ",
				" salt to taste ",
				" ground black pepper to taste ",
				" 1 pinch dried thyme ",
				" 1/2 cup heavy cream, heated "
			]
		},
		{
			"name": "Mie Goreng - Indonesian Fried Noodles",
			"reviews": "36",
			"directions": "Bring a pan of water to a boil, and cook the ramen until tender, about 3 minutes. Plunge the noodles into cold water to stop the cooking, drain in a colander set in the sink, and drizzle the noodles with 1 tablespoon of vegetable oil. Set aside. Place the chicken strips in a bowl, and toss with olive oil, garlic salt, and black pepper. Heat 1 tablespoon of oil in a wok over high heat, and cook and stir the chicken until it is no longer pink, about 5 minutes. Stir in the shallots and garlic, and cook and stir until they start to turn brown. Add the cabbage, carrots, broccoli, and mushrooms, and cook and stir until the vegetables are tender, about 5 minutes. Stir in the ramen noodles, soy sauce, sweet soy sauce, and oyster sauce, mixing the noodles and sauces into the vegetables and chicken. Bring the mixture to a simmer, sprinkle with salt and pepper, and serve hot.",
			"rating": "4.52173900604248",
			"cook_time": 15,
			"ready_in_time": 35,
			"id": 22712,
			"prep_time": 20,
			"nutrition": [
				"Calories: 356 kcal 18 %",
				"Fat: 14.3 g 22 %",
				"Carbs: 34g 11 %",
				"Protein: 22.7 g 45 %",
				"Cholesterol: 43 mg 14 %",
				"Sodium: 1824 mg 73 %"
			],
			"comment": "This tasty noodle dish is the same one my mom used to make for me when I was growing up. It's definitely comfort food. You can alter it with adding your favorite meats and veggies.",
			"cal": 356,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/294621.jpg",
			"ingredients": [
				"3 (3 ounce) packages ramen noodles (without flavor packets) ",
				" 1 tablespoon vegetable oil ",
				" 1 pound skinless, boneless chicken breast halves, cut into strips ",
				" 1 teaspoon olive oil ",
				" 1 teaspoon garlic salt ",
				" 1 pinch ground black pepper, or to taste ",
				" 1 tablespoon vegetable oil ",
				" 1/2 cup chopped shallots ",
				" 5 cloves garlic, chopped ",
				" 1 cup shredded cabbage ",
				" 1 cup shredded carrots ",
				" 1 cup broccoli florets ",
				" 1 cup sliced fresh mushrooms ",
				" 1/4 cup soy sauce ",
				" 1/4 cup sweet soy sauce (Indonesian kecap manis) ",
				" 1/4 cup oyster sauce ",
				" salt and pepper to taste "
			]
		},
		{
			"name": "Asian Orange Chicken",
			"reviews": "1266",
			"directions": "Pour 1 1/2 cups water, orange juice, lemon juice, rice vinegar, and soy sauce into a saucepan and set over medium-high heat. Stir in the orange zest, brown sugar, ginger, garlic, chopped onion, and red pepper flakes. Bring to a boil. Remove from heat, and cool 10 to 15 minutes. Place the chicken pieces into a resealable plastic bag. When contents of saucepan have cooled, pour 1 cup of sauce into bag. Reserve the remaining sauce. Seal the bag, and refrigerate at least 2 hours. In another resealable plastic bag, mix the flour, salt, and pepper. Add the marinated chicken pieces, seal the bag, and shake to coat. Heat the olive oil in a large skillet over medium heat. Place chicken into the skillet, and brown on both sides. Drain on a plate lined with paper towels, and cover with aluminum foil. Wipe out the skillet, and add the sauce. Bring to a boil over medium-high heat. Mix together the cornstarch and 2 tablespoons water; stir into the sauce. Reduce heat to medium low, add the chicken pieces, and simmer, about 5 minutes, stirring occasionally.",
			"rating": "4.45454549789429",
			"cook_time": 40,
			"ready_in_time": 200,
			"id": 22713,
			"prep_time": 40,
			"nutrition": [
				"Calories: 445 kcal 22 %",
				"Fat: 11.2 g 17 %",
				"Carbs: 68.7g 22 %",
				"Protein: 17.8 g 36 %",
				"Cholesterol: 34 mg 11 %",
				"Sodium: 763 mg 31 %"
			],
			"comment": "A delicious citrus chicken recipe with flavors reminiscent of the orange chicken from a popular restaurant in the mall.",
			"cal": 445,
			"total_time": 280,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1207689.jpg",
			"ingredients": [
				"Sauce: ",
				" 1 1/2 cups water ",
				" 2 tablespoons orange juice ",
				" 1/4 cup lemon juice ",
				" 1/3 cup rice vinegar ",
				" 2 1/2 tablespoons soy sauce ",
				" 1 tablespoon grated orange zest ",
				" 1 cup packed brown sugar ",
				" 1/2 teaspoon minced fresh ginger root ",
				" 1/2 teaspoon minced garlic ",
				" 2 tablespoons chopped green onion ",
				" 1/4 teaspoon red pepper flakes ",
				" 3 tablespoons cornstarch ",
				" 2 tablespoons water ",
				" Chicken: ",
				" 2 boneless, skinless chicken breasts, cut into 1/2 inch pieces ",
				" 1 cup all-purpose flour ",
				" 1/4 teaspoon salt ",
				" 1/4 teaspoon pepper ",
				" 3 tablespoons olive oil "
			]
		},
		{
			"name": "Naan",
			"reviews": "1614",
			"directions": "In a large bowl, dissolve yeast in warm water. Let stand about 10 minutes, until frothy. Stir in sugar, milk, egg, salt, and enough flour to make a soft dough. Knead for 6 to 8 minutes on a lightly floured surface, or until smooth. Place dough in a well oiled bowl, cover with a damp cloth, and set aside to rise. Let it rise 1 hour, until the dough has doubled in volume. Punch down dough, and knead in garlic. Pinch off small handfuls of dough about the size of a golf ball. Roll into balls, and place on a tray. Cover with a towel, and allow to rise until doubled in size, about 30 minutes. During the second rising, preheat grill to high heat. At grill side, roll one ball of dough out into a thin circle. Lightly oil grill. Place dough on grill, and cook for 2 to 3 minutes, or until puffy and lightly browned. Brush uncooked side with butter, and turn over. Brush cooked side with butter, and cook until browned, another 2 to 4 minutes. Remove from grill, and continue the process until all the naan has been prepared.",
			"rating": "4.70599269866943",
			"cook_time": 7,
			"ready_in_time": 180,
			"id": 22714,
			"prep_time": 30,
			"nutrition": [
				"Calories: 211 kcal 11 %",
				"Fat: 4.5 g 7 %",
				"Carbs: 36g 12 %",
				"Protein: 6.1 g 12 %",
				"Cholesterol: 22 mg 7 %",
				"Sodium: 364 mg 15 %"
			],
			"comment": "This recipe makes the best naan I have tasted outside of an Indian restaurant. I can't make enough of it for my family. I serve it with shish kabobs, but I think they would eat it plain.",
			"cal": 211,
			"total_time": 217,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/115386.jpg",
			"ingredients": [
				"1 (.25 ounce) package active dry yeast ",
				" 1 cup warm water ",
				" 1/4 cup white sugar ",
				" 3 tablespoons milk ",
				" 1 egg, beaten ",
				" 2 teaspoons salt ",
				" 4 1/2 cups bread flour ",
				" 2 teaspoons minced garlic (optional) ",
				" 1/4 cup butter, melted "
			]
		},
		{
			"name": "Chicken Makhani (Indian Butter Chicken)",
			"reviews": "841",
			"directions": "Heat 1 tablespoon oil in a large saucepan over medium high heat. Saute shallot and onion until soft and translucent. Stir in butter, lemon juice, ginger-garlic paste, 1 teaspoon garam masala, chili powder, cumin and bay leaf. Cook, stirring, for 1 minute. Add tomato sauce, and cook for 2 minutes, stirring frequently. Stir in half-and-half and yogurt. Reduce heat to low, and simmer for 10 minutes, stirring frequently. Season with salt pepper. Remove from heat and set aside. Heat 1 tablespoon oil in a large heavy skillet over medium heat. Cook chicken until lightly browned, about 10 minutes. Reduce heat, and season with 1 teaspoon garam masala and cayenne. Stir in a few spoonfuls of sauce, and simmer until liquid has reduced, and chicken is no longer pink. Stir cooked chicken into sauce. Mix together cornstarch and water, then stir into the sauce. Cook for 5 to 10 minutes, or until thickened.",
			"rating": "4.49310350418091",
			"cook_time": 25,
			"ready_in_time": 35,
			"id": 22715,
			"prep_time": 10,
			"nutrition": [
				"Calories: 408 kcal 20 %",
				"Fat: 27.8 g 43 %",
				"Carbs: 15.6g 5 %",
				"Protein: 23.4 g 47 %",
				"Cholesterol: 107 mg 36 %",
				"Sodium: 523 mg 21 %"
			],
			"comment": "Chicken Makhani is one of my favorite Indian dishes. It is a full flavored dish that complements the chicken well. It can be made as mild or spicy as you wish by adjusting the cayenne. Serve with basmati rice and naan bread.",
			"cal": 408,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/63121.jpg",
			"ingredients": [
				"1 tablespoon peanut oil ",
				" 1 shallot, finely chopped ",
				" 1/4 white onion, chopped ",
				" 2 tablespoons butter ",
				" 2 teaspoons lemon juice ",
				" 1 tablespoon ginger garlic paste ",
				" 1 teaspoon garam masala ",
				" 1 teaspoon chili powder ",
				" 1 teaspoon ground cumin ",
				" 1 bay leaf ",
				" 1/4 cup plain yogurt ",
				" 1 cup half-and-half ",
				" 1 cup tomato puree ",
				" 1/4 teaspoon cayenne pepper, or to taste ",
				" 1 pinch salt ",
				" 1 pinch black pepper ",
				" 1 tablespoon peanut oil ",
				" 1 pound boneless, skinless chicken thighs, cut into bite-size pieces ",
				" 1 teaspoon garam masala ",
				" 1 pinch cayenne pepper ",
				" 1 tablespoon cornstarch ",
				" 1/4 cup water "
			]
		},
		{
			"name": "Asian Lettuce Wraps",
			"reviews": "1395",
			"directions": "Rinse whole lettuce leaves and pat dry, being careful not tear them. Set aside. Heat a large skillet over medium-high heat. Cook and stir beef and cooking oil in the hot skillet until browned and crumbly, 5 to 7 minutes. Drain and discard grease; transfer beef to a bowl. Cook and stir onion in the same skillet used for beef until slightly tender, 5 to 10 minutes. Stir hoisin sauce, garlic, soy sauce, vinegar, ginger, and chile pepper sauce into onions. Add water chestnuts, green onions, sesame oil, and cooked beef; cook and stir until the onions just begin to wilt, about 2 minutes. Arrange lettuce leaves around the outer edge of a large serving platter and pile meat mixture in the center.",
			"rating": "4.61936140060425",
			"cook_time": 15,
			"ready_in_time": 35,
			"id": 22716,
			"prep_time": 20,
			"nutrition": [
				"Calories: 388 kcal 19 %",
				"Fat: 22.3 g 34 %",
				"Carbs: 24.3g 8 %",
				"Protein: 23.4 g 47 %",
				"Cholesterol: 69 mg 23 %",
				"Sodium: 580 mg 23 %"
			],
			"comment": "Delicious and bursting with flavor, Asian lettuce wraps are a great idea for entertaining or a family style meal. Each person can build their own fresh, delicious wrap. Just be sure to have plates or napkins available since the mixture can sometimes drip a little. To serve, allow each person to spoon a portion of the meat into a lettuce leaf. Wrap the lettuce around the meat like a burrito and enjoy!",
			"cal": 388,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2630776.jpg",
			"ingredients": [
				"16 Boston Bibb or butter lettuce leaves ",
				" 1 pound lean ground beef ",
				" 1 tablespoon cooking oil ",
				" 1 large onion, chopped ",
				" 1/4 cup hoisin sauce ",
				" 2 cloves fresh garlic, minced ",
				" 1 tablespoon soy sauce ",
				" 1 tablespoon rice wine vinegar ",
				" 2 teaspoons minced pickled ginger ",
				" 1 dash Asian chile pepper sauce, or to taste (optional) ",
				" 1 (8 ounce) can water chestnuts, drained and finely chopped ",
				" 1 bunch green onions, chopped ",
				" 2 teaspoons Asian (dark) sesame oil "
			]
		},
		{
			"name": "Beef Yakitori",
			"reviews": "180",
			"directions": "In a glass or plastic bowl, whisk together the soy sauce, oil, lemon juice, sesame seeds, sugar, green onions, garlic, and ginger. Thread the meat onto skewers. (If you are using wooden skewers, soak them 30 minutes first.) Place the skewers in a plastic or glass container just large enough to hold them, and pour the marinade over the meat, turning to coat well. Cover, and chill for a minimum of 4 hours. Preheat grill for high heat, and position grate 5 inches from coals. Brush grate with oil, and place skewers on grill. Grill for 10 to 15 minutes, occasionally turning kabobs to ensure even cooking.",
			"rating": "4.54918050765991",
			"cook_time": 15,
			"ready_in_time": 270,
			"id": 22717,
			"prep_time": 15,
			"nutrition": [
				"Calories: 367 kcal 18 %",
				"Fat: 25 g 39 %",
				"Carbs: 10.8g 3 %",
				"Protein: 24.4 g 49 %",
				"Cholesterol: 76 mg 25 %",
				"Sodium: 1866 mg 75 %"
			],
			"comment": "This marinade is delicious with beef, but is great with pork or chicken too. You will need to adjust the cooking time depending upon the meat or poultry you use for the skewers.",
			"cal": 367,
			"total_time": 300,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/236815.jpg",
			"ingredients": [
				"1/2 cup soy sauce ",
				" 2 tablespoons vegetable oil ",
				" 2 tablespoons lemon juice ",
				" 1 tablespoon sesame seeds ",
				" 2 tablespoons white sugar ",
				" 2 green onions, thinly sliced ",
				" 1 clove garlic, minced ",
				" 1/2 teaspoon ground ginger ",
				" 1 pound sirloin steak, cubed "
			]
		},
		{
			"name": "Fried Rice Restaurant Style",
			"reviews": "840",
			"directions": "In a saucepan, combine rice and water. Bring to a boil. Reduce heat, cover, and simmer for 20 minutes. In a small saucepan, boil carrots in water about 3 to 5 minutes. Drop peas into boiling water, and drain. Heat wok over high heat. Pour in oil, then stir in carrots and peas; cook about 30 seconds. Crack in eggs, stirring quickly to scramble eggs with vegetables. Stir in cooked rice. Shake in soy sauce, and toss rice to coat. Drizzle with sesame oil, and toss again.",
			"rating": "4.32337427139282",
			"cook_time": 30,
			"ready_in_time": 45,
			"id": 22718,
			"prep_time": 15,
			"nutrition": [
				"Calories: 261 kcal 13 %",
				"Fat: 8.4 g 13 %",
				"Carbs: 39.7g 13 %",
				"Protein: 5.8 g 12 %",
				"Cholesterol: 46 mg 16 %",
				"Sodium: 381 mg 15 %"
			],
			"comment": "A quick fried rice like you get at your favorite Chinese restaurant. A couple of eggs, baby carrots, peas and soy sauce is all you need.",
			"cal": 261,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/431469.jpg",
			"ingredients": [
				"2 cups enriched white rice ",
				" 4 cups water ",
				" 2/3 cup chopped baby carrots ",
				" 1/2 cup frozen green peas ",
				" 2 tablespoons vegetable oil ",
				" 2 eggs ",
				" soy sauce to taste ",
				" sesame oil, to taste (optional) "
			]
		},
		{
			"name": "Sesame Pasta Chicken Salad",
			"reviews": "924",
			"directions": "Heat a skillet over medium-high heat. Add sesame seeds, and cook stirring frequently until lightly toasted. Remove from heat, and set aside. Bring a large pot of lightly salted water to a boil. Add pasta, and cook for 8 to 10 minutes, or until al dente. Drain pasta, and rinse under cold water until cool. Transfer to a large bowl. In a jar with a tight-fitting lid, combine vegetable oil, soy sauce, vinegar, sesame oil, sugar, sesame seeds, ginger, and pepper. Shake well. Pour sesame dressing over pasta, and toss to coat evenly. Gently mix in chicken, cilantro, and green onions.",
			"rating": "4.44816589355469",
			"cook_time": 10,
			"ready_in_time": 30,
			"id": 22719,
			"prep_time": 20,
			"nutrition": [
				"Calories: 349 kcal 17 %",
				"Fat: 15.2 g 23 %",
				"Carbs: 38.3g 12 %",
				"Protein: 15.9 g 32 %",
				"Cholesterol: 24 mg 8 %",
				"Sodium: 308 mg 12 %"
			],
			"comment": "A refreshing light pasta salad with a delicious Asian flair. Great for a summer cookout or picnic. Tastes great right away, and even better if you can allow it to marinate for a while.",
			"cal": 349,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/92940.jpg",
			"ingredients": [
				"1/4 cup sesame seeds ",
				" 1 (16 ounce) package bow tie pasta ",
				" 1/2 cup vegetable oil ",
				" 1/3 cup light soy sauce ",
				" 1/3 cup rice vinegar ",
				" 1 teaspoon sesame oil ",
				" 3 tablespoons white sugar ",
				" 1/2 teaspoon ground ginger ",
				" 1/4 teaspoon ground black pepper ",
				" 3 cups shredded, cooked chicken breast meat ",
				" 1/3 cup chopped fresh cilantro ",
				" 1/3 cup chopped green onion "
			]
		},
		{
			"name": "Gyoza",
			"reviews": "128",
			"directions": "Heat sesame oil in a large skillet over medium high heat. Mix in cabbage, onion, garlic and carrot. Cook and stir until cabbage is limp. Mix in ground pork and egg. Cook until pork is evenly brown and egg is no longer runny. Preheat vegetable oil in a large skillet over medium high heat. Place approximately 1 tablespoon of the cabbage and pork mixture in the center of each wrapper. Fold wrappers in half over filling, and seal edges with moistened fingers. In the preheated vegetable oil, cook gyoza approximately 1 minute per side, until lightly browned. Place water into skillet and reduce heat. Cover and allow gyoza to steam until the water is gone. In a small bowl, mix soy sauce and rice vinegar. Use the mixture as a dipping sauce for the finished wrappers.",
			"rating": "4.4219651222229",
			"cook_time": 5,
			"ready_in_time": 45,
			"id": 22720,
			"prep_time": 40,
			"nutrition": [
				"Calories: 184 kcal 9 %",
				"Fat: 8.5 g 13 %",
				"Carbs: 18.5g 6 %",
				"Protein: 7.9 g 16 %",
				"Cholesterol: 37 mg 12 %",
				"Sodium: 546 mg 22 %"
			],
			"comment": "I learned this recipe for pot stickers while living in Japan. They're great hot or cold, and may be eaten plain or with the dipping sauce. Any ground meat can be substituted for pork.",
			"cal": 184,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/345302.jpg",
			"ingredients": [
				"1 tablespoon sesame oil ",
				" 2 cups chopped cabbage ",
				" 1/4 cup chopped onion ",
				" 1 clove garlic, chopped ",
				" 1/4 cup chopped carrot ",
				" 1/2 pound ground pork ",
				" 1 egg ",
				" 1 tablespoon vegetable oil ",
				" 1 (10 ounce) package wonton wrappers ",
				" 1/4 cup water ",
				" 1/4 cup soy sauce ",
				" 2 tablespoons rice vinegar "
			]
		},
		{
			"name": "Indian Chicken Curry II",
			"reviews": "871",
			"directions": "Heat olive oil in a skillet over medium heat. Saute onion until lightly browned. Stir in garlic, curry powder, cinnamon, paprika, bay leaf, ginger, sugar and salt. Continue stirring for 2 minutes. Add chicken pieces, tomato paste, yogurt, and coconut milk. Bring to a boil, reduce heat, and simmer for 20 to 25 minutes. Remove bay leaf, and stir in lemon juice and cayenne pepper. Simmer 5 more minutes.",
			"rating": "4.26909732818604",
			"cook_time": 25,
			"ready_in_time": 45,
			"id": 22721,
			"prep_time": 20,
			"nutrition": [
				"Calories: 313 kcal 16 %",
				"Fat: 21.7 g 33 %",
				"Carbs: 14g 5 %",
				"Protein: 19.1 g 38 %",
				"Cholesterol: 38 mg 13 %",
				"Sodium: 268 mg 11 %"
			],
			"comment": "This is an adaptation of yellow chicken curry from India. The aromas and flavors are a delight to the senses! It is best served with fresh Naan bread and Jasmine or Basmati rice.",
			"cal": 313,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/111308.jpg",
			"ingredients": [
				"3 tablespoons olive oil ",
				" 1 small onion, chopped ",
				" 2 cloves garlic, minced ",
				" 3 tablespoons curry powder ",
				" 1 teaspoon ground cinnamon ",
				" 1 teaspoon paprika ",
				" 1 bay leaf ",
				" 1/2 teaspoon grated fresh ginger root ",
				" 1/2 teaspoon white sugar ",
				" salt to taste ",
				" 2 skinless, boneless chicken breast halves - cut into bite-size pieces ",
				" 1 tablespoon tomato paste ",
				" 1 cup plain yogurt ",
				" 3/4 cup coconut milk ",
				" 1/2 lemon, juiced ",
				" 1/2 teaspoon cayenne pepper "
			]
		},
		{
			"name": "Japanese Chicken Wings",
			"reviews": "1005",
			"directions": "Preheat oven to 350 degrees F (175 degrees C). Cut wings in half, dip in egg and coat with flour. Heat butter in a large, deep skillet over medium-high heat. Fry wings until deep brown. Place in a shallow roasting pan. In a small bowl combine soy sauce, water, sugar, vinegar, garlic powder and salt. Pour over wings. Bake in preheated oven for 30 to 45 minutes, basting wings with sauce often.",
			"rating": "4.68867921829224",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 22722,
			"prep_time": 15,
			"nutrition": [
				"Calories: 675 kcal 34 %",
				"Fat: 44.3 g 68 %",
				"Carbs: 51.4g 17 %",
				"Protein: 18.9 g 38 %",
				"Cholesterol: 158 mg 53 %",
				"Sodium: 1112 mg 44 %"
			],
			"comment": "Chicken wings are egged and fried in butter, then baked in a tangy sauce of soy sauce, water, sugar, vinegar, garlic powder and salt. Delicious, sticky chicken wings!",
			"cal": 675,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/39538.jpg",
			"ingredients": [
				"3 pounds chicken wings ",
				" 1 egg, lightly beaten ",
				" 1 cup all-purpose flour for coating ",
				" 1 cup butter ",
				" SAUCE ",
				" 3 tablespoons soy sauce ",
				" 3 tablespoons water ",
				" 1 cup white sugar ",
				" 1/2 cup white vinegar ",
				" 1/2 teaspoon garlic powder, or to taste ",
				" 1 teaspoon salt "
			]
		},
		{
			"name": "Thai Ginger Chicken (Gai Pad King)",
			"reviews": "73",
			"directions": "Bring the rice and water to a boil in a saucepan. Reduce heat to medium-low; cover and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes. Meanwhile, heat a wok or large skillet over medium-high heat. Stir in the garlic and chicken; cook for 2 minutes. Add the fish sauce, oyster sauce, sugar, ginger, red pepper, mushrooms, and onions. Cook and stir until the chicken is no longer pink and the vegetables are nearly tender, about 3 minutes. Dissolve the chile paste in the chicken broth, then add to the chicken mixture. Season to taste with salt and pepper; sprinkle with cilantro leaves to garnish. Serve with the hot rice.",
			"rating": "4.69565200805664",
			"cook_time": 20,
			"ready_in_time": 50,
			"id": 22724,
			"prep_time": 30,
			"nutrition": [
				"Calories: 491 kcal 25 %",
				"Fat: 9.9 g 15 %",
				"Carbs: 68.3g 22 %",
				"Protein: 30.2 g 60 %",
				"Cholesterol: 65 mg 22 %",
				"Sodium: 376 mg 15 %"
			],
			"comment": "My family loved ordering this dish at our local Thai restaurant, but then they closed down for some unknown reason (they were always busy). So I decided to recreate this traditional dish at home. My husband says it's just like the restaurant...maybe even better? Please note that some people like to eat the ginger, while others don't but like the flavor it gives off. You can easily double this recipe to serve a larger group...plus it makes great leftovers.",
			"cal": 491,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/215482.jpg",
			"ingredients": [
				"1 1/2 cups uncooked jasmine rice ",
				" 3 1/2 cups water ",
				" 2 tablespoons vegetable oil ",
				" 3 cloves garlic, minced ",
				" 1 pound skinless, boneless chicken breast halves - cut into thin strips ",
				" 1 tablespoon Asian fish sauce ",
				" 1 tablespoon oyster sauce ",
				" 1 tablespoon white sugar ",
				" 1/2 cup fresh ginger, cut into matchsticks ",
				" 1 large red bell pepper, cut into strips ",
				" 3/4 cup sliced fresh mushrooms ",
				" 4 green onions cut into 2-inch pieces ",
				" 1/2 teaspoon Thai red chile paste, or to taste ",
				" 2 tablespoons chicken broth ",
				" salt and ground black pepper to taste ",
				" 2 tablespoons fresh cilantro leaves "
			]
		},
		{
			"name": "Peanut Butter Noodles",
			"reviews": "1054",
			"directions": "Bring a large pot of water to a boil. Add noodles and cook until tender according to package directions. Drain. Meanwhile, combine chicken broth, ginger, soy sauce, peanut butter, honey, chili paste, and garlic in a small saucepan. Cook over medium heat until peanut butter melts and is heated through. Add noodles, and toss to coat. Garnish with green onions and peanuts.",
			"rating": "4.46016502380371",
			"cook_time": 10,
			"ready_in_time": 25,
			"id": 22725,
			"prep_time": 15,
			"nutrition": [
				"Calories: 330 kcal 16 %",
				"Fat: 12 g 18 %",
				"Carbs: 46.8g 15 %",
				"Protein: 10.7 g 21 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 1188 mg 48 %"
			],
			"comment": "This is kid friendly with an Asian twist. Can also be made with spaghetti pasta.",
			"cal": 330,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/422062.jpg",
			"ingredients": [
				"1/2 cup chicken broth ",
				" 1 1/2 tablespoons minced fresh ginger root ",
				" 3 tablespoons soy sauce ",
				" 3 tablespoons peanut butter ",
				" 1 1/2 tablespoons honey ",
				" 2 teaspoons hot chile paste (optional) ",
				" 3 cloves garlic, minced ",
				" 8 ounces Udon noodles ",
				" 1/4 cup chopped green onions ",
				" 1/4 cup chopped peanuts "
			]
		},
		{
			"name": "Kalbi (Korean BBQ Short Ribs)",
			"reviews": "97",
			"directions": "In a bowl, stir together the soy sauce, brown sugar, water, garlic, green onions, and sesame oil until the sugar has dissolved. Place the ribs in a large plastic zipper bag. Pour the marinade over the ribs, squeeze out all the air, and refrigerate the bag for 3 hours to overnight. Preheat an outdoor grill for medium-high heat, and lightly oil the grate. Remove the ribs from the bag, shake off the excess marinade, and discard the marinade. Grill the ribs on the preheated grill until the meat is still pink but not bloody nearest the bone, 5 to 7 minutes per side.",
			"rating": "4.75862073898315",
			"cook_time": 15,
			"ready_in_time": 210,
			"id": 22726,
			"prep_time": 15,
			"nutrition": [
				"Calories: 1096 kcal 55 %",
				"Fat: 85.6 g 132 %",
				"Carbs: 44.9g 14 %",
				"Protein: 35.9 g 72 %",
				"Cholesterol: 172 mg 57 %",
				"Sodium: 2831 mg 113 %"
			],
			"comment": "This is the staple of Korean fine dining, but too expensive in the restaurants. It is also simple to make at home, and will leave your guests asking for more. Total time includes marinating time. Traditionally, should be served sliced, rolled in romaine lettuce leaves, along with white rice, lightly browned garlic slices, and gochujang (Korean red pepper paste).",
			"cal": 1096,
			"total_time": 240,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/716493.jpg",
			"ingredients": [
				"3/4 cup soy sauce ",
				" 3/4 cup brown sugar ",
				" 3/4 cup water ",
				" 1 garlic clove, minced ",
				" 2 green onions, chopped ",
				" 1 tablespoon Asian (toasted) sesame oil ",
				" 2 pounds Korean-style short ribs (beef chuck flanken, cut 1/3 to 1/2 inch thick across bones) "
			]
		},
		{
			"name": "Sweet and Sour Chicken I",
			"reviews": "829",
			"directions": "In a saucepan, combine 1 1/2 cups water, sugar, vinegar, reserved pineapple juice, and orange food coloring. Heat to boiling. Turn off heat. Combine 1/4 cup cornstarch and 1/4 cup water; slowly stir into saucepan. Continue stirring until mixture thickens. Combine flour, 2 tablespoons oil, 2 tablespoons cornstarch, salt, white pepper, and egg. Add 1 1/2 cups water gradually to make a thick batter. Stir to blend thoroughly. Add chicken pieces, and stir until chicken is well coated. Heat oil in skillet or wok to 360 degrees F (180 degrees C). Fry chicken pieces in hot oil 10 minutes, or until golden. Remove chicken, and drain on paper towels. When ready to serve, layer green peppers, pineapple chunks, and cooked chicken pieces on a platter. Pour hot sweet and sour sauce over top.",
			"rating": "4.51301097869873",
			"cook_time": 20,
			"ready_in_time": 60,
			"id": 22727,
			"prep_time": 30,
			"nutrition": [
				"Calories: 639 kcal 32 %",
				"Fat: 18.4 g 28 %",
				"Carbs: 56.2g 18 %",
				"Protein: 59.2 g 118 %",
				"Cholesterol: 160 mg 53 %",
				"Sodium: 759 mg 30 %"
			],
			"comment": "Pan fried chicken cubes served with a sweet and sour sauce.",
			"cal": 639,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1660326.jpg",
			"ingredients": [
				"1 (8 ounce) can pineapple chunks, drained (juice reserved) ",
				" 1/4 cup cornstarch ",
				" 1 3/4 cups water, divided ",
				" 3/4 cup white sugar ",
				" 1/2 cup distilled white vinegar ",
				" 2 drops orange food color ",
				" 8 skinless, boneless chicken breast halves - cut into 1 inch cubes ",
				" 2 1/4 cups self-rising flour ",
				" 2 tablespoons vegetable oil ",
				" 2 tablespoons cornstarch ",
				" 1/2 teaspoon salt ",
				" 1/4 teaspoon ground white pepper ",
				" 1 egg ",
				" 1 1/2 cups water ",
				" 1 quart vegetable oil for frying ",
				" 2 green bell pepper, cut into 1 inch pieces "
			]
		},
		{
			"name": "Vegetarian Korma",
			"reviews": "886",
			"directions": "Heat the oil in a skillet over medium heat. Stir in the onion, and cook until tender. Mix in ginger and garlic, and continue cooking 1 minute. Mix potatoes, carrots, jalapeno, cashews, and tomato sauce. Season with salt and curry powder. Cook and stir 10 minutes, or until potatoes are tender. Stir peas, green bell pepper, red bell pepper, and cream into the skillet. Reduce heat to low, cover, and simmer 10 minutes. Garnish with cilantro to serve.",
			"rating": "4.55674839019775",
			"cook_time": 30,
			"ready_in_time": 55,
			"id": 22728,
			"prep_time": 25,
			"nutrition": [
				"Calories: 462 kcal 23 %",
				"Fat: 31.1 g 48 %",
				"Carbs: 41.3g 13 %",
				"Protein: 8.6 g 17 %",
				"Cholesterol: 82 mg 27 %",
				"Sodium: 1434 mg 57 %"
			],
			"comment": "This is an easy and exotic Indian dish. It's rich, creamy, mildly spiced, and extremely flavorful. Serve with naan and rice.",
			"cal": 462,
			"total_time": 110,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3787267.jpg",
			"ingredients": [
				"1 1/2 tablespoons vegetable oil ",
				" 1 small onion, diced ",
				" 1 teaspoon minced fresh ginger root ",
				" 4 cloves garlic, minced ",
				" 2 potatoes, cubed ",
				" 4 carrots, cubed ",
				" 1 fresh jalapeno pepper, seeded and sliced ",
				" 3 tablespoons ground unsalted cashews ",
				" 1 (4 ounce) can tomato sauce ",
				" 2 teaspoons salt ",
				" 1 1/2 tablespoons curry powder ",
				" 1 cup frozen green peas ",
				" 1/2 green bell pepper, chopped ",
				" 1/2 red bell pepper, chopped ",
				" 1 cup heavy cream ",
				" 1 bunch fresh cilantro for garnish "
			]
		},
		{
			"name": "Mama's Asian Chicken and Rice",
			"reviews": "683",
			"directions": "In a bowl, stir together warm water, brown sugar, orange juice, soy sauce, ketchup, white vinegar, garlic, red pepper flakes, five-spice powder, and orange peel until the sugar has dissolved and the mixture is well combined. Heat the olive oil in a large skillet or wok over medium heat, and cook and stir the chicken until the outside is golden brown and the inside is no longer pink, 10 to 12 minutes. Pour the sauce mixture over the chicken, bring to a boil, reduce heat to medium-low, and cover the skillet. Simmer for 30 minutes, stirring occasionally. While the chicken and sauce are simmering, bring the rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender, and the liquid has been absorbed, 20 to 25 minutes. Set the rice aside and keep warm. Whisk the cornstarch and 2 tablespoons of cold water in a small bowl until smooth, and stir into the chicken and sauce, a few teaspoons at a time. Let the chicken and sauce cook for about 2 minutes to thicken, then serve over hot cooked rice, sprinkled with green onion.",
			"rating": "4.49670314788818",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 22729,
			"prep_time": 15,
			"nutrition": [
				"Calories: 347 kcal 17 %",
				"Fat: 8.4 g 13 %",
				"Carbs: 38g 12 %",
				"Protein: 28.3 g 57 %",
				"Cholesterol: 69 mg 23 %",
				"Sodium: 424 mg 17 %"
			],
			"comment": "A great orange chicken dish!",
			"cal": 347,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/562877.jpg",
			"ingredients": [
				"1/3 cup warm water ",
				" 1/4 cup packed brown sugar ",
				" 2 tablespoons orange juice ",
				" 2 tablespoons soy sauce ",
				" 2 tablespoons ketchup ",
				" 1 tablespoon white vinegar ",
				" 4 cloves garlic, minced ",
				" 1/2 teaspoon crushed red pepper flakes ",
				" 1/4 teaspoon Chinese five-spice powder ",
				" 1 teaspoon grated orange peel ",
				" 2 tablespoons olive oil ",
				" 1 1/2 pounds skinless, boneless chicken breast halves, cubed ",
				" 2 cups water ",
				" 1 cup uncooked white rice ",
				" 2 teaspoons cornstarch ",
				" 2 tablespoons cold water ",
				" chopped green onions for garnish "
			]
		},
		{
			"name": "Chicken Katsu",
			"reviews": "483",
			"directions": "Season the chicken breasts on both sides with salt and pepper. Place the flour, egg and panko crumbs into separate shallow dishes. Coat the chicken breasts in flour, shaking off any excess. Dip them into the egg, and then press into the panko crumbs until well coated on both sides. Heat 1/4 inch of oil in a large skillet over medium-high heat. Place chicken in the hot oil, and cook 3 or 4 minutes per side, or until golden brown.",
			"rating": "4.67741918563843",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 22731,
			"prep_time": 10,
			"nutrition": [
				"Calories: 297 kcal 15 %",
				"Fat: 11.4 g 18 %",
				"Carbs: 22.2g 7 %",
				"Protein: 31.2 g 62 %",
				"Cholesterol: 118 mg 39 %",
				"Sodium: 251 mg 10 %"
			],
			"comment": "This is my family recipe for Chicken Katsu - Japanese style fried chicken. Can also be used to make Tonkatsu, just use pork cutlets instead of chicken. Serve with white rice and tonkatsu sauce.",
			"cal": 297,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/653617.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves - pounded to 1/2 inch thickness ",
				" salt and pepper to taste ",
				" 2 tablespoons all-purpose flour ",
				" 1 egg, beaten ",
				" 1 cup panko bread crumbs ",
				" 1 cup oil for frying, or as needed "
			]
		},
		{
			"name": "The Best Thai Coconut Soup",
			"reviews": "585",
			"directions": "Heat the oil in a large pot over medium heat. Cook and stir the ginger, lemongrass, and curry paste in the heated oil for 1 minute. Slowly pour the chicken broth over the mixture, stirring continually. Stir in the fish sauce and brown sugar; simmer for 15 minutes. Stir in the coconut milk and mushrooms; cook and stir until the mushrooms are soft, about 5 minutes. Add the shrimp; cook until no longer translucent about 5 minutes. Stir in the lime juice; season with salt; garnish with cilantro.",
			"rating": "4.6487603187561",
			"cook_time": 30,
			"ready_in_time": 65,
			"id": 22732,
			"prep_time": 35,
			"nutrition": [
				"Calories: 375 kcal 19 %",
				"Fat: 33.2 g 51 %",
				"Carbs: 9.4g 3 %",
				"Protein: 13.7 g 27 %",
				"Cholesterol: 89 mg 30 %",
				"Sodium: 1059 mg 42 %"
			],
			"comment": "Authentic, bold, and delicious Thai flavors make this soup irresistible! This is the best Thai coconut soup I've had. You won't be disappointed with this one! Serve over steamed rice.",
			"cal": 375,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2319909.jpg",
			"ingredients": [
				"1 tablespoon vegetable oil ",
				" 2 tablespoons grated fresh ginger ",
				" 1 stalk lemon grass, minced ",
				" 2 teaspoons red curry paste ",
				" 4 cups chicken broth ",
				" 3 tablespoons fish sauce ",
				" 1 tablespoon light brown sugar ",
				" 3 (13.5 ounce) cans coconut milk ",
				" 1/2 pound fresh shiitake mushrooms, sliced ",
				" 1 pound medium shrimp - peeled and deveined ",
				" 2 tablespoons fresh lime juice ",
				" salt to taste ",
				" 1/4 cup chopped fresh cilantro "
			]
		},
		{
			"name": "Restaurant Style Egg Drop Soup",
			"reviews": "656",
			"directions": "Reserve 3/4 cup of chicken broth, and pour the rest into a large saucepan. Stir the salt, ginger and chives into the saucepan, and bring to a rolling boil. In a cup or small bowl, stir together the remaining broth and cornstarch until smooth. Set aside. In a small bowl, whisk the eggs and egg yolk together using a fork. Drizzle egg a little at a time from the fork into the boiling broth mixture. Egg should cook immediately. Once the eggs have been dropped, stir in the cornstarch mixture gradually until the soup is the desired consistency.",
			"rating": "4.53464221954346",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 22733,
			"prep_time": 10,
			"nutrition": [
				"Calories: 76 kcal 4 %",
				"Fat: 4.1 g 6 %",
				"Carbs: 4.2g 1 %",
				"Protein: 4.9 g 10 %",
				"Cholesterol: 149 mg 50 %",
				"Sodium: 1143 mg 46 %"
			],
			"comment": "This Egg Drop soup is born from a love of the soup and MANY trips to my favorite Chinese restaurant (asking them many questions) resulting in this variation...Compare it to your local restaurant...The simplicity is the key. Soup can be re-heated or frozen and re-heated.",
			"cal": 76,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/98053.jpg",
			"ingredients": [
				"4 cups chicken broth, divided ",
				" 1/8 teaspoon ground ginger ",
				" 2 tablespoons chopped fresh chives ",
				" 1/4 teaspoon salt ",
				" 1 1/2 tablespoons cornstarch ",
				" 2 eggs ",
				" 1 egg yolk "
			]
		},
		{
			"name": "Sweet and Sour Pork III",
			"reviews": "659",
			"directions": "Place cubed pork in a medium bowl, and season with 1 teaspoon salt, 1/4 teaspoon sugar, and 1 teaspoon soy sauce. Mix in the egg white and green onions. Cover, and place in the refrigerator at least 1 hour. Heat 1 quart oil to 365 degrees F (185 degrees C) in a large, heavy saucepan or deep fryer. Coat the pork with 1/2 cup cornstarch, and fry in the heated oil about 10 minutes, until evenly browned. Drain on paper towels. Heat 1 tablespoon oil in a wok over medium heat. Stir in the celery, green bell pepper, and onion, and cook until tender. Season with salt and sugar. Remove from heat, and set aside. In a large saucepan, mix 1 cup water, 1/4 teaspoon salt, 3/4 cup sugar, apple cider vinegar, ketchup, and 1/2 teaspoon soy sauce. Bring to a boil, and stir in the cooked pork, celery mixture, and the pineapple chunks with juice. Return to boil, and mix in 2 tablespoons cornstarch and 1/4 cup water to thicken. Cook until well blended.",
			"rating": "4.71731472015381",
			"cook_time": 30,
			"ready_in_time": 120,
			"id": 22734,
			"prep_time": 30,
			"nutrition": [
				"Calories: 663 kcal 33 %",
				"Fat: 35 g 54 %",
				"Carbs: 74.7g 24 %",
				"Protein: 13.9 g 28 %",
				"Cholesterol: 43 mg 14 %",
				"Sodium: 1182 mg 47 %"
			],
			"comment": "My husband's grandmother was Chinese. She taught me this one. This is the way Gramma made Sweet and Sour all her life (she died 6 years ago at age 94). The secret is apple cider vinegar.",
			"cal": 663,
			"total_time": 180,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/265130.jpg",
			"ingredients": [
				"1 pound pork butt, cut into 1 inch cubes ",
				" 1 teaspoon salt ",
				" 1/4 teaspoon white sugar ",
				" 1 teaspoon soy sauce ",
				" 1 egg white ",
				" 2 green onions, chopped ",
				" 1 quart vegetable oil for frying ",
				" 1/2 cup cornstarch ",
				" 1 tablespoon vegetable oil ",
				" 3 stalks celery, cut into 1/2 inch pieces ",
				" 1 medium green bell pepper, cut into 1 inch pieces ",
				" 1 medium onion, cut into wedges ",
				" white sugar to taste ",
				" salt to taste ",
				" 1 cup water ",
				" 1/4 teaspoon salt ",
				" 3/4 cup white sugar ",
				" 1/3 cup apple cider vinegar ",
				" 1/4 cup ketchup ",
				" 1/2 teaspoon soy sauce ",
				" 1 (8 ounce) can pineapple chunks, undrained ",
				" 2 tablespoons cornstarch ",
				" 1/4 cup water "
			]
		},
		{
			"name": "Restaurant Style Beef and Broccoli",
			"reviews": "573",
			"directions": "Whisk together the oyster sauce, sesame oil, sherry, soy sauce, sugar, and cornstarch in a bowl, and stir until the sugar has dissolved. Place the steak pieces into a shallow bowl, pour the oyster sauce mixture over the meat, stir to coat well, and marinate for at least 30 minutes in refrigerator. Heat vegetable oil in a wok or large skillet over medium-high heat, and stir in the ginger and garlic. Let them sizzle in the hot oil for about 1 minute to flavor the oil, then remove and discard. Stir in the broccoli, and toss and stir in the hot oil until bright green and almost tender, 5 to 7 minutes. Remove the broccoli from the wok, and set aside. Pour a little more oil into the wok, if needed, and stir and toss the beef with the marinade until the sauce forms a glaze on the beef, and the meat is no longer pink, about 5 minutes. Return the cooked broccoli to the wok, and stir until the meat and broccoli are heated through, about 3 minutes.",
			"rating": "4.43096780776978",
			"cook_time": 15,
			"ready_in_time": 60,
			"id": 22735,
			"prep_time": 15,
			"nutrition": [
				"Calories: 331 kcal 17 %",
				"Fat: 21.1 g 32 %",
				"Carbs: 13.3g 4 %",
				"Protein: 21.7 g 43 %",
				"Cholesterol: 52 mg 17 %",
				"Sodium: 419 mg 17 %"
			],
			"comment": "This is my go-to recipe when I want Chinese food without having to go out. Very easy and delicious. Substituting chicken for the beef works great too. Serve over rice.",
			"cal": 331,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/516732.jpg",
			"ingredients": [
				"1/3 cup oyster sauce ",
				" 2 teaspoons Asian (toasted) sesame oil ",
				" 1/3 cup sherry ",
				" 1 teaspoon soy sauce ",
				" 1 teaspoon white sugar ",
				" 1 teaspoon cornstarch ",
				" 3/4 pound beef round steak, cut into 1/8-inch thick strips ",
				" 3 tablespoons vegetable oil, plus more if needed ",
				" 1 thin slice of fresh ginger root ",
				" 1 clove garlic, peeled and smashed ",
				" 1 pound broccoli, cut into florets "
			]
		},
		{
			"name": "Crispy Orange Beef",
			"reviews": "659",
			"directions": "Lay beef strips out in a single layer on a baking sheet lined with paper towels. Allow to dry in the refrigerator for 30 minutes. In a small bowl, mix together the sugar, rice vinegar, orange juice concentrate, salt and soy sauce. Set aside. Meanwhile, combine rice and water in a medium saucepan. Bring to a boil, then reduce heat to medium-low and simmer for 20 minutes, or until rice is tender. Add more water at the end if necessary. Heat oil in a wok over medium-high heat. Toss dried beef in cornstarch to coat. Fry in the hot oil in small batches until crispy and golden brown; set aside. Drain all of the oil from the wok except about 1 tablespoon. Add orange zest, ginger and garlic to the remaining oil, and cook briefly until fragrant. Add the soy sauce mixture to the wok, bring to a boil, and cook until thick and syrupy, about 5 minutes. Add beef, and heat through, stirring to coat. Serve immediately over steamed rice, and garnish with broccoli.",
			"rating": "4.47280788421631",
			"cook_time": 15,
			"ready_in_time": 65,
			"id": 22736,
			"prep_time": 20,
			"nutrition": [
				"Calories: 507 kcal 25 %",
				"Fat: 18.7 g 29 %",
				"Carbs: 59.2g 19 %",
				"Protein: 27.4 g 55 %",
				"Cholesterol: 61 mg 20 %",
				"Sodium: 649 mg 26 %"
			],
			"comment": "A delicious crispy and sweet, yet mildly spiced beef stir-fry recipe served with steamed rice and broccoli.",
			"cal": 507,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1132315.jpg",
			"ingredients": [
				"1 1/2 pounds beef top sirloin, thinly sliced ",
				" 1/3 cup white sugar ",
				" 1/3 cup rice wine vinegar ",
				" 2 tablespoons frozen orange juice concentrate ",
				" 1 teaspoon salt ",
				" 1 tablespoon soy sauce ",
				" 1 cup long grain rice ",
				" 2 cups water ",
				" 1/4 cup cornstarch ",
				" 2 teaspoons orange zest ",
				" 3 tablespoons grated fresh ginger ",
				" 1 1/2 tablespoons minced garlic ",
				" 8 broccoli florets, lightly steamed or blanched ",
				" 2 cups oil for frying "
			]
		},
		{
			"name": "Baked Soy Lemon Chops",
			"reviews": "501",
			"directions": "In a shallow dish, combine soy sauce, Worcestershire sauce, garlic, lemon juice, pepper and oil. Add pork chops, and turn to coat evenly. Cover, and refrigerate for at least 1 hour. Preheat oven to 375 degrees F (190 degrees C). Place marinated pork chops in a roasting pan, and bake in preheated oven for 35 to 40 minutes, basting meat often with marinade.",
			"rating": "4.27930545806885",
			"cook_time": 40,
			"ready_in_time": 110,
			"id": 22737,
			"prep_time": 15,
			"nutrition": [
				"Calories: 193 kcal 10 %",
				"Fat: 6.7 g 10 %",
				"Carbs: 5.1g 2 %",
				"Protein: 27.1 g 54 %",
				"Cholesterol: 65 mg 22 %",
				"Sodium: 1887 mg 75 %"
			],
			"comment": "These pork chops are light but very tasty! The longer you marinate your pork, the better it tastes. And it's baked, so a lot of the pork fat is baked right off! Serve with a fresh garden salad and mashed potatoes for a terrific meal.",
			"cal": 193,
			"total_time": 165,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/211825.jpg",
			"ingredients": [
				"1/2 cup soy sauce ",
				" 1 tablespoon Worcestershire sauce ",
				" 4 cloves garlic, minced ",
				" 2 tablespoons lemon juice ",
				" 1/2 teaspoon ground black pepper ",
				" 1 teaspoon vegetable oil ",
				" 4 pork chops "
			]
		},
		{
			"name": "Indian Chicken Curry (Murgh Kari)",
			"reviews": "540",
			"directions": "Sprinkle the chicken breasts with 2 teaspoons salt. Heat the oil in a large skillet over high heat; partially cook the chicken in the hot oil in batches until completely browned. Transfer the browned chicken breasts to a plate and set aside. Reduce the heat under the skillet to medium-high; add the onion, garlic, and ginger to the oil remaining in the skillet and cook and stir until the onion turns translucent, about 8 minutes. Stir the curry powder, cumin, turmeric, coriander, cayenne, and 1 tablespoon of water into the onion mixture; allow to heat together for about 1 minute while stirring. Mix the tomatoes, yogurt, 1 tablespoon chopped cilantro, and 1 teaspoon salt into the mixture. Return the chicken breast to the skillet along with any juices on the plate. Pour 1/2 cup water into the mixture; bring to a boil, turning the chicken to coat with the sauce. Sprinkle the garam masala and 1 tablespoon cilantro over the chicken. Cover the skillet and simmer until the chicken breasts are no longer pink in the center and the juices run clear, about 20 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C). Sprinkle with lemon juice to serve.",
			"rating": "4.72157430648804",
			"cook_time": 40,
			"ready_in_time": 60,
			"id": 22738,
			"prep_time": 20,
			"nutrition": [
				"Calories: 427 kcal 21 %",
				"Fat: 24.3 g 37 %",
				"Carbs: 14.7g 5 %",
				"Protein: 38.1 g 76 %",
				"Cholesterol: 95 mg 32 %",
				"Sodium: 1370 mg 55 %"
			],
			"comment": "This is a really good recipe for spicy Indian chicken curry. It's pretty easy to make and tastes really good!",
			"cal": 427,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3325822.jpg",
			"ingredients": [
				"2 pounds skinless, boneless chicken breast halves ",
				" 2 teaspoons salt ",
				" 1/2 cup cooking oil ",
				" 1 1/2 cups chopped onion ",
				" 1 tablespoon minced garlic ",
				" 1 1/2 teaspoons minced fresh ginger root ",
				" 1 tablespoon curry powder ",
				" 1 teaspoon ground cumin ",
				" 1 teaspoon ground turmeric ",
				" 1 teaspoon ground coriander ",
				" 1 teaspoon cayenne pepper ",
				" 1 tablespoon water ",
				" 1 (15 ounce) can crushed tomatoes ",
				" 1 cup plain yogurt ",
				" 1 tablespoon chopped fresh cilantro ",
				" 1 teaspoon salt ",
				" 1/2 cup water ",
				" 1 teaspoon garam masala ",
				" 1 tablespoon chopped fresh cilantro ",
				" 1 tablespoon fresh lemon juice "
			]
		},
		{
			"name": "Sesame Beef",
			"reviews": "654",
			"directions": "Mix soy sauce, sugar, oil, garlic, and onions in a large bowl. Set aside. Cut steak into strips and add to bowl. Cover and refrigerate overnight, or at least 30 minutes. Cook in wok or frying pan until brown, about 5 minutes. Add sesame seeds and cook for additional 2 minutes.",
			"rating": "4.52359533309937",
			"cook_time": 10,
			"ready_in_time": 45,
			"id": 22739,
			"prep_time": 5,
			"nutrition": [
				"Calories: 354 kcal 18 %",
				"Fat: 22.5 g 35 %",
				"Carbs: 15.8g 5 %",
				"Protein: 22.2 g 44 %",
				"Cholesterol: 57 mg 19 %",
				"Sodium: 944 mg 38 %"
			],
			"comment": "Strips of round steak and chopped scallions are marinated with soy sauce and garlic, then quickly stir fried with sesame seeds. Add a little sesame oil to the marinade if you like that flavor. Serve with rice.",
			"cal": 354,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/858484.jpg",
			"ingredients": [
				"1 pound round steak ",
				" 4 tablespoons soy sauce ",
				" 4 tablespoons white sugar ",
				" 4 tablespoons vegetable oil ",
				" 2 cloves garlic, minced ",
				" 2 green onions, chopped ",
				" 2 tablespoons sesame seeds "
			]
		},
		{
			"name": "Amber's Sesame Chicken",
			"reviews": "498",
			"directions": "In a large resealable plastic bag, combine flour, 1/4 cup sesame seeds, black pepper, five-spice powder, and red pepper flakes. Place a few pieces of chicken at a time into the bag, and shake to coat. Remove to a platter. Heat oil in a large skillet or wok over medium-high heat. Place chicken into skillet, and brown on both sides, about 5 minutes. Remove chicken, and set aside. Stir onion wedges and bell pepper slices into skillet; cook until slightly browned, about 2 minutes. Remove, and set aside. Return chicken to skillet, and reduce heat to low. Mix in teriyaki marinade, 1/4 cup sesame seeds, and honey; stir until sauce thickens. Return onion and bell pepper to the skillet. Warm through, and serve.",
			"rating": "4.37733125686646",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 22740,
			"prep_time": 15,
			"nutrition": [
				"Calories: 438 kcal 22 %",
				"Fat: 19.5 g 30 %",
				"Carbs: 27.7g 9 %",
				"Protein: 37.8 g 76 %",
				"Cholesterol: 82 mg 27 %",
				"Sodium: 325 mg 13 %"
			],
			"comment": "I've been looking for a good sesame chicken recipe. I adapted a few, and this tastes something like what I think it should. I used Fish and Things Teriyaki Marinade (on this site). It tastes a lot like Mr. Yoshida's teriyaki. If you prefer, you can substitute pancake syrup for honey, and fresh ginger for five-spice powder.",
			"cal": 438,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/716145.jpg",
			"ingredients": [
				"1 cup all-purpose flour ",
				" 1/2 cup toasted sesame seeds, divided ",
				" 1 teaspoon black pepper ",
				" 1 teaspoon Chinese five-spice powder ",
				" 1 teaspoon crushed red pepper flakes (optional) ",
				" 5 (6 ounce) skinless, boneless chicken breast halves - cut into chunks ",
				" 5 tablespoons vegetable oil ",
				" 1/2 yellow onion, cut into wedges ",
				" 1/2 cup green bell pepper, seeded and thinly sliced ",
				" 2 tablespoons teriyaki sauce ",
				" 2 tablespoons honey "
			]
		},
		{
			"name": "Beef Bulgogi",
			"reviews": "464",
			"directions": "Place the beef in a shallow dish. Combine soy sauce, sugar, green onion, garlic, sesame seeds, sesame oil, and ground black pepper in a small bowl. Pour over beef. Cover and refrigerate for at least 1 hour or overnight. Preheat an outdoor grill for high heat, and lightly oil the grate. Quickly grill beef on hot grill until slightly charred and cooked through, 1 to 2 minutes per side.",
			"rating": "4.78714847564697",
			"cook_time": 5,
			"ready_in_time": 75,
			"id": 22741,
			"prep_time": 10,
			"nutrition": [
				"Calories: 232 kcal 12 %",
				"Fat: 13.2 g 20 %",
				"Carbs: 12.4g 4 %",
				"Protein: 16.2 g 32 %",
				"Cholesterol: 27 mg 9 %",
				"Sodium: 1157 mg 46 %"
			],
			"comment": "Just like my Korean mom makes it! It's delicious! Even better if rolled up in red leaf lettuce with rice and hot pepper paste. If you want to spice it up just add red pepper powder to your marinade.",
			"cal": 232,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1254483.jpg",
			"ingredients": [
				"1 pound flank steak, thinly sliced ",
				" 5 tablespoons soy sauce ",
				" 2 1/2 tablespoons white sugar ",
				" 1/4 cup chopped green onion ",
				" 2 tablespoons minced garlic ",
				" 2 tablespoons sesame seeds ",
				" 2 tablespoons sesame oil ",
				" 1/2 teaspoon ground black pepper "
			]
		},
		{
			"name": "Broccoli Beef I",
			"reviews": "729",
			"directions": "In a small bowl, combine flour, broth, sugar, and soy sauce. Stir until sugar and flour are dissolved. In a large skillet or wok over high heat, cook and stir beef 2 to 4 minutes, or until browned. Stir in broth mixture, ginger, garlic, and broccoli. Bring to a boil, then reduce heat. Simmer 5 to 10 minutes, or until sauce thickens.",
			"rating": "4.15392446517944",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 22742,
			"prep_time": 15,
			"nutrition": [
				"Calories: 178 kcal 9 %",
				"Fat: 3.2 g 5 %",
				"Carbs: 19g 6 %",
				"Protein: 19.2 g 38 %",
				"Cholesterol: 39 mg 13 %",
				"Sodium: 755 mg 30 %"
			],
			"comment": "Round steak and broccoli are quickly cooked in a soy-ginger sauce. Serve over hot rice or noodles.",
			"cal": 178,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/705947.jpg",
			"ingredients": [
				"1/4 cup all-purpose flour ",
				" 1 (10.5 ounce) can beef broth ",
				" 2 tablespoons white sugar ",
				" 2 tablespoons soy sauce ",
				" 1 pound boneless round steak, cut into bite size pieces ",
				" 1/4 teaspoon chopped fresh ginger root ",
				" 1 clove garlic, minced ",
				" 4 cups chopped fresh broccoli "
			]
		},
		{
			"name": "Coconut Curry Tofu",
			"reviews": "489",
			"directions": "Remove white parts of green onions, and finely chop. Chop greens into 2 inch pieces. In a large heavy skillet over medium heat, mix coconut milk, 3 tablespoons soy sauce, brown sugar, curry powder, ginger, and chile paste. Bring to a boil. Stir tofu, tomatoes, yellow pepper, mushrooms, and finely chopped green onions into the skillet. Cover, and cook 5 minutes, stirring occasionally. Mix in basil and bok choy. Season with salt and remaining soy sauce. Continue cooking 5 minutes, or until vegetables are tender but crisp. Garnish with remaining green onion.",
			"rating": "4.36233949661255",
			"cook_time": 15,
			"ready_in_time": 40,
			"id": 22743,
			"prep_time": 25,
			"nutrition": [
				"Calories: 232 kcal 12 %",
				"Fat: 13.2 g 20 %",
				"Carbs: 16.9g 5 %",
				"Protein: 16.5 g 33 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 680 mg 27 %"
			],
			"comment": "My vegetarian daughter-in-law gave me this recipe for a creamy coconut milk, spicy curry, and ginger tofu dish! I serve it over rice.",
			"cal": 232,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/46392.jpg",
			"ingredients": [
				"2 bunches green onions ",
				" 1 (14 ounce) can light coconut milk ",
				" 1/4 cup soy sauce, divided ",
				" 1/2 teaspoon brown sugar ",
				" 1 1/2 teaspoons curry powder ",
				" 1 teaspoon minced fresh ginger ",
				" 2 teaspoons chile paste ",
				" 1 pound firm tofu, cut into 3/4 inch cubes ",
				" 4 roma (plum) tomatoes, chopped ",
				" 1 yellow bell pepper, thinly sliced ",
				" 4 ounces fresh mushrooms, chopped ",
				" 1/4 cup chopped fresh basil ",
				" 4 cups chopped bok choy ",
				" salt to taste "
			]
		},
		{
			"name": "Easy Indian Butter Chicken",
			"reviews": "654",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Melt a few tablespoons of butter in a skillet over medium heat. Stir in onion and garlic, and cook slowly until the onion caramelizes to a dark brown, about 15 minutes. Meanwhile melt the remaining butter in a saucepan over medium-high heat along with the tomato sauce, heavy cream, salt, cayenne pepper, and garam masala. Bring to a simmer, then reduce heat to medium-low; cover, and simmer for 30 minutes, stirring occasionally. Then stir in caramelized onions. While the sauce is simmering, toss cubed chicken breast with vegetable oil until coated, then season with tandoori masala and spread out onto a baking sheet. Bake chicken in preheated oven until no longer pink in the center, about 12 minutes. Once done, add the chicken to the sauce and simmer for 5 minutes before serving.",
			"rating": "4.70514297485352",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 22744,
			"prep_time": 15,
			"nutrition": [
				"Calories: 880 kcal 44 %",
				"Fat: 82.3 g 127 %",
				"Carbs: 12.8g 4 %",
				"Protein: 26.4 g 53 %",
				"Cholesterol: 303 mg 101 %",
				"Sodium: 1461 mg 58 %"
			],
			"comment": "This is a recipe I have perfected over the years and passed onto many others. The sauce is perfect when creamy and not too thick or too thin. The level of salt and spices can be suited to your taste. Garam and tandoori masala can be found in the ethnic aisle of your grocery store.",
			"cal": 880,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2180712.jpg",
			"ingredients": [
				"1 cup butter, divided ",
				" 1 onion, minced ",
				" 1 tablespoon minced garlic ",
				" 1 (15 ounce) can tomato sauce ",
				" 3 cups heavy cream ",
				" 2 teaspoons salt ",
				" 1 teaspoon cayenne pepper ",
				" 1 teaspoon garam masala ",
				" 1 1/2 pounds skinless, boneless chicken breast, cut into bite-sized chunks ",
				" 2 tablespoons vegetable oil ",
				" 2 tablespoons tandoori masala "
			]
		},
		{
			"name": "Sweet and Sour Sauce I",
			"reviews": "595",
			"directions": "Place the sugar, vinegar, water, soy sauce, ketchup and cornstarch in a medium saucepan, and bring to a boil. Stir continuously until the mixture has thickened.",
			"rating": "4.46122455596924",
			"cook_time": 10,
			"ready_in_time": 12,
			"id": 22746,
			"prep_time": 2,
			"nutrition": [
				"Calories: 43 kcal 2 %",
				"Fat: 0 g < 1 %",
				"Carbs: 10.8g 3 %",
				"Protein: 0.3 g < 1 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 236 mg 9 %"
			],
			"comment": "An excellent, traditional sweet and sour sauce. It is great served with meatballs, with tempura, or even over rice!",
			"cal": 43,
			"total_time": 24,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/12803.jpg",
			"ingredients": [
				"3/4 cup white sugar ",
				" 1/3 cup white vinegar ",
				" 2/3 cup water ",
				" 1/4 cup soy sauce ",
				" 1 tablespoon ketchup ",
				" 2 tablespoons cornstarch "
			]
		},
		{
			"name": "Perfect Sesame Chicken",
			"reviews": "580",
			"directions": "Sift flour, 2 tablespoons cornstarch, baking soda, and baking powder into a bowl. Pour in low-sodium soy sauce, sherry, 2 tablespoons water, vegetable oil, and a dash of sesame oil; stir until smooth. Stir in chicken until coated with the batter, then cover, and refrigerate for 20 minutes. Meanwhile, bring chicken broth, sugar, vinegar, dark soy sauce, sesame oil, chile paste, and garlic to a boil in a saucepan over high heat. Dissolve 1/4 cup cornstarch into 1/2 cup of water, and stir into boiling sauce. Simmer until the sauce thickens and turns clear, about 2 minutes. Reduce heat to low, and keep sauce warm. Heat olive oil in a deep fryer or large saucepan to a temperature of 375 degrees F (190 degrees C). Drop in the battered chicken pieces, a few at a time, and fry until they turn golden brown and float to the top of the oil, 3 to 4 minutes. Drain on a paper towel lined plate. To serve, place fried chicken pieces onto a serving platter, and pour the hot sauce overtop. Sprinkle with toasted sesame seeds to garnish.",
			"rating": "4.65679693222046",
			"cook_time": 20,
			"ready_in_time": 75,
			"id": 22747,
			"prep_time": 35,
			"nutrition": [
				"Calories: 509 kcal 25 %",
				"Fat: 28.5 g 44 %",
				"Carbs: 50g 16 %",
				"Protein: 14.2 g 28 %",
				"Cholesterol: 44 mg 15 %",
				"Sodium: 874 mg 35 %"
			],
			"comment": "If you want the perfect sesame chicken recipe this is it! You may want to increase the vinegar or lower the amount of sugar. It all depends on how sweet you want the sauce.",
			"cal": 509,
			"total_time": 130,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/193796.jpg",
			"ingredients": [
				"2 tablespoons all-purpose flour ",
				" 2 tablespoons cornstarch ",
				" 1/4 teaspoon baking soda ",
				" 1/4 teaspoon baking powder ",
				" 2 tablespoons low-sodium soy sauce ",
				" 1 tablespoon dry sherry ",
				" 2 tablespoons water ",
				" 1 teaspoon vegetable oil ",
				" 1 dash sesame oil ",
				" 1 pound skinless, boneless chicken breast meat - cubed ",
				" 1 cup chicken broth ",
				" 1 cup white sugar ",
				" 2 tablespoons distilled white vinegar ",
				" 2 tablespoons dark soy sauce ",
				" 2 tablespoons sesame oil ",
				" 1 teaspoon chile paste ",
				" 1 clove garlic, minced ",
				" 1/4 cup cornstarch ",
				" 1/2 cup water ",
				" 1 quart olive oil for frying ",
				" 2 tablespoons toasted sesame seeds "
			]
		},
		{
			"name": "General Tsao's Chicken II",
			"reviews": "549",
			"directions": "Heat 4 cups vegetable oil in a deep-fryer or large saucepan to 375 degrees F (190 degrees C). Beat the egg in a mixing bowl. Add the chicken cubes; sprinkle with salt, 1 teaspoon sugar, and white pepper; mix well. Mix in 1 cup of cornstarch a little bit at a time until the chicken cubes are well coated. In batches, carefully drop the chicken cubes into the hot oil one by one, cooking until they turns golden brown and begin to float, about 3 minutes. Remove the chicken and allow to cool as you fry the next batch. Once all of the chicken has been fried, refry the chicken, starting with the batch that was cooked first. Cook until the chicken turns deep golden brown, about 2 minutes more. Drain on a paper towel-lined plate. Heat 2 tablespoons vegetable oil in a wok or large skillet over high heat. Stir in the green onion, garlic, whole chiles, and orange zest. Cook and stir a minute or two until the garlic has turned golden and the chiles brighten. Add 1/2 cup sugar, the ginger, chicken broth, vinegar, soy sauce, sesame oil, and peanut oil; bring to a boil and cook for 3 minutes. Dissolve 2 teaspoons of cornstarch into the water, and stir into the boiling sauce. Return to a boil and cook until the sauce thickens and is no longer cloudy from the cornstarch, about 1 minute. Stir the chicken into the boiling sauce. Reduce heat to low and cook for a few minutes until the chicken absorbs some of the sauce.",
			"rating": "4.76589965820313",
			"cook_time": 25,
			"ready_in_time": 50,
			"id": 22748,
			"prep_time": 25,
			"nutrition": [
				"Calories: 634 kcal 32 %",
				"Fat: 36.5 g 56 %",
				"Carbs: 54.9g 18 %",
				"Protein: 24.3 g 49 %",
				"Cholesterol: 101 mg 34 %",
				"Sodium: 1192 mg 48 %"
			],
			"comment": "A genuinely mouthwatering dish with an Asian kick that will knock your chopsticks off! Don't be fooled by other General Tsao impostors: this is simply the best Chinese chicken you will ever have. With a flair of peanut oil, a streak of sesame, a dash of orange, and a sweet spot for hot, this is sure to be a favorite. Just don't forget to deep-fry twice! Serve with steamed broccoli and white rice.",
			"cal": 634,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/632575.jpg",
			"ingredients": [
				"4 cups vegetable oil for frying ",
				" 1 egg ",
				" 1 1/2 pounds boneless, skinless chicken thighs, cut into 1/2 inch cubes ",
				" 1 teaspoon salt ",
				" 1 teaspoon white sugar ",
				" 1 pinch white pepper ",
				" 1 cup cornstarch ",
				" 2 tablespoons vegetable oil ",
				" 3 tablespoons chopped green onion ",
				" 1 clove garlic, minced ",
				" 6 dried whole red chilies ",
				" 1 strip orange zest ",
				" 1/2 cup white sugar ",
				" 1/4 teaspoon ground ginger ",
				" 3 tablespoons chicken broth ",
				" 1 tablespoon rice vinegar ",
				" 1/4 cup soy sauce ",
				" 2 teaspoons sesame oil ",
				" 2 tablespoons peanut oil ",
				" 2 teaspoons cornstarch ",
				" 1/4 cup water "
			]
		},
		{
			"name": "Vietnamese Fresh Spring Rolls",
			"reviews": "421",
			"directions": "Bring a medium saucepan of water to boil. Boil rice vermicelli 3 to 5 minutes, or until al dente, and drain. Fill a large bowl with warm water. Dip one wrapper into the hot water for 1 second to soften. Lay wrapper flat. In a row across the center, place 2 shrimp halves, a handful of vermicelli, basil, mint, cilantro and lettuce, leaving about 2 inches uncovered on each side. Fold uncovered sides inward, then tightly roll the wrapper, beginning at the end with the lettuce. Repeat with remaining ingredients. In a small bowl, mix the fish sauce, water, lime juice, garlic, sugar and chili sauce. In another small bowl, mix the hoisin sauce and peanuts. Serve rolled spring rolls with the fish sauce and hoisin sauce mixtures.",
			"rating": "4.63636350631714",
			"cook_time": 5,
			"ready_in_time": 50,
			"id": 22749,
			"prep_time": 45,
			"nutrition": [
				"Calories: 82 kcal 4 %",
				"Fat: 0.7 g 1 %",
				"Carbs: 15.8g 5 %",
				"Protein: 3.3 g 7 %",
				"Cholesterol: 11 mg 4 %",
				"Sodium: 305 mg 12 %"
			],
			"comment": "These spring rolls are a refreshing change from the usual fried variety, and have become a family favorite. They are great as a cool summertime appetizer, and are delicious dipped in one or both of the sauces.",
			"cal": 82,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/124820.jpg",
			"ingredients": [
				"2 ounces rice vermicelli ",
				" 8 rice wrappers (8.5 inch diameter) ",
				" 8 large cooked shrimp - peeled, deveined and cut in half ",
				" 1 1/3 tablespoons chopped fresh Thai basil ",
				" 3 tablespoons chopped fresh mint leaves ",
				" 3 tablespoons chopped fresh cilantro ",
				" 2 leaves lettuce, chopped ",
				" 4 teaspoons fish sauce ",
				" 1/4 cup water ",
				" 2 tablespoons fresh lime juice ",
				" 1 clove garlic, minced ",
				" 2 tablespoons white sugar ",
				" 1/2 teaspoon garlic chili sauce ",
				" 3 tablespoons hoisin sauce ",
				" 1 teaspoon finely chopped peanuts "
			]
		},
		{
			"name": "Ginger Veggie Stir-Fry",
			"reviews": "353",
			"directions": "In a large bowl, blend cornstarch, garlic, 1 teaspoon ginger, and 2 tablespoons vegetable oil until cornstarch is dissolved. Mix in broccoli, snow peas, carrots, and green beans, tossing to lightly coat. Heat remaining 2 tablespoons oil in a large skillet or wok over medium heat. Cook vegetables in oil for 2 minutes, stirring constantly to prevent burning. Stir in soy sauce and water. Mix in onion, salt, and remaining 1 teaspoon ginger. Cook until vegetables are tender but still crisp.",
			"rating": "4.38800001144409",
			"cook_time": 15,
			"ready_in_time": 40,
			"id": 22750,
			"prep_time": 25,
			"nutrition": [
				"Calories: 119 kcal 6 %",
				"Fat: 9.3 g 14 %",
				"Carbs: 8g 3 %",
				"Protein: 2.2 g 4 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 903 mg 36 %"
			],
			"comment": "I just whipped this up one day when I felt like a stir-fry but did not have all the ingredients called for in some of the stir-fry recipes on this site. I used certain veggies I had on hand, but any seasonal veggies may be used. It has a mild ginger flavor that can be enhanced according to taste, and is filling yet light on the tummy! Tofu may be added. Serve over a bed of steamed jasmine rice.",
			"cal": 119,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/46265.jpg",
			"ingredients": [
				"1 tablespoon cornstarch ",
				" 1 1/2 cloves garlic, crushed ",
				" 2 teaspoons chopped fresh ginger root, divided ",
				" 1/4 cup vegetable oil, divided ",
				" 1 small head broccoli, cut into florets ",
				" 1/2 cup snow peas ",
				" 3/4 cup julienned carrots ",
				" 1/2 cup halved green beans ",
				" 2 tablespoons soy sauce ",
				" 2 1/2 tablespoons water ",
				" 1/4 cup chopped onion ",
				" 1/2 tablespoon salt "
			]
		},
		{
			"name": "Asian Glazed Chicken Thighs",
			"reviews": "365",
			"directions": "Whisk the vinegar, honey, soy sauce, toasted sesame oil, chili garlic sauce, garlic, and salt in a bowl until smooth. Pour half the marinade into a large plastic zipper bag; retain the other half of the sauce. Place the chicken thighs into the bag containing marinade, squeeze all the air out of the bag, and seal. Shake a few times to coat chicken; refrigerate for 1 hour, turning bag once or twice. Preheat oven to 425 degrees F (220 degrees C). Pour the other half of the marinade into a saucepan over medium heat, bring to a boil, and cook for 3 to 5 minutes, stirring often, to thicken sauce. Remove the chicken from the bag; discard used marinade. Place chicken thighs into a 9x13-inch baking dish, and brush with 1/3 of the thickened marinade from the saucepan. Bake 30 minutes, basting one more time after 10 minutes; an instant-read thermometer inserted into a chicken thigh should read 165 degrees F (75 degrees C). Let stand for 5 or 10 minutes; meanwhile, bring remaining marinade back to a boil for 1 or 2 minutes, and serve chicken with marinade. Sprinkle with green onions.",
			"rating": "4.58083820343018",
			"cook_time": 30,
			"ready_in_time": 100,
			"id": 22751,
			"prep_time": 5,
			"nutrition": [
				"Calories: 544 kcal 27 %",
				"Fat: 30.2 g 46 %",
				"Carbs: 26.6g 9 %",
				"Protein: 40.6 g 81 %",
				"Cholesterol: 142 mg 47 %",
				"Sodium: 1852 mg 74 %"
			],
			"comment": "Slightly spicy, but the sweetness tames the heat. Serve with rice.",
			"cal": 544,
			"total_time": 135,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/815964.jpg",
			"ingredients": [
				"1/2 cup rice vinegar ",
				" 5 tablespoons honey ",
				" 1/3 cup soy sauce (such as Silver Swan®) ",
				" 1/4 cup Asian (toasted) sesame oil ",
				" 3 tablespoons Asian chili garlic sauce ",
				" 3 tablespoons minced garlic ",
				" salt to taste ",
				" 8 skinless, boneless chicken thighs ",
				" 1 tablespoon chopped green onion (optional) "
			]
		},
		{
			"name": "Carrot Rice",
			"reviews": "469",
			"directions": "Combine rice and water in a medium saucepan. Bring to a boil over high heat. Reduce heat to low, cover with lid, and allow to steam until tender, about 20 minutes. While rice is cooking, grind peanuts in a blender and set aside. Heat the margarine in a skillet over medium heat. Stir in the onion; cook and stir until the onion has softened and turned golden brown about 10 minutes. Stir in ginger, carrots, and salt to taste. Reduce heat to low and cover to steam 5 minutes. Stir in cayenne pepper and peanuts. When rice is done, add it to skillet and stir gently to combine with other ingredients. Garnish with chopped cilantro.",
			"rating": "4.39317512512207",
			"cook_time": 20,
			"ready_in_time": 35,
			"id": 22752,
			"prep_time": 15,
			"nutrition": [
				"Calories: 179 kcal 9 %",
				"Fat: 4.8 g 7 %",
				"Carbs: 30.1g 10 %",
				"Protein: 4 g 8 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 34 mg 1 %"
			],
			"comment": "Fragrant basmati rice sauteed with carrots, onions, fresh ginger, peanuts, and cilantro. You will be surprised to taste this delicious rice.",
			"cal": 179,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1013061.jpg",
			"ingredients": [
				"1 cup basmati rice ",
				" 2 cups water ",
				" 1/4 cup roasted peanuts ",
				" 1 tablespoon margarine ",
				" 1 onion, sliced ",
				" 1 teaspoon minced fresh ginger root ",
				" 3/4 cup grated carrots ",
				" salt to taste ",
				" cayenne pepper to taste ",
				" chopped fresh cilantro "
			]
		},
		{
			"name": "Grilled Asian Chicken",
			"reviews": "383",
			"directions": "In a small microwave-safe bowl, combine the soy sauce, oil, honey, ginger root, and garlic. Heat in microwave on medium for 1 minute, then stir. Heat again for 30 seconds, watching closely to prevent boiling. Place chicken breasts in a shallow dish. Pour soy sauce mixture over, and set aside to marinate for 15 minutes. Preheat a grill for medium-high heat. Drain marinade from chicken into a small saucepan. Bring to a boil, and simmer over medium heat for 5 minutes. Set aside for basting. Lightly oil the grill grate. Cook chicken on the prepared grill 6 to 8 minutes per side, or until juices run clear. Baste frequently with remaining marinade. Chicken will turn a beautiful golden brown.",
			"rating": "4.47749519348145",
			"cook_time": 15,
			"ready_in_time": 50,
			"id": 22753,
			"prep_time": 15,
			"nutrition": [
				"Calories: 217 kcal 11 %",
				"Fat: 7.6 g 12 %",
				"Carbs: 10.6g 3 %",
				"Protein: 25.7 g 51 %",
				"Cholesterol: 67 mg 22 %",
				"Sodium: 961 mg 38 %"
			],
			"comment": "Great for last-minute company or a quick dinner by rounding it out with a baked potato and tossed salad.",
			"cal": 217,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/931745.jpg",
			"ingredients": [
				"1/4 cup soy sauce ",
				" 4 teaspoons sesame oil ",
				" 2 tablespoons honey ",
				" 3 slices fresh ginger root ",
				" 2 cloves garlic, crushed ",
				" 4 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Pad Thai",
			"reviews": "421",
			"directions": "Soak rice noodles in cold water 30 to 50 minutes, or until soft. Drain, and set aside. Heat butter in a wok or large heavy skillet. Saute chicken until browned. Remove, and set aside. Heat oil in wok over medium-high heat. Crack eggs into hot oil, and cook until firm. Stir in chicken, and cook for 5 minutes. Add softened noodles, and vinegar, fish sauce, sugar and red pepper. Adjust seasonings to taste. Mix while cooking, until noodles are tender. Add bean sprouts, and mix for 3 minutes.",
			"rating": "3.89081454277039",
			"cook_time": 20,
			"ready_in_time": 60,
			"id": 22754,
			"prep_time": 40,
			"nutrition": [
				"Calories: 524 kcal 26 %",
				"Fat: 20.7 g 32 %",
				"Carbs: 58.5g 19 %",
				"Protein: 26.4 g 53 %",
				"Cholesterol: 178 mg 59 %",
				"Sodium: 594 mg 24 %"
			],
			"comment": "This is a traditional Pad Thai recipe used by a friend's mother. You can use chicken, pork, beef, tofu, or a combination. You may want to start with less pepper, and work your way up.",
			"cal": 524,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/442101.jpg",
			"ingredients": [
				"1 (12 ounce) package rice noodles ",
				" 2 tablespoons butter ",
				" 1 pound boneless, skinless chicken breast halves, cut into bite-sized pieces ",
				" 1/4 cup vegetable oil ",
				" 4 eggs ",
				" 1 tablespoon white wine vinegar ",
				" 2 tablespoons fish sauce ",
				" 3 tablespoons white sugar ",
				" 1/8 tablespoon crushed red pepper ",
				" 2 cups bean sprouts ",
				" 1/4 cup crushed peanuts ",
				" 3 green onions, chopped ",
				" 1 lemon, cut into wedges "
			]
		},
		{
			"name": "Sweet and Sour Chicken III",
			"reviews": "366",
			"directions": "Brown chicken in oil in a large skillet over medium high heat. Add green bell pepper, red bell pepper, carrot and garlic and stir fry for 1 to 2 minutes. In a small bowl, combine cornstarch and soy sauce and mix together; pour mixture into the skillet, along with the pineapple and liquid, vinegar, sugar and ginger. Stir together and bring to a full boil.",
			"rating": "4.34790897369385",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 22755,
			"prep_time": 10,
			"nutrition": [
				"Calories: 259 kcal 13 %",
				"Fat: 9.4 g 14 %",
				"Carbs: 19.9g 6 %",
				"Protein: 23.7 g 47 %",
				"Cholesterol: 59 mg 20 %",
				"Sodium: 603 mg 24 %"
			],
			"comment": "This version of the Asian-style favorite includes carrots, bell pepper, garlic and pineapple. The requisite soy sauce and vinegar add the sour to the sweet, and voila! Serve over hot cooked rice, if desired.",
			"cal": 259,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/27399.jpg",
			"ingredients": [
				"1 pound skinless, boneless chicken breast meat - cubed ",
				" 2 tablespoons vegetable oil ",
				" 1/2 cup sliced green bell pepper ",
				" 1/2 cup sliced red bell pepper ",
				" 1 cup carrot strips ",
				" 1 clove garlic, minced ",
				" 1 tablespoon cornstarch ",
				" 1/4 cup low sodium soy sauce ",
				" 1 (8 ounce) can pineapple chunks, juice reserved ",
				" 1 tablespoon vinegar ",
				" 1 tablespoon brown sugar ",
				" 1/2 teaspoon ground ginger "
			]
		},
		{
			"name": "Thai Peanut Chicken",
			"reviews": "372",
			"directions": "Combine the rice and water in a saucepan over medium-high heat. Bring to a boil, then reduce heat to low, cover, and simmer for 20 minutes, or until rice is tender. In a small bowl, stir together the soy sauce, peanut butter, vinegar, and cayenne pepper. Set aside. Heat oil in a skillet or wok over high heat. Add chicken, garlic and ginger, and cook, stirring constantly, until chicken is golden on the outside, about 5 minutes. Reduce heat to medium, and add green onion, broccoli, peanuts, and the peanut butter mixture. Cook, stirring frequently, for 5 minutes, or until broccoli is tender, and chicken is cooked through. Serve over rice.",
			"rating": "4.24081611633301",
			"cook_time": 15,
			"ready_in_time": 40,
			"id": 22756,
			"prep_time": 25,
			"nutrition": [
				"Calories: 360 kcal 18 %",
				"Fat: 11.3 g 17 %",
				"Carbs: 43.4g 14 %",
				"Protein: 21 g 42 %",
				"Cholesterol: 34 mg 11 %",
				"Sodium: 410 mg 16 %"
			],
			"comment": "This is a very tasty Asian-inspired dish made with chicken and broccoli in a spicy peanut sauce. If you like it mild, use less cayenne, like it spicy, use more. If you're salt conscious, use low sodium soy sauce.",
			"cal": 360,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/3314.jpg",
			"ingredients": [
				"2 cups uncooked white rice ",
				" 4 cups water ",
				" 3 tablespoons soy sauce ",
				" 2 tablespoons creamy peanut butter ",
				" 2 teaspoons white wine vinegar ",
				" 1/4 teaspoon cayenne pepper ",
				" 3 tablespoons olive oil ",
				" 4 skinless, boneless chicken breast halves - cut into thin strips ",
				" 3 tablespoons chopped garlic ",
				" 1 1/2 tablespoons chopped fresh ginger root ",
				" 3/4 cup chopped green onions ",
				" 2 1/2 cups broccoli florets ",
				" 1/3 cup unsalted dry-roasted peanuts "
			]
		},
		{
			"name": "Asian Chicken Salad",
			"reviews": "463",
			"directions": "Prepare the dressing 30 minutes ahead of time by combining the brown sugar, soy sauce, sesame oil, salad oil, and rice vinegar in a salad dressing carafe. To prepare the Chinese rice noodles, heat a skillet with a few tablespoons of oil and break off a little bit of the noodles and add them to the skillet and fry them. They will puff up in the skillet, so only add a few at a time. As they begin to puff up, remove and drain them on paper towels. Be sure to cook long enough as the under cooked noodles will be like eating needles. Once cooked, add them to the salad mixture. In a large bowl combine the iceberg lettuce, cooked and shredded chicken, green onions and toasted sesame seeds. Let chill about 10 minutes, and just before serving add the cooked rice noodles. Serve in salad bowls and offer the dressing in a pourable container so your family can add as much dressing as they want. You can also pour the dressing over the top of the salad, toss, and serve immediately.",
			"rating": "4.63402080535889",
			"cook_time": 20,
			"ready_in_time": 35,
			"id": 22757,
			"prep_time": 15,
			"nutrition": [
				"Calories: 414 kcal 21 %",
				"Fat: 18 g 28 %",
				"Carbs: 39.2g 13 %",
				"Protein: 22.7 g 45 %",
				"Cholesterol: 55 mg 18 %",
				"Sodium: 225 mg 9 %"
			],
			"comment": "A perfect salad for leftover BBQ, boiled, broiled or baked chicken. A very crunchy salad with a tasty sweet Asian-style dressing. The kids love it too! The Chinese rice noodles are of the cellophane type and can be found in the Asian section of most grocery stores. They are often in rectangle form and in clear packaging.",
			"cal": 414,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/106496.jpg",
			"ingredients": [
				"2 tablespoons brown sugar ",
				" 2 teaspoons soy sauce ",
				" 1 tablespoon sesame oil (optional) ",
				" 1/4 cup vegetable oil ",
				" 3 tablespoons rice vinegar ",
				" 1 (8 ounce) package dried rice noodles ",
				" 1 head iceberg lettuce - rinsed, dried, and chopped ",
				" 4 boneless chicken breast halves, cooked and shredded ",
				" 3 green onions, chopped ",
				" 1 tablespoon sesame seeds, toasted "
			]
		},
		{
			"name": "General Tsao's Chicken",
			"reviews": "456",
			"directions": "To Make Sauce: In a large bowl combine 1/2 cup cornstarch and 1/4 cup water. Mix together. Add garlic, ginger, sugar, 1/4 cup soy sauce and white wine vinegar. Then add chicken broth and monosodium glutamate and stir all together until sugar dissolves. Refrigerate until needed. To Prepare Chicken: In a separate bowl, combine chicken, 1/2 cup soy sauce and white pepper. Stir in egg. Add 1 cup cornstarch and stir until chicken is evenly coated. Add oil to help separate chicken pieces. Divide chicken into small quantities and deep fry at 350 degrees F (175 degrees C) until crispy. Drain on paper towels. To Make Mixture: Place a small amount of oil in wok and heat until wok is hot. Add scallions and dried chile peppers and stir-fry briefly. Remove sauce from refrigerator and stir. Add sauce to wok. Then add fried chicken and cook until sauce thickens (add cornstarch or water as needed until sauce is as thick as you like it).",
			"rating": "4.11744403839111",
			"cook_time": 20,
			"ready_in_time": 50,
			"id": 22759,
			"prep_time": 30,
			"nutrition": [
				"Calories: 842 kcal 42 %",
				"Fat: 40.5 g 62 %",
				"Carbs: 60.7g 20 %",
				"Protein: 56.5 g 113 %",
				"Cholesterol: 163 mg 54 %",
				"Sodium: 2057 mg 82 %"
			],
			"comment": "An Asian chicken recipe without the typical oriental taste. This recipe was voted one of the top 10 dishes in Columbus by Columbus Monthly Magazine, as prepared by Chef Paul Kaewprasart of the Siam Oriental Restaurant. I modified it slightly, and it goes great over white rice as a main dish for any number of people.",
			"cal": 842,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/7897.jpg",
			"ingredients": [
				"1/2 cup cornstarch ",
				" 1/4 cup water ",
				" 1 1/2 teaspoons minced garlic ",
				" 1 1/2 teaspoons minced fresh ginger root ",
				" 3/4 cup white sugar ",
				" 1/4 cup soy sauce ",
				" 1/4 cup white wine vinegar ",
				" 1/2 cup hot chicken broth ",
				" 1 teaspoon monosodium glutamate (MSG) ",
				" 3 pounds skinless, boneless chicken breast halves, cut into bite size pieces ",
				" 1/2 cup soy sauce ",
				" 1 teaspoon ground white pepper ",
				" 1 egg ",
				" 1 cup cornstarch ",
				" 1 cup vegetable oil ",
				" 2 cups chopped green onions ",
				" 16 chile peppers, sun-dried "
			]
		},
		{
			"name": "Japanese Zucchini and Onions",
			"reviews": "360",
			"directions": "Warm the oil in a large skillet over medium heat. Stir in onions, and cook 5 minutes. Add zucchini, and cook, stirring, about 1 minute. Stir in teriyaki sauce, soy sauce, and sesame seeds. Cook until zucchini are tender, about 5 minutes. Stir in ground pepper, and serve immediately.",
			"rating": "4.52054786682129",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 22760,
			"prep_time": 10,
			"nutrition": [
				"Calories: 110 kcal 6 %",
				"Fat: 8.2 g 13 %",
				"Carbs: 8.1g 3 %",
				"Protein: 2.7 g 5 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 581 mg 23 %"
			],
			"comment": "Zucchini and onions are stir fried with sesame seeds and teriyaki and soy sauces.",
			"cal": 110,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/244975.jpg",
			"ingredients": [
				"2 tablespoons vegetable oil ",
				" 1 medium onion, thinly sliced ",
				" 2 medium zucchinis, cut into thin strips ",
				" 2 tablespoons teriyaki sauce ",
				" 1 tablespoon soy sauce ",
				" 1 tablespoon toasted sesame seeds ",
				" ground black pepper "
			]
		},
		{
			"name": "Korean BBQ Chicken Marinade",
			"reviews": "359",
			"directions": "In a medium saucepan over high heat, whisk together the sugar, soy sauce, water, onion powder, and ground ginger. Bring to a boil. Reduce heat to low, and simmer 5 minutes. Remove the mixture from heat, cool, and whisk in lemon juice and hot chile paste. Place chicken in the mixture. Cover, and marinate in the refrigerator at least 4 hours before preparing chicken as desired.",
			"rating": "4.59667348861694",
			"cook_time": 15,
			"ready_in_time": 25,
			"id": 22761,
			"prep_time": 10,
			"nutrition": [
				"Calories: 20 kcal 1 %",
				"Fat: 0.1 g < 1 %",
				"Carbs: 4.9g 2 %",
				"Protein: 0.3 g < 1 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 304 mg 12 %"
			],
			"comment": "This sauce is from the very popular 'chicken bowls' in my hometown. It's very tasty! Use it as a marinade for chicken, or to baste chicken while grilling. Increase the hot chile paste as desired. Four tablespoons is usually as much as anyone can take!",
			"cal": 20,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/614027.jpg",
			"ingredients": [
				"1 cup white sugar ",
				" 1 cup soy sauce ",
				" 1 cup water ",
				" 1 teaspoon onion powder ",
				" 1 teaspoon ground ginger ",
				" 1 tablespoon lemon juice (optional) ",
				" 4 teaspoons hot chile paste (optional) "
			]
		},
		{
			"name": "Chicken Stir-Fry",
			"reviews": "498",
			"directions": "Bring rice and water to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until rice is tender, and liquid has been absorbed, 20 to 25 minutes. Combine soy sauce, brown sugar, and corn starch in a small bowl; stir until smooth. Mix ginger, garlic, and red pepper into sauce; coat chicken with marinade and refrigerate for at least 15 minutes. Heat 1 tablespoon sesame oil in a large skillet over medium-high heat. Cook and stir bell pepper, water chestnuts, broccoli, carrots, and onion until just tender, about 5 minutes. Remove vegetables from skillet and keep warm. Remove chicken from marinade, reserving liquid. Heat 1 tablespoon sesame oil in skillet over medium-high heat. Cook and stir chicken until slightly pink on the inside, about 2 minutes per side; return vegetables and reserved marinade to skillet. Bring to a boil; cook and stir until chicken is no longer pink in the middle and vegetables are tender, 5 to 7 minutes. Serve over rice.",
			"rating": "4.49333333969116",
			"cook_time": 35,
			"ready_in_time": 80,
			"id": 22762,
			"prep_time": 30,
			"nutrition": [
				"Calories: 700 kcal 35 %",
				"Fat: 12.1 g 19 %",
				"Carbs: 76.7g 25 %",
				"Protein: 67.7 g 135 %",
				"Cholesterol: 161 mg 54 %",
				"Sodium: 1790 mg 72 %"
			],
			"comment": "A quick and easy dish to prepare, this chicken stir-fry is packed with veggies. Try adding bean sprouts, bamboo shoots, snap peas, or any of your favorite vegetables. Serve it with white or brown rice, or noodles.",
			"cal": 700,
			"total_time": 145,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/973101.jpg",
			"ingredients": [
				"2 cups white rice ",
				" 4 cups water ",
				" 2/3 cup soy sauce ",
				" 1/4 cup brown sugar ",
				" 1 tablespoon cornstarch ",
				" 1 tablespoon minced fresh ginger ",
				" 1 tablespoon minced garlic ",
				" 1/4 teaspoon red pepper flakes ",
				" 3 skinless, boneless chicken breast halves, thinly sliced ",
				" 1 tablespoon sesame oil ",
				" 1 green bell pepper, cut into matchsticks ",
				" 1 (8 ounce) can sliced water chestnuts, drained ",
				" 1 head broccoli, broken into florets ",
				" 1 cup sliced carrots ",
				" 1 onion, cut into large chunks ",
				" 1 tablespoon sesame oil "
			]
		},
		{
			"name": "Chickpea Curry",
			"reviews": "439",
			"directions": "Heat oil in a large frying pan over medium heat, and fry onions until tender. Stir in garlic, ginger, cloves, cinnamon, cumin, coriander, salt, cayenne, and turmeric. Cook for 1 minute over medium heat, stirring constantly. Mix in garbanzo beans and their liquid. Continue to cook and stir until all ingredients are well blended and heated through. Remove from heat. Stir in cilantro just before serving, reserving 1 tablespoon for garnish.",
			"rating": "4.22315454483032",
			"cook_time": 30,
			"ready_in_time": 40,
			"id": 22763,
			"prep_time": 10,
			"nutrition": [
				"Calories: 135 kcal 7 %",
				"Fat: 4.5 g 7 %",
				"Carbs: 20.5g 7 %",
				"Protein: 4.1 g 8 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 289 mg 12 %"
			],
			"comment": "We usually recommend preparing the beans at home, but using canned chickpeas allows for a fast, convenient dish.",
			"cal": 135,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/163375.jpg",
			"ingredients": [
				"2 tablespoons vegetable oil ",
				" 2 onions, minced ",
				" 2 cloves garlic, minced ",
				" 2 teaspoons fresh ginger root, finely chopped ",
				" 6 whole cloves ",
				" 2 (2 inch) sticks cinnamon, crushed ",
				" 1 teaspoon ground cumin ",
				" 1 teaspoon ground coriander ",
				" salt ",
				" 1 teaspoon cayenne pepper ",
				" 1 teaspoon ground turmeric ",
				" 2 (15 ounce) cans garbanzo beans ",
				" 1 cup chopped fresh cilantro "
			]
		},
		{
			"name": "Asian Coconut Rice",
			"reviews": "459",
			"directions": "In a saucepan, combine coconut milk, water, sugar, and salt. Stir until sugar is dissolved. Stir in rice. Bring to a boil over medium heat. Cover, reduce heat, and simmer 18 to 20 minutes, until rice is tender.",
			"rating": "4.33937406539917",
			"cook_time": 20,
			"ready_in_time": 25,
			"id": 22765,
			"prep_time": 5,
			"nutrition": [
				"Calories: 453 kcal 23 %",
				"Fat: 20.9 g 32 %",
				"Carbs: 61.4g 20 %",
				"Protein: 6.8 g 14 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 54 mg 2 %"
			],
			"comment": "I tried so many different ways to duplicate my favorite restaurant's coconut rice after they went out of business. This one is perfect! Garnish with toasted coconut and chopped cilantro if you like.",
			"cal": 453,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2232157.jpg",
			"ingredients": [
				"1 (14 ounce) can coconut milk ",
				" 1 1/4 cups water ",
				" 1 teaspoon sugar ",
				" 1 pinch salt ",
				" 1 1/2 cups uncooked jasmine rice "
			]
		},
		{
			"name": "Slow Cooker Butter Chicken",
			"reviews": "342",
			"directions": "Melt the butter and vegetable oil in a large skillet over medium heat. Stir in the chicken, onion, and garlic. Cook and stir until the onion has softened and turned translucent, about 10 minutes. Stir in the curry powder, curry paste, tandoori masala, garam masala, and tomato paste until no lumps of tomato paste remain. Pour into a slow cooker, and stir in the cardamom pods, coconut milk, and yogurt. Season to taste with salt. Cook on High 4 to 6 hours, or on Low 6 to 8 hours until the chicken is tender and the sauce has reduced to your desired consistency. Remove and discard the cardamom pods before serving.",
			"rating": "4.45360803604126",
			"cook_time": 255,
			"ready_in_time": 270,
			"id": 22766,
			"prep_time": 15,
			"nutrition": [
				"Calories: 480 kcal 24 %",
				"Fat: 33.3 g 51 %",
				"Carbs: 17.2g 6 %",
				"Protein: 30.6 g 61 %",
				"Cholesterol: 103 mg 34 %",
				"Sodium: 442 mg 18 %"
			],
			"comment": "Indian food is one of my favorites, so when my friend made this slow cooker version for my family we were head over heels! I don't think I've had a Butter Chicken that I've liked more. It's wonderful to put into the slow cooker in the morning and come home to the warm Indian spice smell....LOVE IT! Serve with basmati rice and warm naan bread.",
			"cal": 480,
			"total_time": 540,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1119998.jpg",
			"ingredients": [
				"2 tablespoons butter ",
				" 2 tablespoons vegetable oil ",
				" 4 large skinless, boneless chicken thighs, cut into bite-sized pieces ",
				" 1 onion, diced ",
				" 3 cloves garlic, minced ",
				" 2 teaspoons curry powder ",
				" 1 tablespoon curry paste ",
				" 2 teaspoons tandoori masala ",
				" 1 teaspoon garam masala ",
				" 1 (6 ounce) can tomato paste ",
				" 15 green cardamom pods ",
				" 1 cup low-fat plain yogurt ",
				" 1 (14 ounce) can coconut milk ",
				" salt to taste "
			]
		},
		{
			"name": "Mongolian Beef and Spring Onions",
			"reviews": "445",
			"directions": "Heat 2 teaspoons of vegetable oil in a saucepan over medium heat, and cook and stir the garlic and ginger until they release their fragrance, about 30 seconds. Pour in the soy sauce, water, and brown sugar. Raise the heat to medium-high, and stir 4 minutes, until the sugar has dissolved and the sauce boils and slightly thickens. Remove sauce from the heat, and set aside. Place the sliced beef into a bowl, and stir the cornstarch into the beef, coating it thoroughly. Allow the beef and cornstarch to sit until most of the juices from the meat have been absorbed by the cornstarch, about 10 minutes. Heat the vegetable oil in a deep-sided skillet or wok to 375 degrees F (190 degrees C). Shake excess cornstarch from the beef slices, and drop them into the hot oil, a few at a time. Stir briefly, and fry until the edges become crisp and start to brown, about 2 minutes. Remove the beef from the oil with a large slotted spoon, and allow to drain on paper towels to remove excess oil. Pour the oil out of the skillet or wok, and return the pan to medium heat. Return the beef slices to the pan, stir briefly, and pour in the reserved sauce. Stir once or twice to combine, and add the green onions. Bring the mixture to a boil, and cook until the onions have softened and turned bright green, about 2 minutes.",
			"rating": "4.60508489608765",
			"cook_time": 8,
			"ready_in_time": 30,
			"id": 22767,
			"prep_time": 12,
			"nutrition": [
				"Calories: 391 kcal 20 %",
				"Fat: 12.1 g 19 %",
				"Carbs: 54.7g 18 %",
				"Protein: 18 g 36 %",
				"Cholesterol: 27 mg 9 %",
				"Sodium: 1862 mg 74 %"
			],
			"comment": "A soy-based Chinese-style beef dish. Best served over soft rice noodles or rice.",
			"cal": 391,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1122980.jpg",
			"ingredients": [
				"2 teaspoons vegetable oil ",
				" 1 tablespoon finely chopped garlic ",
				" 1/2 teaspoon grated fresh ginger root ",
				" 1/2 cup soy sauce ",
				" 1/2 cup water ",
				" 2/3 cup dark brown sugar ",
				" 1 pound beef flank steak, sliced 1/4 inch thick on the diagonal ",
				" 1/4 cup cornstarch ",
				" 1 cup vegetable oil for frying ",
				" 2 bunches green onions, cut in 2-inch lengths "
			]
		},
		{
			"name": "Sweet and Spicy Stir Fry with Chicken and Broccoli",
			"reviews": "319",
			"directions": "Place broccoli in a steamer over 1 inch of boiling water, and cover. Cook until tender but still firm, about 5 minutes. Heat the oil in a skillet over medium heat, and saute the chicken, green onions, and garlic until the chicken is no longer pink and juices run clear. Stir the hoisin sauce, chile paste, and soy sauce into the skillet; season with ginger, red pepper, salt, and black pepper. Stir in the chicken stock and simmer about 2 minutes. Mix in the steamed broccoli until coated with the sauce mixture.",
			"rating": "4.39490461349487",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 22768,
			"prep_time": 10,
			"nutrition": [
				"Calories: 156 kcal 8 %",
				"Fat: 6.2 g 10 %",
				"Carbs: 10.9g 4 %",
				"Protein: 15.9 g 32 %",
				"Cholesterol: 36 mg 12 %",
				"Sodium: 606 mg 24 %"
			],
			"comment": "Garlic, crushed red pepper, and chili paste add heat; hoisin sauce and ginger sweeten the deal. Great served over jasmine rice!",
			"cal": 156,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/370252.jpg",
			"ingredients": [
				"3 cups broccoli florets ",
				" 1 tablespoon olive oil ",
				" 2 skinless, boneless chicken breast halves - cut into 1 inch strips ",
				" 1/4 cup sliced green onions ",
				" 4 cloves garlic, thinly sliced ",
				" 1 tablespoon hoisin sauce ",
				" 1 tablespoon chile paste ",
				" 1 tablespoon low sodium soy sauce ",
				" 1/2 teaspoon ground ginger ",
				" 1/4 teaspoon crushed red pepper ",
				" 1/2 teaspoon salt ",
				" 1/2 teaspoon black pepper ",
				" 1/8 cup chicken stock "
			]
		},
		{
			"name": "Pineapple Grilled Pork Chops",
			"reviews": "284",
			"directions": "Mix together the drained pineapple juice, brown sugar, soy sauce, and garlic powder together in a large plastic zipper bag, and smush the bag a few times with your hands to mix the marinade and dissolve the sugar. Place the pork chops into the marinade, squeeze out any air in the bag, seal it, and refrigerate overnight. Reserve the pineapple rings. Preheat an outdoor grill for medium heat, and lightly oil the grate. Remove the chops from the marinade, shaking off excess, and grill until browned, the meat is no longer pink inside, and the meat shows good grill marks, 5 to 8 minutes per side. Brush several times with marinade and let the marinade cook onto the surface of the meat. Discard excess marinade. While the meat is grilling, place 4 pineapple rings onto the grill, and allow to cook until hot and the slices show grill marks; serve the chops topped with the grilled pineapple rings.",
			"rating": "4.65573787689209",
			"cook_time": 15,
			"ready_in_time": 505,
			"id": 22769,
			"prep_time": 10,
			"nutrition": [
				"Calories: 392 kcal 20 %",
				"Fat: 12.9 g 20 %",
				"Carbs: 26g 8 %",
				"Protein: 40.9 g 82 %",
				"Cholesterol: 124 mg 41 %",
				"Sodium: 1000 mg 40 %"
			],
			"comment": "These are a delightful and quick meal for the grill. I usually serve with a baked potato, but my daughter loves them with wild rice.",
			"cal": 392,
			"total_time": 530,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/857812.jpg",
			"ingredients": [
				"1 (8 ounce) can pineapple rings, juice drained and reserved ",
				" 1/4 cup brown sugar ",
				" 1/4 cup soy sauce ",
				" 1/4 teaspoon garlic powder ",
				" 4 pork chops ",
				" 1 pinch ground black pepper "
			]
		},
		{
			"name": "Baked Tofu Bites",
			"reviews": "320",
			"directions": "Preheat oven to 375 degrees F (190 degrees C). Lightly spray a non-stick baking sheet with oil. Slice tofu into 1/2-inch slices, and gently press excess water out of tofu. Cut sliced tofu into 1/2-inch cubes. In a bowl, stir together the soy sauce, maple syrup, ketchup, vinegar, and hot sauce. Stir in sesame seeds, garlic powder, black pepper, and liquid smoke. Gently stir tofu cubes into sauce. Cover, and marinate at least 5 minutes. Place the tofu on the baking sheet in a single layer. Bake in a preheated oven for 15 minutes. Turn tofu, and bake until the tofu turns golden brown, about 15 minutes more.",
			"rating": "4.01631689071655",
			"cook_time": 15,
			"ready_in_time": 25,
			"id": 22770,
			"prep_time": 10,
			"nutrition": [
				"Calories: 168 kcal 8 %",
				"Fat: 8.8 g 14 %",
				"Carbs: 12.8g 4 %",
				"Protein: 12.7 g 25 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 1002 mg 40 %"
			],
			"comment": "Tofu cubes are marinated and then baked in the oven. The tofu can be used as a hot or cold snack or used as salad topping. Don't forget the smoke flavoring, it really adds the special flavor.",
			"cal": 168,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/20406.jpg",
			"ingredients": [
				"1 (16 ounce) package extra firm tofu ",
				" 1/4 cup soy sauce ",
				" 2 tablespoons maple syrup ",
				" 2 tablespoons ketchup ",
				" 1 tablespoon vinegar ",
				" 1 dash hot sauce ",
				" 1 tablespoon sesame seeds ",
				" 1/4 teaspoon garlic powder ",
				" 1/4 teaspoon ground black pepper ",
				" 1 teaspoon liquid smoke flavoring "
			]
		},
		{
			"name": "Asian Tuna Patties",
			"reviews": "325",
			"directions": "In a large bowl, mix tuna, egg, bread crumbs, green onions, and garlic. Blend soy sauce, teriyaki sauce, ketchup, sesame oil, and pepper into the mixture. Form the mixture into about 6 patties approximately 1 inch thick. Lightly sprinkle each patty on all sides with cornmeal. Heat oil in a medium skillet over medium heat. Fry each patty about 5 minutes on each side, until golden brown.",
			"rating": "4.24078607559204",
			"cook_time": 20,
			"ready_in_time": 35,
			"id": 22771,
			"prep_time": 15,
			"nutrition": [
				"Calories: 230 kcal 12 %",
				"Fat: 7.6 g 12 %",
				"Carbs: 21.1g 7 %",
				"Protein: 18.6 g 37 %",
				"Cholesterol: 48 mg 16 %",
				"Sodium: 434 mg 17 %"
			],
			"comment": "A delicious, fast, and different way to eat tuna. Everyone who has tried this has asked for the recipe.",
			"cal": 230,
			"total_time": 70,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/130471.jpg",
			"ingredients": [
				"2 (6 ounce) cans tuna, drained and flaked ",
				" 1 egg, beaten ",
				" 3/4 cup dry bread crumbs ",
				" 3 green onions, minced ",
				" 1 clove garlic, peeled and minced ",
				" 1 tablespoon soy sauce ",
				" 1 tablespoon teriyaki sauce ",
				" 1 tablespoon ketchup ",
				" 1 teaspoon sesame oil ",
				" 1 teaspoon black pepper ",
				" 1/2 cup cornmeal ",
				" 2 tablespoons vegetable oil "
			]
		},
		{
			"name": "Yakisoba Chicken",
			"reviews": "319",
			"directions": "In a large skillet combine sesame oil, canola oil and chili paste; stir-fry 30 seconds. Add garlic and stir fry an additional 30 seconds. Add chicken and 1/4 cup of the soy sauce and stir fry until chicken is no longer pink, about 5 minutes. Remove mixture from pan, set aside, and keep warm. In the emptied pan combine the onion, cabbage, and carrots. Stir-fry until cabbage begins to wilt, 2 to 3 minutes. Stir in the remaining soy sauce, cooked noodles, and the chicken mixture to pan and mix to blend. Serve and enjoy!",
			"rating": "4.30909109115601",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 22772,
			"prep_time": 15,
			"nutrition": [
				"Calories: 295 kcal 15 %",
				"Fat: 4.8 g 7 %",
				"Carbs: 40.7g 13 %",
				"Protein: 26.3 g 53 %",
				"Cholesterol: 46 mg 15 %",
				"Sodium: 1621 mg 65 %"
			],
			"comment": "Japanese buckwheat flour noodles with chicken at their best! Noodles can be found in an Asian foods market.",
			"cal": 295,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2966787.jpg",
			"ingredients": [
				"1/2 teaspoon sesame oil ",
				" 1 tablespoon canola oil ",
				" 2 tablespoons chile paste ",
				" 2 cloves garlic, chopped ",
				" 4 skinless, boneless chicken breast halves - cut into 1 inch cubes ",
				" 1/2 cup soy sauce ",
				" 1 onion, sliced lengthwise into eighths ",
				" 1/2 medium head cabbage, coarsely chopped ",
				" 2 carrots, coarsely chopped ",
				" 8 ounces soba noodles, cooked and drained "
			]
		},
		{
			"name": "Indonesian Satay",
			"reviews": "323",
			"directions": "In a bowl, mix soy sauce, tomato sauce, peanut oil, garlic, black pepper, and cumin. Place chicken into the mixture, and stir to coat. Cover, and marinate in the refrigerator for at least 15 minutes, but not overnight. This will make the meat too dark. Preheat the grill for high heat. Heat vegetable oil in a saucepan over medium heat, and saute onion and garlic until lightly browned. Mix in water, peanut butter, soy sauce, and sugar. Cook and stir until well blended. Remove from heat, mix in lemon juice, and set aside. Lightly oil the grill grate. Thread chicken onto skewers, and discard marinade. Grill skewers about 5 minutes per side, until chicken juices run clear. Serve with the peanut sauce.",
			"rating": "4.57411766052246",
			"cook_time": 20,
			"ready_in_time": 60,
			"id": 22773,
			"prep_time": 25,
			"nutrition": [
				"Calories: 329 kcal 16 %",
				"Fat: 18.2 g 28 %",
				"Carbs: 11.8g 4 %",
				"Protein: 30.8 g 62 %",
				"Cholesterol: 67 mg 22 %",
				"Sodium: 957 mg 38 %"
			],
			"comment": "This is an original Indonesian satay. I send it from a long way. Hope all over the world, readers can enjoy it.",
			"cal": 329,
			"total_time": 105,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/971617.jpg",
			"ingredients": [
				"3 tablespoons soy sauce ",
				" 3 tablespoons tomato sauce ",
				" 1 tablespoon peanut oil ",
				" 2 cloves garlic, peeled and minced ",
				" 1 pinch ground black pepper ",
				" 1 pinch ground cumin ",
				" 6 skinless, boneless chicken breast halves - cubed ",
				" 1 tablespoon vegetable oil ",
				" 1/4 cup minced onion ",
				" 1 clove garlic, peeled and minced ",
				" 1 cup water ",
				" 1/2 cup chunky peanut butter ",
				" 2 tablespoons soy sauce ",
				" 2 tablespoons white sugar ",
				" 1 tablespoon lemon juice ",
				" skewers "
			]
		},
		{
			"name": "Thai Green Curry Chicken",
			"reviews": "332",
			"directions": "Toss chicken first in 1 tablespoon dark soy sauce, then in the flour, coating pieces evenly. Heat the oil in a large skillet over medium high heat. Place chicken in the skillet, cook and stir chicken until browned, about 5 minutes. Remove chicken. Reduce heat to medium and stir in curry paste. Cook for 1 minute until fragrant, then stir in green onions, garlic, and ginger; cook an additional 2 minutes. Return chicken to the skillet, stirring to coat with the curry mixture. Stir the coconut milk, fish sauce, 1 tablespoon soy sauce, and sugar into the chicken-curry mixture. Allow to simmer over medium heat for 20 minutes until the chicken is tender. Serve garnished with cilantro leaves.",
			"rating": "4.52173900604248",
			"cook_time": 40,
			"ready_in_time": 60,
			"id": 22774,
			"prep_time": 20,
			"nutrition": [
				"Calories: 472 kcal 24 %",
				"Fat: 40.9 g 63 %",
				"Carbs: 14.6g 5 %",
				"Protein: 27.1 g 54 %",
				"Cholesterol: 57 mg 19 %",
				"Sodium: 935 mg 37 %"
			],
			"comment": "In this quick and easy recipe that never fails, the chicken stays moist and tender. Serve over jasmine rice for a satisfying meal.",
			"cal": 472,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2293489.jpg",
			"ingredients": [
				"1 pound skinless, boneless chicken breast halves - cut into 1 inch cubes ",
				" 1 tablespoon dark soy sauce ",
				" 1 tablespoon all-purpose flour ",
				" 2 tablespoons cooking oil ",
				" 2 tablespoons green curry paste ",
				" 2 green onions with tops, chopped ",
				" 3 cloves garlic, peeled and chopped ",
				" 1 teaspoon fresh ginger, peeled and finely chopped ",
				" 2 cups coconut milk ",
				" 1 tablespoon fish sauce ",
				" 1 tablespoon dark soy sauce ",
				" 2 tablespoons white sugar ",
				" 1/2 cup cilantro leaves, for garnish "
			]
		},
		{
			"name": "Baingan Bharta (Eggplant Curry)",
			"reviews": "309",
			"directions": "Preheat oven to 450 degrees F (230 degrees C). Place eggplant on a medium baking sheet. Bake 20 to 30 minutes in the preheated oven, until tender. Remove from heat, cool, peel, and chop. Heat oil in a medium saucepan over medium heat. Mix in cumin seeds and onion. Cook and stir until onion is tender. Mix ginger garlic paste, curry powder, and tomato into the saucepan, and cook about 1 minute. Stir in yogurt. Mix in eggplant and jalapeno pepper, and season with salt. Cover, and cook 10 minutes over high heat. Remove cover, reduce heat to low, and continue cooking about 5 minutes. Garnish with cilantro to serve.",
			"rating": "4.3059868812561",
			"cook_time": 45,
			"ready_in_time": 60,
			"id": 22775,
			"prep_time": 15,
			"nutrition": [
				"Calories: 146 kcal 7 %",
				"Fat: 8 g 12 %",
				"Carbs: 15.2g 5 %",
				"Protein: 4 g 8 %",
				"Cholesterol: 2 mg < 1 %",
				"Sodium: 739 mg 30 %"
			],
			"comment": "This is a really easy and tasty Indian dish that is sure to stir up your taste buds. Delicious baingan bharta is ready to eat with pita bread, Indian naan, or rice.",
			"cal": 146,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/14597.jpg",
			"ingredients": [
				"1 large eggplant ",
				" 2 tablespoons vegetable oil ",
				" 1 teaspoon cumin seeds ",
				" 1 medium onion, thinly sliced ",
				" 1 tablespoon ginger garlic paste ",
				" 1 tablespoon curry powder ",
				" 1 tomato, diced ",
				" 1/2 cup plain yogurt ",
				" 1 fresh jalapeno chile pepper, finely chopped ",
				" 1 teaspoon salt ",
				" 1/4 bunch cilantro, finely chopped "
			]
		},
		{
			"name": "Crab Rangoon III",
			"reviews": "329",
			"directions": "In a large, heavy sauce pan heat oil to 375 degrees F (190 degrees C). In a medium bowl, mix cream cheese, crabmeat, garlic powder, paprika and water chestnuts. Place approximately 1 teaspoon of the cream cheese mixture in the center of wonton wrappers. Moisten wrapper edges with water, fold over the mixture and pinch to seal. In small batches, fry the wontons 3 to 5 minutes, or until golden brown.",
			"rating": "4.30260038375854",
			"cook_time": 20,
			"ready_in_time": 45,
			"id": 22776,
			"prep_time": 25,
			"nutrition": [
				"Calories: 203 kcal 10 %",
				"Fat: 11.7 g 18 %",
				"Carbs: 15.8g 5 %",
				"Protein: 8.3 g 17 %",
				"Cholesterol: 39 mg 13 %",
				"Sodium: 268 mg 11 %"
			],
			"comment": "Crabmeat and cream cheese wontons make excellent appetizers. Leave out the water chestnuts, if desired. Serve with your favorite Asian-style dipping sauces.",
			"cal": 203,
			"total_time": 90,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/75734.jpg",
			"ingredients": [
				"1 quart oil for deep frying ",
				" 1 (8 ounce) package cream cheese, softened ",
				" 2 (6 ounce) cans crabmeat, drained and flaked ",
				" 1/2 teaspoon garlic powder ",
				" 1/4 teaspoon paprika ",
				" 2 tablespoons water chestnuts, drained and chopped ",
				" 1 (14 ounce) package wonton wrappers "
			]
		},
		{
			"name": "Chinese Pepper Steak",
			"reviews": "356",
			"directions": "Slice the steak into 1/2-inch thick slices across the grain. Whisk together soy sauce, sugar, cornstarch, and ginger in a bowl until the sugar has dissolved and the mixture is smooth. Place the steak slices into the marinade, and stir until well-coated. Heat 1 tablespoon of vegetable oil in a wok or large skillet over medium-high heat, and place 1/3 of the steak strips into the hot oil. Cook and stir until the beef is well-browned, about 3 minutes, and remove the beef from the wok to a bowl. Repeat twice more, with the remaining beef, and set the cooked beef aside. Return all the cooked beef to the hot wok, and stir in the onion. Toss the beef and onion together until the onion begins to soften, about 2 minutes, then stir in the green pepper. Cook and stir the mixture until the pepper has turned bright green and started to become tender, about 2 minutes, then add the tomatoes, stir everything together, and serve.",
			"rating": "4.55652189254761",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 22778,
			"prep_time": 15,
			"nutrition": [
				"Calories: 312 kcal 16 %",
				"Fat: 15.4 g 24 %",
				"Carbs: 17g 5 %",
				"Protein: 26.1 g 52 %",
				"Cholesterol: 69 mg 23 %",
				"Sodium: 972 mg 39 %"
			],
			"comment": "A delicious meal, served with boiled white rice, that's easy and made from items that I've already got in my cupboards! My mother clipped this recipe from somewhere and it became a specialty of mine; however, I've been unable to find the original source.",
			"cal": 312,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/1114848.jpg",
			"ingredients": [
				"1 pound beef top sirloin steak ",
				" 1/4 cup soy sauce ",
				" 2 tablespoons white sugar ",
				" 2 tablespoons cornstarch ",
				" 1/2 teaspoon ground ginger ",
				" 3 tablespoons vegetable oil, divided ",
				" 1 red onion, cut into 1-inch squares ",
				" 1 green bell pepper, cut into 1-inch squares ",
				" 2 tomatoes, cut into wedges "
			]
		},
		{
			"name": "Aloo Phujia",
			"reviews": "290",
			"directions": "Lightly brown onion in oil in a medium size skillet. Stir in salt, cayenne, turmeric and cumin. Add potatoes and cook 10 minutes stirring occasionally. Add tomatoes, cover pan and cook until potatoes are soft, about 10 minutes.",
			"rating": "4.39810419082642",
			"cook_time": 20,
			"ready_in_time": 30,
			"id": 22779,
			"prep_time": 10,
			"nutrition": [
				"Calories: 235 kcal 12 %",
				"Fat: 14.1 g 22 %",
				"Carbs: 25.7g 8 %",
				"Protein: 3.3 g 7 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 593 mg 24 %"
			],
			"comment": "Spicy potatoes, tomatoes and onions with an Indian kick! This is super spicy so be aware!",
			"cal": 235,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/695663.jpg",
			"ingredients": [
				"1 onion, chopped ",
				" 1/4 cup vegetable oil ",
				" 1 pound potatoes, peeled and cubed ",
				" 1 teaspoon salt ",
				" 1/2 teaspoon cayenne pepper ",
				" 1/2 teaspoon ground turmeric ",
				" 1/4 teaspoon ground cumin ",
				" 2 tomatoes, chopped "
			]
		},
		{
			"name": "Black Pepper Beef and Cabbage Stir Fry",
			"reviews": "363",
			"directions": "Heat a wok or large skillet over medium-high heat, and add oil. Saute garlic for about 5 seconds, then add ground beef. Stir-fry until beef is evenly brown. Stir in cabbage and pepper, and cook until vegetables are tender, and beef is fully cooked. Stir in soy sauce. Mix together cornstarch and water, and stir in. Season with pepper. Cook, stirring, until sauce has thickened.",
			"rating": "4.24893617630005",
			"cook_time": 5,
			"ready_in_time": 20,
			"id": 22780,
			"prep_time": 15,
			"nutrition": [
				"Calories: 280 kcal 14 %",
				"Fat: 22.1 g 34 %",
				"Carbs: 9.5g 3 %",
				"Protein: 11.6 g 23 %",
				"Cholesterol: 48 mg 16 %",
				"Sodium: 508 mg 20 %"
			],
			"comment": "A very simple Chinese stir-fry dish which is fabulous in taste. I saw my husband going for two additional servings of it and I had to remind him to leave some for the rest of the family! Serve with hot steamed rice.",
			"cal": 280,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/422716.jpg",
			"ingredients": [
				"2 tablespoons vegetable oil ",
				" 4 cloves garlic, chopped ",
				" 1/2 pound ground beef ",
				" 1/2 small head cabbage, shredded ",
				" 1 red bell pepper, cut into strips ",
				" 2 tablespoons soy sauce ",
				" 1 teaspoon cornstarch ",
				" 1/2 cup water ",
				" 1 teaspoon ground black pepper "
			]
		},
		{
			"name": "Shrimp Fried Rice II",
			"reviews": "320",
			"directions": "In a saucepan bring water to a boil. Add rice and stir. Reduce heat, cover and simmer for 20 minutes. Set aside and allow rice to cool. Heat a large skillet or wok for 2 minutes. When the skillet or wok is hot, pour in vegetable oil, bean sprouts and onions. Mix well and cook for 3 minutes. Mix in cooled rice and shrimp and cook for another 3 minutes. Stirring constantly. Mix in green onions, eggs, salt, pepper, soy sauce and sesame oil. Cook for another 4 minutes, stirring continuously, until eggs are cooked and everything is blended evenly.",
			"rating": "4.20941162109375",
			"cook_time": 10,
			"ready_in_time": 30,
			"id": 22781,
			"prep_time": 20,
			"nutrition": [
				"Calories: 483 kcal 24 %",
				"Fat: 17.5 g 27 %",
				"Carbs: 60.3g 19 %",
				"Protein: 20 g 40 %",
				"Cholesterol: 187 mg 62 %",
				"Sodium: 1638 mg 66 %"
			],
			"comment": "The real shrimp fried rice, restaurant style. This is how I used to cook fried rice when my father still owned a restaurant.",
			"cal": 483,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/646916.jpg",
			"ingredients": [
				"1 1/2 cups uncooked white rice ",
				" 3 cups water ",
				" 4 tablespoons vegetable oil ",
				" 1 cup fresh bean sprouts ",
				" 1/2 cup chopped onion ",
				" 1 1/2 cups cooked medium shrimp, peeled and deveined without tail ",
				" 1/4 cup chopped green onion ",
				" 2 eggs, beaten ",
				" 1 teaspoon salt ",
				" 1/4 teaspoon ground black pepper ",
				" 4 tablespoons soy sauce ",
				" 1/4 teaspoon sesame oil "
			]
		},
		{
			"name": "Thai Pineapple Chicken Curry",
			"reviews": "307",
			"directions": "Bring rice and water to a boil in a pot. Reduce heat to low, cover, and simmer 25 minutes. In a bowl, whisk together curry paste and 1 can coconut milk. Transfer to a wok, and mix in remaining coconut milk, chicken, fish sauce, sugar, and bamboo shoots. Bring to a boil, and cook 15 minutes, until chicken juices run clear. Mix the red bell pepper, green bell pepper, and onion into the wok. Continue cooking 10 minutes, until chicken juices run clear and peppers are tender. Remove from heat, and stir in pineapple. Serve over the cooked rice.",
			"rating": "4.50675678253174",
			"cook_time": 35,
			"ready_in_time": 50,
			"id": 22783,
			"prep_time": 15,
			"nutrition": [
				"Calories: 623 kcal 31 %",
				"Fat: 34.5 g 53 %",
				"Carbs: 77.5g 25 %",
				"Protein: 20.3 g 41 %",
				"Cholesterol: 20 mg 7 %",
				"Sodium: 781 mg 31 %"
			],
			"comment": "This is a quick, easy, and authentic Thai curry dish that's sweet and very spicy. I became addicted to the dish at a local restaurant and then worked to duplicate it at home. I think I've got the taste and presentation pegged. I'm guesstimating on the amounts since I don't measure much when I cook. Feel free to adjust to taste.",
			"cal": 623,
			"total_time": 100,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/42027.jpg",
			"ingredients": [
				"2 cups uncooked jasmine rice ",
				" 1 quart water ",
				" 1/4 cup red curry paste ",
				" 2 (13.5 ounce) cans coconut milk ",
				" 2 skinless, boneless chicken breast halves - cut into thin strips ",
				" 3 tablespoons fish sauce ",
				" 1/4 cup white sugar ",
				" 1 1/2 cups sliced bamboo shoots, drained ",
				" 1/2 red bell pepper, julienned ",
				" 1/2 green bell pepper, julienned ",
				" 1/2 small onion, chopped ",
				" 1 cup pineapple chunks, drained "
			]
		},
		{
			"name": "Honey Walnut Shrimp",
			"reviews": "346",
			"directions": "Stir together the water and sugar in a small saucepan. Bring to a boil and add the walnuts. Boil for 2 minutes, then drain and place walnuts on a cookie sheet to dry. Whip egg whites in a medium bowl until foamy. Stir in the mochiko until it has a pasty consistency. Heat the oil in a heavy deep skillet over medium-high heat. Dip shrimp into the mochiko batter, and then fry in the hot oil until golden brown, about 5 minutes. Remove with a slotted spoon and drain on paper towels. In a medium serving bowl, stir together the mayonnaise, honey and sweetened condensed milk. Add shrimp and toss to coat with the sauce. Sprinkle the candied walnuts on top and serve.",
			"rating": "4.49438190460205",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 22784,
			"prep_time": 15,
			"nutrition": [
				"Calories: 605 kcal 30 %",
				"Fat: 26.3 g 40 %",
				"Carbs: 68g 22 %",
				"Protein: 26.2 g 52 %",
				"Cholesterol: 180 mg 60 %",
				"Sodium: 339 mg 14 %"
			],
			"comment": "Hong Kong Style Chinese recipe! Crispy battered shrimp tossed in creamy sauce topped with sugar coated walnuts",
			"cal": 605,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/270515.jpg",
			"ingredients": [
				"1 cup water ",
				" 2/3 cup white sugar ",
				" 1/2 cup walnuts ",
				" 4 egg whites ",
				" 2/3 cup mochiko (glutinous rice flour) ",
				" 1/4 cup mayonnaise ",
				" 1 pound large shrimp, peeled and deveined ",
				" 2 tablespoons honey ",
				" 1 tablespoon canned sweetened condensed milk ",
				" 1 cup vegetable oil for frying "
			]
		},
		{
			"name": "Japanese-Style Sesame Green Beans",
			"reviews": "283",
			"directions": "Warm a large skillet or wok over medium heat. When the skillet is hot, pour in canola and sesame oils, then place whole green beans into the skillet. Stir the beans to coat with oil. Cook until the beans are bright green and slightly browned in spots, about 10 minutes. Remove from heat, and stir in soy sauce; cover, and let sit about 5 minutes. Transfer to a serving platter, and sprinkle with toasted sesame seeds.",
			"rating": "4.46618366241455",
			"cook_time": 15,
			"ready_in_time": 20,
			"id": 22785,
			"prep_time": 5,
			"nutrition": [
				"Calories: 97 kcal 5 %",
				"Fat: 6.6 g 10 %",
				"Carbs: 8.9g 3 %",
				"Protein: 2.7 g 5 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 233 mg 9 %"
			],
			"comment": "I discovered this dish at my mother-in-law's house during a family holiday buffet. Her being Japanese, she had many friends who brought wonderful Japanese dishes, and this was and has remained one of my favorites. It's light and fresh any time of the year.",
			"cal": 97,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/121929.jpg",
			"ingredients": [
				"1 tablespoon canola oil ",
				" 1 1/2 teaspoons sesame oil ",
				" 1 pound fresh green beans, washed ",
				" 1 tablespoon soy sauce ",
				" 1 tablespoon toasted sesame seeds "
			]
		},
		{
			"name": "Slammin' Salmon",
			"reviews": "289",
			"directions": "Stir balsamic vinegar, lemon juice, and soy sauce with salt, brown sugar, ground ginger, paprika, pepper, and red pepper flakes until the salt has dissolved. Stir in garlic, green onions, sesame oil, and peanut oil until well combined. Pour marinade into a resealable plastic bag or glass bowl. Add salmon to marinade and gently toss to coat. Place into refrigerator and marinate 2 to 24 hours. Prepare an outdoor grill for medium-high heat. Drain excess marinade from salmon fillets. Grill until firm and opaque, about 4 minutes per side.",
			"rating": "4.557692527771",
			"cook_time": 8,
			"ready_in_time": 138,
			"id": 22786,
			"prep_time": 10,
			"nutrition": [
				"Calories: 664 kcal 33 %",
				"Fat: 50.4 g 78 %",
				"Carbs: 11.2g 4 %",
				"Protein: 40.9 g 82 %",
				"Cholesterol: 112 mg 37 %",
				"Sodium: 1599 mg 64 %"
			],
			"comment": "An amazing culinary delight. Hands down the greatest grilled salmon ever. Easy and delicious.",
			"cal": 664,
			"total_time": 156,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/44537.jpg",
			"ingredients": [
				"1/4 cup balsamic vinegar ",
				" 1/4 cup lemon juice ",
				" 1/4 cup soy sauce ",
				" 1 teaspoon salt ",
				" 1 tablespoon brown sugar ",
				" 1 1/2 teaspoons ground ginger ",
				" 1 teaspoon paprika ",
				" 1 teaspoon black pepper ",
				" 1 teaspoon crushed red pepper flakes ",
				" 4 cloves garlic, minced ",
				" 1/4 cup chopped green onions ",
				" 1 teaspoon sesame oil ",
				" 1/2 cup peanut oil ",
				" 8 (4 ounce) skinless, boneless salmon fillets "
			]
		},
		{
			"name": "Grilled Peanut Chicken",
			"reviews": "274",
			"directions": "Preheat grill for high heat. In a bowl, mix the peanut butter, lime juice, soy sauce, garlic, curry powder, and cayenne pepper. Lightly oil the grill grate. Place chicken on grate, and brush with 1/2 the sauce. Grill 6 to 8 minutes. Turn chicken, and brush with remaining sauce. Continue grilling 6 to 8 minutes, until chicken juices run clear.",
			"rating": "3.98280096054077",
			"cook_time": 15,
			"ready_in_time": 30,
			"id": 22787,
			"prep_time": 15,
			"nutrition": [
				"Calories: 176 kcal 9 %",
				"Fat: 5.6 g 9 %",
				"Carbs: 3.6g 1 %",
				"Protein: 27 g 54 %",
				"Cholesterol: 67 mg 22 %",
				"Sodium: 253 mg 10 %"
			],
			"comment": "This is a perfect dish when you have company coming and no idea what to fix them, especially when you don't want to be boring about dinner.",
			"cal": 176,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/39170.jpg",
			"ingredients": [
				"2 tablespoons reduced fat peanut butter ",
				" 1 tablespoon fresh lime juice ",
				" 2 teaspoons soy sauce ",
				" 1 clove garlic, chopped ",
				" 1/3 teaspoon curry powder ",
				" 1 dash ground cayenne pepper ",
				" 4 skinless, boneless chicken breast halves "
			]
		},
		{
			"name": "Asian Ginger Dressing",
			"reviews": "303",
			"directions": "In a 1 pint glass jar or larger, combine the garlic, ginger, olive oil, rice vinegar, soy sauce, honey, and water. Cover the jar with a tight fitting lid, and shake well. Remove lid, and heat jar in the microwave for 1 minute just to dissolve the honey. Let cool, and shake well before serving. Store covered in the refrigerator.",
			"rating": "4.46291542053223",
			"cook_time": 1,
			"ready_in_time": 10,
			"id": 22789,
			"prep_time": 9,
			"nutrition": [
				"Calories: 86 kcal 4 %",
				"Fat: 8.1 g 12 %",
				"Carbs: 3.3g 1 %",
				"Protein: 0.5 g < 1 %",
				"Cholesterol: 0 mg 0 %",
				"Sodium: 361 mg 14 %"
			],
			"comment": "Terrific salad dressing for all salads - especially great for use on cabbage salads. Everyone who has had the dressing wants the recipe.",
			"cal": 86,
			"total_time": 20,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/2659.jpg",
			"ingredients": [
				"3 cloves garlic, minced ",
				" 2 tablespoons minced fresh ginger root ",
				" 3/4 cup olive oil ",
				" 1/3 cup rice vinegar ",
				" 1/2 cup soy sauce ",
				" 3 tablespoons honey ",
				" 1/4 cup water "
			]
		},
		{
			"name": "Super-Simple, Super-Spicy Mongolian Beef",
			"reviews": "281",
			"directions": "Whisk together soy sauce, hoisin sauce, sesame oil, sugar, garlic, and red pepper flakes in a bowl. Toss beef with marinade, cover, and refrigerate 1 hour to overnight. Heat peanut oil in a wok or large, nonstick skillet over high heat. Add the green onions, and cook for 5 to 10 seconds before stirring in the beef. Cook and stir until the beef is no longer pink and is beginning to brown, about 5 minutes.",
			"rating": "4.54987192153931",
			"cook_time": 6,
			"ready_in_time": 81,
			"id": 22790,
			"prep_time": 15,
			"nutrition": [
				"Calories: 200 kcal 10 %",
				"Fat: 11.9 g 18 %",
				"Carbs: 7.9g 3 %",
				"Protein: 15.4 g 31 %",
				"Cholesterol: 25 mg 8 %",
				"Sodium: 996 mg 40 %"
			],
			"comment": "This is a great-tasting recipe that is easy to prepare ahead and takes minutes to actually cook it! Serve with rice and veggie side for a nice family dinner!",
			"cal": 200,
			"total_time": 102,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/385999.jpg",
			"ingredients": [
				"1/4 cup soy sauce ",
				" 1 tablespoon hoisin sauce ",
				" 1 tablespoon sesame oil ",
				" 2 teaspoons white sugar ",
				" 1 tablespoon minced garlic ",
				" 1 tablespoon red pepper flakes (optional) ",
				" 1 pound beef flank steak, thinly sliced ",
				" 1 tablespoon peanut oil ",
				" 2 large green onions, thinly sliced "
			]
		},
		{
			"name": "Chicken Lo Mein",
			"reviews": "309",
			"directions": "In a medium, non-reactive bowl, combine the chicken with 2 1/2 teaspoons of white sugar, 1 1/2 tablespoons vinegar and 1/4 cup soy sauce. Mix this together and coat the chicken well. Cover and let marinate in the refrigerator for at least 1 hour. In another medium bowl, combine the chicken broth, water, sesame oil and ground black pepper with the remaining sugar, vinegar and soy sauce. In a separate small bowl, dissolve the cornstarch with some of this mixture and slowly add to the bulk of the mixture, stirring well. Set aside. Cook the linguine according to package directions, drain and set aside. Heat 1 tablespoon of the vegetable oil in a wok or large saucepan over high heat until it starts to smoke. Add the chicken and stir-fry for 4 to 5 minutes, or until browned. Transfer this and all juices to a warm plate. Heat the remaining vegetable oil in the wok or pan over high heat. Add the ginger, garlic, mushrooms and green onions, and stir-fry for 30 seconds. Add the reserved sauce mixture and then the chicken. Simmer until the sauce begins to thicken, about 2 minutes. Add the reserved noodles and toss gently, coating everything well with the sauce.",
			"rating": "4.11734676361084",
			"cook_time": 30,
			"ready_in_time": 135,
			"id": 22791,
			"prep_time": 45,
			"nutrition": [
				"Calories: 603 kcal 30 %",
				"Fat: 14.9 g 23 %",
				"Carbs: 78.9g 25 %",
				"Protein: 38.3 g 77 %",
				"Cholesterol: 62 mg 21 %",
				"Sodium: 2177 mg 87 %"
			],
			"comment": "This dish is easy to make, and full of flavor. The chicken is incredibly tender, and the ginger, garlic and soy sauce combine to give it its authentic taste. Garnish with chopped fresh cilantro.",
			"cal": 603,
			"total_time": 210,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/72787.jpg",
			"ingredients": [
				"4 skinless, boneless chicken breast halves - cut into thin strips ",
				" 5 teaspoons white sugar, divided ",
				" 3 tablespoons rice wine vinegar ",
				" 1/2 cup soy sauce, divided ",
				" 1 1/4 cups chicken broth ",
				" 1 cup water ",
				" 1 tablespoon sesame oil ",
				" 1/2 teaspoon ground black pepper ",
				" 2 tablespoons cornstarch ",
				" 1 (12 ounce) package uncooked linguine pasta ",
				" 2 tablespoons vegetable oil, divided ",
				" 2 tablespoons minced fresh ginger root ",
				" 1 tablespoon minced garlic ",
				" 1/2 pound fresh shiitake mushrooms, stemmed and sliced ",
				" 6 green onions, sliced diagonally into 1/2 inch pieces "
			]
		},
		{
			"name": "Sukhothai Pad Thai",
			"reviews": "271",
			"directions": "To prepare Pad Thai sauce: In a medium saucepan over medium heat, blend sugar, vinegar, soy sauce and tamarind pulp. To make Pad Thai: Soak rice noodles in cold water until soft; drain. In a large skillet or wok over medium heat, warm oil and add garlic and eggs; scramble the eggs. Add tofu and stir until well mixed; add noodles and stir until cooked. Stir in Pad Thai sauce, 1 1/2 tablespoons sugar and 1 1/2 teaspoons salt. Stir in peanuts and ground radish. Remove from heat and add chives and paprika. Serve with lime and bean sprouts on the side.",
			"rating": "4.29715776443481",
			"cook_time": 10,
			"ready_in_time": 30,
			"id": 22792,
			"prep_time": 20,
			"nutrition": [
				"Calories: 619 kcal 31 %",
				"Fat: 34 g 52 %",
				"Carbs: 64.1g 21 %",
				"Protein: 19.5 g 39 %",
				"Cholesterol: 93 mg 31 %",
				"Sodium: 1010 mg 40 %"
			],
			"comment": "This dish can be made with shrimp, chicken or pork instead of tofu. Look for the more exotic items in the Asian foods section at your local grocery store. Adjust the pad Thai sauce ingredients to taste.",
			"cal": 619,
			"total_time": 60,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/466609.jpg",
			"ingredients": [
				"1/2 cup white sugar ",
				" 1/2 cup distilled white vinegar ",
				" 1/4 cup soy sauce ",
				" 2 tablespoons tamarind pulp ",
				" 1 (12 ounce) package dried rice noodles ",
				" 1/2 cup vegetable oil ",
				" 1 1/2 teaspoons minced garlic ",
				" 4 eggs ",
				" 1 (12 ounce) package firm tofu, cut into 1/2 inch strips ",
				" 1 1/2 tablespoons white sugar ",
				" 1 1/2 teaspoons salt ",
				" 1 1/2 cups ground peanuts ",
				" 1 1/2 teaspoons ground, dried oriental radish ",
				" 1/2 cup chopped fresh chives ",
				" 1 tablespoon paprika ",
				" 2 cups fresh bean sprouts ",
				" 1 lime, cut into wedges "
			]
		},
		{
			"name": "Chinese Cabbage Salad I",
			"reviews": "294",
			"directions": "In a preheated 350 degree F oven (175 degree C), toast the crushed noodles and nuts until golden brown. In a large bowl, combine the coleslaw, green onions, toasted ramen noodles and cashews. To prepare the dressing, whisk together the sugar, oil, vinegar and soy sauce. Pour the dressing over the salad, toss and serve.",
			"rating": "4.72703409194946",
			"cook_time": 10,
			"ready_in_time": 25,
			"id": 22793,
			"prep_time": 15,
			"nutrition": [
				"Calories: 290 kcal 15 %",
				"Fat: 21.3 g 33 %",
				"Carbs: 22.8g 7 %",
				"Protein: 4.6 g 9 %",
				"Cholesterol: 3 mg < 1 %",
				"Sodium: 263 mg 11 %"
			],
			"comment": "A delicious salad with a variety of tastes and textures. Uses packaged salad mixes.",
			"cal": 290,
			"total_time": 50,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/88657.jpg",
			"ingredients": [
				"1 (3 ounce) package ramen noodles, crushed ",
				" 10 ounces cashew pieces ",
				" 1 (16 ounce) package shredded coleslaw mix ",
				" 1 bunch green onions, chopped ",
				" 1/2 cup white sugar ",
				" 1/2 cup vegetable oil ",
				" 1/4 cup cider vinegar ",
				" 1 tablespoon soy sauce "
			]
		},
		{
			"name": "Thai Red Chicken Curry",
			"reviews": "313",
			"directions": "Heat the oil in a large skillet over medium-high heat. Add the chicken pieces; cook and stir for about 3 minutes. Mix in the curry paste, zucchini, bell pepper, carrot and onion. Cook and stir for a few minutes. Dissolve the cornstarch in the coconut milk, then pour into the skillet. Bring to a boil, then simmer over medium heat for 1 minutes. Right before serving, stir in the cilantro.",
			"rating": "3.82266020774841",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 22794,
			"prep_time": 10,
			"nutrition": [
				"Calories: 271 kcal 14 %",
				"Fat: 15.8 g 24 %",
				"Carbs: 11.2g 4 %",
				"Protein: 25.4 g 51 %",
				"Cholesterol: 59 mg 20 %",
				"Sodium: 147 mg 6 %"
			],
			"comment": "This is a quick and easy curry stir-fry made with chicken, zucchini, red bell pepper and carrot. Coconut milk and curry paste make an irresistible sauce. No need to go out to eat, as this dish is ready in about 20 minutes!",
			"cal": 271,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/796526.jpg",
			"ingredients": [
				"2 teaspoons olive oil ",
				" 1 pound skinless, boneless chicken breast halves - cut into thin strips ",
				" 1 tablespoon Thai red curry paste ",
				" 1 cup sliced halved zucchini ",
				" 1 red bell pepper, seeded and sliced into strips ",
				" 1/2 cup sliced carrots ",
				" 1 onion, quartered then halved ",
				" 1 tablespoon cornstarch ",
				" 1 (14 ounce) can light coconut milk ",
				" 2 tablespoons chopped fresh cilantro "
			]
		},
		{
			"name": "Sesame Seared Tuna",
			"reviews": "280",
			"directions": "In a small bowl, stir together the soy sauce, mirin, honey and sesame oil. Divide into two equal parts. Stir the rice vinegar into one part and set aside as a dipping sauce. Spread the sesame seeds out on a plate. Coat the tuna steaks with the remaining soy sauce mixture, then press into the sesame seeds to coat. Heat olive oil in a cast iron skillet over high heat until very hot. Place steaks in the pan, and sear for about 30 seconds on each side. Serve with the dipping sauce and wasabi paste.",
			"rating": "4.66927099227905",
			"cook_time": 10,
			"ready_in_time": 20,
			"id": 22795,
			"prep_time": 10,
			"nutrition": [
				"Calories: 422 kcal 21 %",
				"Fat: 20.7 g 32 %",
				"Carbs: 13.2g 4 %",
				"Protein: 44.1 g 88 %",
				"Cholesterol: 77 mg 26 %",
				"Sodium: 1045 mg 42 %"
			],
			"comment": "Easy, great tasting tuna coated with sesame seeds, and quickly seared. This tuna is served rare, so be sure to use a good quality fresh tuna.",
			"cal": 422,
			"total_time": 40,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/39843.jpg",
			"ingredients": [
				"1/4 cup soy sauce ",
				" 1 tablespoon mirin (Japanese sweet wine) ",
				" 1 tablespoon honey ",
				" 2 tablespoons sesame oil ",
				" 1 tablespoon rice wine vinegar ",
				" 4 (6 ounce) tuna steaks ",
				" 1/2 cup sesame seeds ",
				" wasabi paste ",
				" 1 tablespoon olive oil "
			]
		},
		{
			"name": "Slow Cooker Mongolian Beef",
			"reviews": "266",
			"directions": "Place flank steak and cornstarch into a resealable plastic bag. Shake the bag to evenly coat the flank steak with the cornstarch. Allow to steak rest for 10 minutes. Heat olive oil in a large skillet over medium-high heat. Cook and stir steak until evenly browned, 2 to 4 minutes. Place onion, garlic, flank steak, green onions, soy sauce, water, brown sugar, ginger, and hoisin sauce in a slow cooker. Cook on Low setting for about 4 hours.",
			"rating": "3.8985915184021",
			"cook_time": 250,
			"ready_in_time": 270,
			"id": 22796,
			"prep_time": 10,
			"nutrition": [
				"Calories: 450 kcal 23 %",
				"Fat: 13 g 20 %",
				"Carbs: 55.4g 18 %",
				"Protein: 28 g 56 %",
				"Cholesterol: 47 mg 16 %",
				"Sodium: 2391 mg 96 %"
			],
			"comment": "I got this recipe from a friend and it is wonderful. My kids love it. It tastes like you got it at a Chinese restaurant and the slow cooker does most of the work! Serve over steamed rice.",
			"cal": 450,
			"total_time": 530,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/374059.jpg",
			"ingredients": [
				"1 pound flank steak, cut into bite-size pieces ",
				" 1/4 cup cornstarch ",
				" 2 teaspoons olive oil ",
				" 1 onion, thinly sliced ",
				" 1 tablespoon minced garlic ",
				" 3 large green onions, sliced diagonally into 1/2 inch pieces ",
				" 1/2 cup soy sauce ",
				" 1/2 cup water ",
				" 1/2 cup brown sugar ",
				" 1/2 teaspoon minced fresh ginger root ",
				" 1/2 cup hoisin sauce "
			]
		},
		{
			"name": "Quick and Easy Pancit",
			"reviews": "269",
			"directions": "Place the rice noodles in a large bowl, and cover with warm water. When soft, drain, and set aside. Heat oil in a wok or large skillet over medium heat. Saute onion and garlic until soft. Stir in chicken cabbage, carrots and soy sauce. Cook until cabbage begins to soften. Toss in noodles, and cook until heated through, stirring constantly. Transfer pancit to a serving dish and garnish with quartered lemons.",
			"rating": "4.30494499206543",
			"cook_time": 20,
			"ready_in_time": 40,
			"id": 22797,
			"prep_time": 20,
			"nutrition": [
				"Calories: 369 kcal 18 %",
				"Fat: 4.9 g 8 %",
				"Carbs: 65.1g 21 %",
				"Protein: 18.1 g 36 %",
				"Cholesterol: 35 mg 12 %",
				"Sodium: 789 mg 32 %"
			],
			"comment": "Quick, Easy and delicious! Will remind you of Island Fiestas!",
			"cal": 369,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/43962.jpg",
			"ingredients": [
				"1 (12 ounce) package dried rice noodles ",
				" 1 teaspoon vegetable oil ",
				" 1 onion, finely diced ",
				" 3 cloves garlic, minced ",
				" 2 cups diced cooked chicken breast meat ",
				" 1 small head cabbage, thinly sliced ",
				" 4 carrot, thinly sliced ",
				" 1/4 cup soy sauce ",
				" 2 lemons - cut into wedges, for garnish "
			]
		},
		{
			"name": "Chef John's Caramel Chicken",
			"reviews": "295",
			"directions": "Whisk brown sugar, water, fish sauce, rice vinegar, soy sauce, garlic, and ginger in a bowl until brown sugar is completely dissolved, about 1 minute. Set aside. Heat oil over high heat in a skillet. Stir in chicken. Pour 1/3 cup of the brown sugar mixture over chicken; cook and stir until the brown sugar mixture has a syrup-like consistency, 6 to 7 minutes. Pour in the remaining brown sugar mixture; cook until chicken is tender and no longer pink inside, about 5 minutes. Stir in in peanuts, jalapenos and green onion; cook until warmed through, 2 to 3 minutes. Garnish with cilantro and serve.",
			"rating": "4.68112230300903",
			"cook_time": 20,
			"ready_in_time": 40,
			"id": 22798,
			"prep_time": 20,
			"nutrition": [
				"Calories: 615 kcal 31 %",
				"Fat: 33.2 g 51 %",
				"Carbs: 37.9g 12 %",
				"Protein: 43 g 86 %",
				"Cholesterol: 129 mg 43 %",
				"Sodium: 1967 mg 79 %"
			],
			"comment": "This stunning dish is an amazing combination of sweet, spicy, and salty flavors all sticking to succulent pieces of chicken.",
			"cal": 615,
			"total_time": 80,
			"image": "http://images.media-allrecipes.com/userphotos/250x250/837054.jpg",
			"ingredients": [
				"3/4 cup dark brown sugar ",
				" 1/3 cup cold water ",
				" 1/3 cup fish sauce ",
				" 1/3 cup rice vinegar ",
				" 1 tablespoon soy sauce ",
				" 4 cloves garlic, crushed ",
				" 1 tablespoon fresh grated ginger ",
				" 1 teaspoon vegetable oil ",
				" 8 boneless, skinless chicken thighs, quartered ",
				" 1/2 cup roasted peanuts ",
				" 2 fresh jalapeno peppers, seeded and sliced ",
				" 1 bunch green onions, chopped ",
				" fresh cilantro sprigs, for garnish "
			]
		},
		{
			"name": "Easy Chicken Satay",
			"reviews": "282",
			"directions": "Stir together 1/2 cup coconut milk, garlic, 1 teaspoon curry powder, brown sugar, salt, and pepper until the sugar has dissolved. Toss marinade with the chicken, cover, and marinate for at least 2 hours. Bring 1 cup coconut milk, 1 tablespoon curry powder, peanut butter, chicken stock, and 1/4 cup brown sugar to a simmer in a saucepan over medium-high heat. Simmer for 5 minutes, stirring constantly, until smooth and thickened. Remove from heat and stir in lime juice and soy sauce; season to taste with salt. Preheat a grill for medium-high heat. Thread marinated chicken onto skewers, then grill 4 to 5 minutes per side, or until cooked through. Serve with warm peanut sauce.",
			"rating": "4.66011238098145",
			"cook_time": 20,
			"ready_in_time": 165,
			"id": 22799,
			"prep_time": 25,
			"nutrition": [
				"Calories: 418 kcal 21 %",
				"Fat: 28.6 g 44 %",
				"Carbs: 21.2g 7 %",
				"Protein: 24.1 g 48 %",
				"Cholesterol: 40 mg 13 %",
				"Sodium: 571 mg 23 %"
			],
			"comment": "Savory chicken served on skewers with a slightly sweet peanut sauce.",
			"cal": 418,
			"total_time": 210,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/569233.jpg",
			"ingredients": [
				"1/2 cup coconut milk ",
				" 1 clove garlic, minced ",
				" 1 teaspoon curry powder ",
				" 1 1/2 teaspoons brown sugar ",
				" 1/2 teaspoon salt ",
				" 1/2 teaspoon ground black pepper ",
				" 3/4 pound skinless, boneless chicken breast halves - cut into 1 inch strips ",
				" 1 cup coconut milk ",
				" 1 tablespoon curry powder ",
				" 1/2 cup creamy peanut butter ",
				" 3/4 cup chicken stock ",
				" 1/4 cup brown sugar ",
				" 2 tablespoons lime or lemon juice ",
				" 1 teaspoon soy sauce ",
				" Salt to taste ",
				" 10 (6 inch) wooden skewers, or as needed, soaked in water for 30 minutes "
			]
		},
		{
			"name": "Chinese Chicken Salad III",
			"reviews": "304",
			"directions": "To prepare the dressing, whisk together the hoisin sauce, peanut butter, brown sugar, chili paste, ginger, vinegar, and sesame oil. Grill or broil the chicken breasts until cooked, about 10 minutes. An instant-read thermometer inserted into the center should read 165 degrees F (74 degrees C). Cool and slice. Preheat oven to 350 degrees F (175 C). Spray a large shallow pan with nonstick vegetable spray; arrange shredded wontons in a single layer and bake until golden brown, about 20 minutes. Cool. In a large bowl, combine the chicken, wontons, lettuce, carrots, green onions and cilantro. Toss with dressing and serve.",
			"rating": "4.54922294616699",
			"cook_time": 30,
			"ready_in_time": 60,
			"id": 22800,
			"prep_time": 30,
			"nutrition": [
				"Calories: 393 kcal 20 %",
				"Fat: 10.3 g 16 %",
				"Carbs: 41.9g 14 %",
				"Protein: 34.1 g 68 %",
				"Cholesterol: 69 mg 23 %",
				"Sodium: 772 mg 31 %"
			],
			"comment": "This is one of my favorite salads. It tastes so good you wouldn't even suspect it's low-fat. Wonton wrappers (or skins) can be found in the deli or produce section of most supermarkets.",
			"cal": 393,
			"total_time": 120,
			"image": "http://images.media-allrecipes.com/userphotos/560x315/456104.jpg",
			"ingredients": [
				"3 tablespoons hoisin sauce ",
				" 2 tablespoons peanut butter ",
				" 2 teaspoons brown sugar ",
				" 3/4 teaspoon hot chile paste ",
				" 1 teaspoon grated fresh ginger ",
				" 3 tablespoons rice wine vinegar ",
				" 1 tablespoon sesame oil ",
				" 1 pound skinless, boneless chicken breast halves ",
				" 16 (3.5 inch square) wonton wrappers, shredded ",
				" 4 cups romaine lettuce - torn, washed and dried ",
				" 2 cups shredded carrots ",
				" 1 bunch green onions, chopped ",
				" 1/4 cup chopped fresh cilantro "
			]
		}
	]
}